{"blogs": [{"date": ["2015", "12", "12"], "author": "Auriga", "paragraphs": ["Template"], "header": "Welcome", "team": "Webmaster", "images": []}, {"author": "https://shkspr.mobi/blog/2015/05/how-gmail-lets-spammers-grab-your-attention-with-emoji/", "paragraphs": ["The animated GIF lives at https://mail.google.com/mail/e/B69 where it is used for the web version of Gmail.\nFor most of us, the character \"󾭩\" doesn't display as any meaningful symbol - but on the web version of Gmail, it shows up as: , a flashing star.\nGoogle and other members of the Unicode consortium are also developing a proposal for the addition of standardized Emoji symbol characters to Unicode.\nAn ancient form of Emoji, probably all but forgotten, has been resurrected by spammers in the hope that you'll notice their wares.\nThis is a trend I've recently started to see on Gmail - here's what it looks like and how it works."], "header": "How Gmail lets spammers grab your attention with emoji ← Terence Eden's Blog", "team": "Webmaster", "date": ["https://shkspr.mobi/blog/2015/05/how-gmail-lets-spammers-grab-your-attention-with-emoji/"], "citeParagraphs": "https://shkspr.mobi/blog/2015/05/how-gmail-lets-spammers-grab-your-attention-with-emoji/"}, {"author": "http://techcrunch.com/video/y-combinator-incubated/518389021/", "paragraphs": ["But how does YC do it?\nWhat sets it apart from some of the other accelerators out there, and why does it seem like its alumni companies are disproportionately successful?\nY Combinator is the most famous of all startup accelerators out there, thanks to success of companies like Airbnb, Dropbox, and Stripe, all of which have gone through its program."], "header": "Incubated - Features", "team": "Webmaster", "date": ["http://techcrunch.com/video/y-combinator-incubated/518389021/"], "citeParagraphs": "http://techcrunch.com/video/y-combinator-incubated/518389021/"}, {"author": "http://readwrite.com/2010/12/15/another-giant-buys-another-sex", "paragraphs": [""], "header": "", "team": "Webmaster", "date": ["http://readwrite.com/2010/12/15/another-giant-buys-another-sex"], "citeParagraphs": "http://readwrite.com/2010/12/15/another-giant-buys-another-sex"}, {"date": ["https://medium.com/on-startups/you-can-never-size-a-market-in-excel-786886d11f50#.6t6oxias0"], "header": "You Can Never Size a Market in Excel — on startups — Medium", "team": "Webmaster", "author": "https://medium.com/on-startups/you-can-never-size-a-market-in-excel-786886d11f50#.6t6oxias0", "paragraphs": ["You Can Never Size a Market in ExcelOver the course of my career as a VC I’ve been involved with a bunch of fundraising.\nQuestions about “market size” and “opportunity” at this stage seemed peculiar.\nAnd I’ve seen well intentioned VCs burn meeting after meeting with these entrepreneurs genuinely trying to resolve this nagging concern for themselves.\nOf the raises that have fallen into the latter category I’ve seen a common theme.\nIn every single case that I’ve seen this question persist over more than 2 meetings, it has NEVER been resolved."]}, {"date": ["https://medium.com/on-startups/you-can-never-size-a-market-in-excel-786886d11f50"], "header": "You Can Never Size a Market in Excel — on startups — Medium", "paragraphs": ["You Can Never Size a Market in ExcelOver the course of my career as a VC I’ve been involved with a bunch of fundraising.\nQuestions about “market size” and “opportunity” at this stage seemed peculiar.\nAnd I’ve seen well intentioned VCs burn meeting after meeting with these entrepreneurs genuinely trying to resolve this nagging concern for themselves.\nOf the raises that have fallen into the latter category I’ve seen a common theme.\nIn every single case that I’ve seen this question persist over more than 2 meetings, it has NEVER been resolved."], "author": "https://medium.com/on-startups/you-can-never-size-a-market-in-excel-786886d11f50", "team": "Webmaster"}, {"date": ["http://bravenewgeek.com/everything-you-know-about-latency-is-wrong/"], "header": "Everything You Know About Latency Is Wrong – Brave New Geek", "team": "Webmaster", "paragraphs": ["Instead of pausing for 100 seconds after 100 seconds of perfect operation, it handles all requests at 5 ms each after 100 seconds.\nIf you measure 10,000 things in the first 100 seconds, you have to measure 10,000 things in the second 100 seconds during the stall.\nBefore freezing, we run 100 seconds at 100 requests/second for a total of 10,000 requests at 1 ms each.\nNow consider what happens when we freeze the system (for example, using CTRL+Z) after 100 seconds of perfect operation for 100 seconds and repeat.\nIf our test is generating 100 requests/second, we run 10,000 requests in the first 100 seconds."], "author": "http://bravenewgeek.com/everything-you-know-about-latency-is-wrong/"}, {"date": ["http://techcrunch.com/video/y-combinator-incubated/518389021/"], "header": "Incubated - Features", "author": "http://techcrunch.com/video/y-combinator-incubated/518389021/", "paragraphs": ["But how does YC do it?\nWhat sets it apart from some of the other accelerators out there, and why does it seem like its alumni companies are disproportionately successful?\nY Combinator is the most famous of all startup accelerators out there, thanks to success of companies like Airbnb, Dropbox, and Stripe, all of which have gone through its program."], "team": "Webmaster"}, {"date": ["http://cqgplus.com/2015/12/14/some-memories-from-meeting-einstein-in-1951-1952/"], "header": "Some memories from meeting Einstein in 1951 – 1952", "team": "Webmaster", "author": "http://cqgplus.com/2015/12/14/some-memories-from-meeting-einstein-in-1951-1952/", "paragraphs": ["Though concentrating on unified theory, Einstein was still interested in classical General Relativity and its open mathematical problems.\nSome ten years ago, a new interpretation was given to this non-symmetric Einstein theory by Damour and Deser.\nReturning to 1951: after my introduction by Leray, Einstein invited me into his office.\nI showed that these solutions satisfy the Cauchy problem for the quasilinear Einstein equations in harmonic coordinates.\nIn fact Einstein’s conjecture was stronger: he thought that the result should hold for any asymptotically Euclidean complete vacuum Einsteinian spacetime."]}, {"date": ["http://allthingsd.com/20120309/green-dot-buys-location-app-loopt-for-43-4m/"], "header": "Loopt's Sam Altman on Why He Sold to Green Dot for $43.4M", "paragraphs": ["Loopt’s Sam Altman on Why He Sold to Green Dot for $43.4MMobile location start-up Loopt will be acquired by the banking company Green Dot, best-known for its prepaid cards.\nBack when the trend was toward asking users to actively note their own location, Loopt changed to a check-in model in 2009.\nIn a phone interview this morning, Loopt CEO Sam Altman described the deal as an opportunity to make location more accountable.\nAt this point, though, it’s only the latest location app to be acquired and see its own product shut down, following others like Gowalla and Yobongo.\nLoopt’s products are to be shut down at an unspecified date, while its 30 employees will now comprise Green Dot’s Silicon Valley-based mobile product development team."], "author": "http://allthingsd.com/20120309/green-dot-buys-location-app-loopt-for-43-4m/", "team": "Webmaster"}, {"date": ["http://readwrite.com/2010/12/15/another-giant-buys-another-sex"], "header": "", "team": "Webmaster", "paragraphs": [""], "author": "http://readwrite.com/2010/12/15/another-giant-buys-another-sex"}, {"date": ["http://www.slate.com/articles/technology/technology/2015/02/email_overload_building_my_own_email_app_to_reach_inbox_zero.html?wpsrc=sp_all_native_by-section"], "header": "Building my own email app to reach Inbox Zero.", "author": "http://www.slate.com/articles/technology/technology/2015/02/email_overload_building_my_own_email_app_to_reach_inbox_zero.html?wpsrc=sp_all_native_by-section", "paragraphs": ["The first task I had to solve in building my email client was to synchronize email on my computer with the email on the email server.\nEmail clients that are associated with an email provider often bear its name—“Gmail” could mean either Google’s email client or Google’s email service, or both—but they’re two separate things.\nThere are too many dependencies on it.” My email client will treat my email despair, but I don’t believe it can be cured.\nYour email client must download the statuses of potentially tens of thousands of email IDs, simply to reflect a single change.\nSure, that means experimenting with email apps and workflows to find the perfect combination for you or even, if you’re crazy, developing your own email client."], "team": "Webmaster"}, {"date": ["https://medium.com/on-startups/you-can-never-size-a-market-in-excel-786886d11f50#.6t6oxias0"], "header": "You Can Never Size a Market in Excel — on startups — Medium", "team": "Webmaster", "author": "https://medium.com/on-startups/you-can-never-size-a-market-in-excel-786886d11f50#.6t6oxias0", "paragraphs": ["You Can Never Size a Market in ExcelOver the course of my career as a VC I’ve been involved with a bunch of fundraising.\nQuestions about “market size” and “opportunity” at this stage seemed peculiar.\nAnd I’ve seen well intentioned VCs burn meeting after meeting with these entrepreneurs genuinely trying to resolve this nagging concern for themselves.\nOf the raises that have fallen into the latter category I’ve seen a common theme.\nIn every single case that I’ve seen this question persist over more than 2 meetings, it has NEVER been resolved."]}, {"date": ["https://pykello.github.io/databases/2015/12/15/cstore-fdw-files/"], "header": "fdw and 'Files are Hard'", "paragraphs": ["Rename the temporary metadata file to the main metadata file.\nI recently came accross the “Files are hard” article, and it made me wonder how reliable is cstore_fdw’s design and implementation.\nThat is something we should fix, but I’m happy that our design seem to avoid most of the issues discussed in “Files are hard”.\nMetadata FileMetadata file is a small file which contains some version infomration, plus outline of the data file.\nCreate a temporary metadata file, and write the metadata which represents the newly inserted data to it."], "author": "https://pykello.github.io/databases/2015/12/15/cstore-fdw-files/", "team": "Webmaster"}, {"date": ["https://medium.com/on-startups/you-can-never-size-a-market-in-excel-786886d11f50#.6t6oxias0"], "header": "You Can Never Size a Market in Excel — on startups — Medium", "team": "Webmaster", "paragraphs": ["You Can Never Size a Market in ExcelOver the course of my career as a VC I’ve been involved with a bunch of fundraising.\nQuestions about “market size” and “opportunity” at this stage seemed peculiar.\nAnd I’ve seen well intentioned VCs burn meeting after meeting with these entrepreneurs genuinely trying to resolve this nagging concern for themselves.\nOf the raises that have fallen into the latter category I’ve seen a common theme.\nIn every single case that I’ve seen this question persist over more than 2 meetings, it has NEVER been resolved."], "author": "https://medium.com/on-startups/you-can-never-size-a-market-in-excel-786886d11f50#.6t6oxias0"}, {"date": ["http://www.luke.maurits.id.au/blog/post/on-choosing-the-z80-over-the-6502.html"], "header": "On choosing the Z80 over the 6502", "author": "http://www.luke.maurits.id.au/blog/post/on-choosing-the-z80-over-the-6502.html", "paragraphs": ["Both the Z80 and 6502 give you 64 kB of memory space, but the Z80 makes it easier to use all of this space as however you like, and to exercise the full capabilities of your system.\nEmphatically, this is not supposed to be a \"6502 sux0rs, here's why the z80 beats the snot out of it!\nThe stack situation on the 6502 is thus not as bad as I first thought, but is still more limited than the Z80.\nI will say that I am quite new to the Z80, and actually have no hands-on experience building 6502 systems, though I've done a lot of reading.\nYou can use the Z80 or the 6502."], "team": "Webmaster"}, {"date": ["http://www.atlasobscura.com/articles/the-poisonous-beauty-advice-columns-of-victorian-england"], "header": "The Poisonous Beauty Advice Columns of Victorian England", "team": "Webmaster", "author": "http://www.atlasobscura.com/articles/the-poisonous-beauty-advice-columns-of-victorian-england", "paragraphs": ["And, similar to today, the advice on how, if, and when to use these treatments came from the era’s most popular beauty columns.\nIn Victorian England, these were some of the ways women began their daily beauty routines.\nPowers, a beauty expert of the time, and became so popular that it was re-published in 1874 as an anthology.\nThe “Ugly Girl Papers” has the tone of a wise aunt with endless advice on how to solve your beauty woes.\nWhen read as a collection, beauty columns like “The Ugly Girl Papers” have a strangely contradictory feel."]}, {"date": ["http://www.nytimes.com/2015/12/20/business/theranos-founder-faces-a-test-of-technology-and-reputation.html?_r=0"], "header": "Theranos Founder Faces a Test of Technology, and Reputation", "paragraphs": ["Early on, Ms. Holmes courted pharmaceutical manufacturers, where the Theranos technology would allow companies to conduct clinical trials at lower costs.\nShe often spoke as though the company’s technology already existed, they said, rather than as if it were still in development.\n) Additionally, the Theranos technology relies on pricking a finger, rather than using a needle, to draw blood.\nBut the Theranos equipment was heavier than the hand-held device the Defense Department was already using for some tests, and the Theranos tests still needed F.D.A.\nBut an investigation published in The Wall Street Journal in October changed the narrative by raising serious concerns about whether the company’s technology actually works."], "author": "http://www.nytimes.com/2015/12/20/business/theranos-founder-faces-a-test-of-technology-and-reputation.html?_r=0", "team": "Webmaster"}, {"date": ["http://www.legalfutures.co.uk/latest-news/report-ai-will-transform-legal-world"], "header": "500 Internal Server Error", "team": "Webmaster", "paragraphs": ["Process legal work would rapidly descend in cost.”The human part of lawyering would shrink.\nIt anticipated: “Far greater global balance in the largest law firms as they seek to follow clients into developing markets and key megacities and global cities around the world.\nJomati’s top five cities in 2030 for their legal markets were New York, London, Paris, Frankfurt, and Singapore.\nThe report’s focus on the future of work contained the most disturbing findings for lawyers.\nAlternative business structures (ABSs) in particular will be receptive, it predicted, “as it will greatly suit the type of matters they handle”."], "author": "http://www.legalfutures.co.uk/latest-news/report-ai-will-transform-legal-world"}, {"date": ["http://profmattstrassler.com/2015/12/18/so-what-is-it/"], "header": "Of Particular Significance", "author": "http://profmattstrassler.com/2015/12/18/so-what-is-it/", "paragraphs": ["If this bump is a real particle, there must be at least one other particle that makes such a two-photon bump possible.\nIn fact, signs of an additional particle or particles may already be obvious (or almost obvious) in their existing data.\nIt could be a simple elementary particle like the electron, interacting with known particles indirectly, as a result of direct interactions with some heavy, as yet unknown particles.\nIt can’t just be a second Higgs particle (a heavier version of the one found in 2012) that is just appended to the known particles, with no other particles added in.\nHowever, perhaps the bump is a clue … a clue that can lead us to a discovery that can happen much sooner."], "team": "Webmaster"}, {"date": ["http://www.aurorasentinel.com/news/jackpot-fixing-investigation-expands-to-more-state-lotteries/"], "header": "Jackpot-fixing investigation expands to more state lotteries", "team": "Webmaster", "author": "http://www.aurorasentinel.com/news/jackpot-fixing-investigation-expands-to-more-state-lotteries/", "paragraphs": ["Rhodes, a businessman from Sugar Land, Texas, is charged with fraud in connection with the Iowa jackpot, and is under investigation in Wisconsin.\nMiller praised the Iowa lottery’s skepticism about the suspicious jackpot but wonders whether other lotteries would have been as careful.\nHe is also charged with ongoing criminal conduct and money laundering involving the other three state lotteries.\nInvestigators allege that he passed the winning ticket to Rhodes, his University of Houston classmate, who then worked with associates to try to collect.\nThe case took a dramatic twist when authorities released surveillance footage from the service station showing a stocky, hooded man buying the winning ticket and hot dogs in December 2010."]}, {"date": ["https://www.mnot.net/blog/2015/12/18/451"], "header": "Why 451?", "paragraphs": [""], "author": "https://www.mnot.net/blog/2015/12/18/451", "team": "Webmaster"}, {"date": ["http://www.solarcrunch.org/2015/12/99-of-costa-ricas-electricity-came-from.html"], "header": "99% of Costa Rica's electricity came from renewable energy in 2015", "team": "Webmaster", "paragraphs": ["Renewable energy has become the latest trend now, given i...\nCountries around the world are geared up for a change in their use of energy."], "author": "http://www.solarcrunch.org/2015/12/99-of-costa-ricas-electricity-came-from.html"}, {"date": ["http://www.monkeysnatchbanana.com/2015/12/19/inside-the-pony-tcp-stack/"], "header": "Inside the Pony TCP Stack", "author": "http://www.monkeysnatchbanana.com/2015/12/19/inside-the-pony-tcp-stack/", "paragraphs": ["Let's get started...A Skeleton for a Pony TCP serverOur echo server is built around a two classes that implement interfaces that are part of the Pony network stack.\n\"\"\" None fun ref not_listening(listen: TCPListener ref) => \"\"\" Called if it wasn't possible to bind the listener to an address.\n\"\"\" None fun ref auth_failed(conn: TCPConnection ref) => \"\"\" A raw TCPConnection has no authentication mechanism.\nMost of the code examples are simplified versions of actual Pony code.\n\"\"\" fun ref listening(listen: TCPListener ref) => \"\"\" Called when the listener has been bound to an address."], "team": "Webmaster"}, {"date": ["http://jordan-wright.com/blog/2015/02/28/how-tor-works-part-one"], "header": "How Tor Works: Part One", "team": "Webmaster", "author": "http://jordan-wright.com/blog/2015/02/28/how-tor-works-part-one", "paragraphs": ["To answer this question, let’s take a high-level look at how the encryption works when a client makes a connection through the Tor network.\nIn this series of posts, we’ll take a deep dive into the structure and protocols used by the Tor network in order to see first-hand how Tor operates.\nExit Relay – These relays are the exit point at the edge of the Tor network.\nEach of these have a specific role to play (we’ll cover each in more detail in later posts):Client Guard Relay Middle Relay Exit Relay DesinationEntry/Guard Relay – This is the entry point to the Tor network.\nTor 101Now that we know a bit about Tor’s history, let’s talk about how it works."]}, {"date": ["http://research.microsoft.com/apps/video/default.aspx?id=259667"], "header": "Future Microprocessors Driven by Dataflow Principles", "paragraphs": ["Architects and the semiconductor industry as a whole is faced with a unique challenge of improving performance and reducing power consumption of future microprocessors with almost no gain coming from device scaling.\nIn this talk, I will describe how the underlying principles of explicit dataflow based computation can be applied to both the design of cores and accelerators.\nSpecifically I will highlight a simple observation: a hybrid execution model that allows both sequential and dataflow based execution can be extremely beneficial.\nApplying these same principles to the design of accelerators, shows we can build a single programmable accelerator that can match the efficiency and performance of \"any\" domain-specific accelerator.\nIs there a principled way to build future processors that can avoid this trap of adhoc integration?"], "author": "http://research.microsoft.com/apps/video/default.aspx?id=259667", "team": "Webmaster"}, {"date": ["https://mycosymbiotics.wordpress.com/2015/10/18/wild-shiitake-found-in-new-england/"], "header": "Wild Shiitake found in New England!", "team": "Webmaster", "paragraphs": ["If you ever find Shiitake Growing Wild please dry it and send us a sample to tissue culture, Thank You!\nThere have been rumors of shiitake growing wild in the U.S. With 2 confirmed cases it looks like we have a 3rd!\nWith more and more people growing Shiitake the spore load has never been higher, some were bound to find a fitting environment.\nShiitake grows wild in its Native Habitat of East Asia.\nShiitake mushrooms (Lentinula edodes) have been a culinary delight in the orient for a few thousand years!"], "author": "https://mycosymbiotics.wordpress.com/2015/10/18/wild-shiitake-found-in-new-england/"}, {"date": ["http://gizmodo.com/the-real-science-behind-the-crazy-night-vision-eyedrops-1694955347"], "header": "The Real Science Behind the Crazy Night Vision Eyedrops", "author": "http://gizmodo.com/the-real-science-behind-the-crazy-night-vision-eyedrops-1694955347", "paragraphs": ["Eyedrops with a chlorophyll analog called chlorin e6 seemed, they said, to induce temporary night vision.\nIn case you missed it, the internet exploded last week when a pair of biohackers with the group Science for the Masses shared a report about night vision.\nThe night vision stuff has been shuffling along, mostly as a side project all these years.\nThe Problems With the Night Vision Eye Drop ExperimentIn Licina’s own words: “Let’s be fair here.\nThe National Institutes of Health is not in the business of enhancing night vision; it is in the business of finding cures for things like blindness."], "team": "Webmaster"}, {"date": ["http://www.telegraph.co.uk/technology/news/12061813/Spotify-partners-with-Tesla-for-integrated-in-car-music-system.html"], "header": "Spotify partners with Tesla for integrated in-car music system", "team": "Webmaster", "author": "http://www.telegraph.co.uk/technology/news/12061813/Spotify-partners-with-Tesla-for-integrated-in-car-music-system.html", "paragraphs": ["It plans to release its third model - Model 3 - in March 2016.\nTesla's Model S electric car series will now ship with Spotify Premium integration, replacing former music partner Rdio, in Europe, Australia and Hong Kong.\nExisting Premium Spotify accounts can be linked to the vehicle to listen back to favoured playlists, radio stations and artists.\nCurrent Model S owners will also benefit from the feature thanks to an over-the-air software upgrade from Monday.\nTesla recently recalled some 90,000 Model S cars after discovering a fault with a passenger's seatbelt."]}, {"date": ["http://thehustle.co/clifford-stoll-why-the-internet-will-fail"], "header": "Why the Internet Will Fail (Newsweek, 1995)", "paragraphs": ["So how come my local mall does more business in an afternoon than the entire Internet handles in a month?\nWhat the Internet hucksters won’t tell you is that the Internet is one big ocean of unedited data, without any pretense of completeness.\nAnd so, to celebrate our baby’s big 2-5, I’m sharing with you a Newsweek article from 1995 that was written by one of these naysayers.\nModern internet (the World Wide Web) turned 25-years-old this past week on December 20th.\nConsider today’s online world."], "author": "http://thehustle.co/clifford-stoll-why-the-internet-will-fail", "team": "Webmaster"}, {"date": ["http://marginalrevolution.com/marginalrevolution/2015/12/subsidies-increase-tuition-part-xiv.html"], "header": "Subsidies Increase Tuition, Part XIV", "team": "Webmaster", "paragraphs": ["Subsidies Increase Tuition, Part XIVIn a new NBER paper, Accounting for the Rise in College Tuition, Grey Gordon and Aaron Hedlund create a sophisticated model of the college market and find that a large fraction of the increase in tuition can be explained by increases in subsidies.\nRemarkably, so much of the subsidy is translated into higher tuition that enrollment doesn’t increase!\nBy contrast, with all factors present except the demand shocks (column 7), net tuition only rises by 16%.\nWith all factors present, net tuition increases from $6,100 to $12,559.\nAs column 4 demonstrates, the demand shocks— which consist mostly of changes in financial aid—account for the lion’s share of the higher tuition."], "author": "http://marginalrevolution.com/marginalrevolution/2015/12/subsidies-increase-tuition-part-xiv.html"}, {"date": ["http://variety.com/2015/digital/news/vivendi-buys-majority-stake-in-winamp-shoutcast-owner-radionomy-1201664170/"], "header": "Winamp and Shoutcast Now Owned by Vivendi, Orthers", "author": "http://variety.com/2015/digital/news/vivendi-buys-majority-stake-in-winamp-shoutcast-owner-radionomy-1201664170/", "paragraphs": ["Winamp is back… in the hands of a major corporation: Vivendi has acquired a 64.4 percent stake in Radionomy, the European online radio services company that owns Winamp and Shoutcast as well as the online radio ad marketplace Targetspot.\nIn addition to Vivendi, Radionomy is being owned by founder Alexandre Saboundjian, its employees and Union Square Ventures, according to a statement released Thursday.\nWinamp is a pioneering MP3 player software, which in many ways was instrumental to the early success of digital music.\nIn early 2014, radio aggregation and advertising services provider Radionomy announced the acquisition of Winamp as well as the early the online radio directory and streaming technology platform Shoutcast, which had also been developed and maintained by the Winamp team.\nRadionomy has apparently been working on a new version of Winamp, which hasn’t been released yet."], "team": "Webmaster"}, {"date": ["http://www.bbc.com/news/health-35153795"], "header": "Bacteria that resist 'last antibiotic' found in UK", "team": "Webmaster", "author": "http://www.bbc.com/news/health-35153795", "paragraphs": ["Bacteria that resist the most common antibiotic of last resort - colistin - have been discovered in the UK.\nBut Public Health England and the Animal and Plant Health Agency began testing for it.\nPublic Health England has gone through the 24,000 bacterial samples it keeps on record from cases between 2012 and 2015.\nOfficials say the threat to human health is low, but is under ongoing review.\nA spokesperson said: \"We are enhancing our surveillance for colistin resistance, and veterinary prescribers have voluntarily updated prescribing guidelines to restrict use of colistin in animals."]}, {"date": ["http://qz.com/577146/quartzs-chart-of-the-year-for-2015/"], "header": "Quartz’s Chart of the Year™ for 2015", "paragraphs": ["That’s pretty much what this year’s choice for Quartz’s Chart of the Year™ does.\nThe world’s most important economic story can be told in a single line.\nIn an age awash in charts, data visualizations and animated doodads, this chart is a great example of an uncluttered illustration.\nAnd it clearly and quickly explains what’s arguably the most important economic story in the world.\n“People just get it completely wrong,” says Roser, of the expectation that poverty would be rising rather than shrinking."], "author": "http://qz.com/577146/quartzs-chart-of-the-year-for-2015/", "team": "Webmaster"}, {"date": ["http://usa.streetsblog.org/2015/12/10/real-estate-giant-suburban-office-parks-increasingly-obsolete/#.Vnhp_CD-0bs.twitter"], "header": "Real Estate Giant: Suburban Office Parks Increasingly Obsolete", "team": "Webmaster", "paragraphs": ["by Angie SchmittWhat tenants want in an office building is changing, and the old model of the isolated suburban office park is going the way of the fax machine.\nIn the “southeast suburban” Denver office district, for example, office buildings within a quarter-mile of the new light rail line had a 1.7 percent vacancy rate.\nThe old-school office park does “not offer the experience most of today’s tenants are seeking,” according to NGKF.\nParking was also important to the marketability of buildings in suburban Denver.\nFor those outside a quarter-mile, vacancy rates were nine percentage points higher."], "author": "http://usa.streetsblog.org/2015/12/10/real-estate-giant-suburban-office-parks-increasingly-obsolete/#.Vnhp_CD-0bs.twitter"}, {"date": ["http://www.sandiegouniontribune.com/news/2015/oct/22/imprimis-turing-daraprim/"], "header": "Drug costing $750 a capsule gets competition from new $1 rival", "author": "http://www.sandiegouniontribune.com/news/2015/oct/22/imprimis-turing-daraprim/", "paragraphs": ["Turing's drug, Daraprim, is a brand-name formulation of the generic drug pyrimethamine.\nMoreover, the company, Imprimis Pharmaceuticals, plans to compete against other manufacturers who sell generic drugs far above their cost.\nTuring Pharmaceuticals sparked nationwide outrage and government investigations when it raised the cost of a generic drug used for AIDS and cancer from $13.50 to $750 a capsule.\nHowever, a company that buys a generic drug didn't pay for the research, and pays much less than if the drug had still been under patent.\nMark L. Baum, Imprimis CEO.— Imprimis Pharmaceuticals + Read Caption Share Photo ✉Joe Panetta, CEO of the San Diego-based life science trade group Biocom, said the Imprimis announcement was good news."], "team": "Webmaster"}, {"date": ["http://www.vanityfair.com/news/2015/12/martin-shkreli-pharmaceuticals-ceo-interview"], "header": "Everything You Know About Martin Shkreli Is Wrong—or Is It?", "team": "Webmaster", "author": "http://www.vanityfair.com/news/2015/12/martin-shkreli-pharmaceuticals-ceo-interview", "paragraphs": ["No less an authority than Donald Trump said that Shkreli “looks like a spoiled brat.” “My parents were immigrants and janitors,” Shkreli says.\nMr. Shkreli then hung up.” Shkreli has called the Retrophin lawsuit “completely false, untrue at best, and defamatory at worst.” But on Thursday, December 17, he was escorted by the F.B.I.\nThe tsunami of rage (the BBC asked if Shkreli was “the most hated man in America”) only got worse when Shkreli said he would lower the price—and then didn’t.\nShkreli got to know the small group of investors who focus on shorting such stocks—betting that they’ll go down when they prove ineffective or don’t get F.D.A.\n(Shkreli, in turn, sent Sanders a $2,700 campaign donation, which the senator gave to a healthcare clinic."]}, {"date": ["http://www.theguardian.com/media/2015/dec/20/social-media-twitter-online-shame"], "header": "Jon Ronson: How the online hate mob set its sights on me", "paragraphs": ["Facebook Twitter Pinterest Twitter suddenly felt uncaring, intimidating, even dangerous ... Ronson.\n• The new paperback edition of So You’ve Been Publicly Shamed by Jon Ronson is published by Picador at £8.99 on 31 December 2015.\nBut I just couldn’t see how Justine’s shaming made anything better, given that her joke was intended to mock racism.\n“Maybe Jon Ronson will cape up for ’em,” somebody wrote.\nGroggy or anxious.”Facebook Twitter Pinterest Rachel Dolezal who was relentlessly hounded online after being ‘outed’ as a white woman."], "author": "http://www.theguardian.com/media/2015/dec/20/social-media-twitter-online-shame", "team": "Webmaster"}, {"date": ["http://www.wsj.com/articles/how-hoverboards-epitomize-our-broken-patent-system-1450674060?mod=e2fb"], "header": "How ‘Hoverboards’ Epitomize Our Broken Patent System", "team": "Webmaster", "paragraphs": ["Their popularity also has led to a surprisingly far-reaching patent war.\nAs a result, the way innovation in hardware is nurtured and rewarded might never be the same—or at least I hope that will be the case.\nHoverboards are the surprise hit of this holiday season even though they are catching fire, getting banned by airlines and being removed from retailers because of shoddy batteries and an apparent lack of quality control."], "author": "http://www.wsj.com/articles/how-hoverboards-epitomize-our-broken-patent-system-1450674060?mod=e2fb"}, {"date": ["https://medium.com/@alizauf/i-redesigned-the-usps-package-delivery-slip-fd43d8607753"], "header": "I redesigned the USPS package delivery slip. — Startups, Wanderlust, and Life Hacking — Medium", "author": "https://medium.com/@alizauf/i-redesigned-the-usps-package-delivery-slip-fd43d8607753", "paragraphs": ["For the record, my form is most definitely not an official USPS form.\nThis is where the USPS form really breaks down.\nConfirmation of Receipt The USPS also uses this form as a receipt when you need to sign for your package.\nThe 3 options (Redelivery, Post Office, gopost) to get your package back are listed multiple times, though in certain places there are only 2 options listed.\nYour options for getting your package Once you know what your package is, you want to know what you can do to get it."], "team": "Webmaster"}, {"date": ["https://medium.com/@onuryilmaz/comparison-of-go-vendoring-tools-acf019ea476f"], "header": "Comparison of Go Vendoring Tools — Medium", "team": "Webmaster", "author": "https://medium.com/@onuryilmaz/comparison-of-go-vendoring-tools-acf019ea476f", "paragraphs": ["Comparison of Go Vendoring ToolsVendoring for Go language is best presented in Go 1.5 documentation:Go 1.5 includes experimental support for using local copies of external dependencies to satisfy imports of those dependencies, often referred to as vendoring.\nThere is a list of tools supporting this feature in Package Management Tools wiki page.\nYou can read further in Go 1.5 Vendor Experiment design document.\n) for two projects with internal and external dependencies.\nStarting with the most popular tool, I have used each tool for “saving dependencies” and “updating dependencies”."]}, {"date": ["https://medium.com/@onuryilmaz/comparison-of-go-vendoring-tools-acf019ea476f#.stjps4e70"], "header": "Comparison of Go Vendoring Tools — Medium", "paragraphs": ["Comparison of Go Vendoring ToolsVendoring for Go language is best presented in Go 1.5 documentation:Go 1.5 includes experimental support for using local copies of external dependencies to satisfy imports of those dependencies, often referred to as vendoring.\nThere is a list of tools supporting this feature in Package Management Tools wiki page.\nYou can read further in Go 1.5 Vendor Experiment design document.\n) for two projects with internal and external dependencies.\nStarting with the most popular tool, I have used each tool for “saving dependencies” and “updating dependencies”."], "author": "https://medium.com/@onuryilmaz/comparison-of-go-vendoring-tools-acf019ea476f#.stjps4e70", "team": "Webmaster"}, {"date": ["http://www.everydaylistening.com/articles/2009/6/15/sound-on-websites-a-sensitive-subject.html"], "header": "Sound Art, Sound Installations, Sonic Inspiration", "team": "Webmaster", "paragraphs": ["One positive example I found of the right use of background sound is the website of Artis, the zoo in Amsterdam.\nAlmost all people I ask about background music on websites tell me they find it totally annoying.\nThere are other websites where sound might work, like on an abstract, futuristic, artistic site, a piece of art in itself.\nI believe the right use of the right sounds can actually improve the user experience of a website.\nDo you have good or bad experiences with websites with background music and/or interface sounds?"], "author": "http://www.everydaylistening.com/articles/2009/6/15/sound-on-websites-a-sensitive-subject.html"}, {"date": ["https://aeon.co/essays/why-do-scientists-dismiss-the-possibility-of-cold-fusion"], "header": "Why do scientists dismiss the possibility of cold fu...", "author": "https://aeon.co/essays/why-do-scientists-dismiss-the-possibility-of-cold-fusion", "paragraphs": ["If the reputation trap makes it impossible to question the role of the reputation trap, then the Cardinals are winning.\nCold fusion is tainted, and the taint is contagious – anyone seen to take it seriously risks contamination.\nWhat if we already knew, on theoretical grounds alone, that cold fusion was impossible?\nAfter all, the standard line is that the rejection of cold fusion in 1989 turned on the failure to replicate the claims of Fleischmann and Pons.\nOutsiders might be surprised to learn how well-populated the trap actually is, in the case of cold fusion and LENR."], "team": "Webmaster"}, {"date": ["http://www.fiercebigdata.com/story/venture-capital-firm-names-algorithm-its-board-directors/2014-05-19"], "header": "Venture capital firm names an algorithm to its board of directors", "team": "Webmaster", "author": "http://www.fiercebigdata.com/story/venture-capital-firm-names-algorithm-its-board-directors/2014-05-19", "paragraphs": ["A Hong Kong-based VC fund, Deep Knowledge Ventures, has just appointed an algorithm to its board of directors.\nAccording to a post in Business Insider the Fund says the algorithm, named VITAL, gets a vote on investment opportunities.\nI can see requiring the board to embrace data-driven decision-making as such is a smart business move.\n\"'[The goal] is actually to draw attention developing it as an independent decision maker,' said Deep Knowledge Venture's Charles Groome\" in the Business Insider post.\nBut to appoint a specific algorithm as a board member is just nuts."]}, {"date": ["http://news.blog.statesman.com/2015/12/22/software-giant-oracle-to-build-major-austin-campus-add-employees/"], "header": "Software giant Oracle to build major Austin campus, add employees", "paragraphs": ["With the new campus, Oracle plans to grow its Austin workforce by 50 percent over the next few years, the company said.\nOracle plans to collaborate with local firms to design and build the campus in a phased approach, which will include consolidation of Oracle facilities from Oregon.\nOracle said the Austin campus and hiring push is part of a globalinitiative to keep pace with demand for cloud services and to attract top millennial talent.\n“We’re positioning the State of Texas to become a home for innovation and technology,” Texas Gov.\nArmour said Oracle will be moving some employees from existing Austin locations to the new campus."], "author": "http://news.blog.statesman.com/2015/12/22/software-giant-oracle-to-build-major-austin-campus-add-employees/", "team": "Webmaster"}, {"date": ["https://blog.cloudflare.com/sha-1-deprecation-no-browser-left-behind/"], "header": "SHA-1 Deprecation: No Browser Left Behind", "team": "Webmaster", "paragraphs": [") sailthru.com invitro.ru relax.by ligabbva.com deindeal.ch webtatic.com liftmaster.com jobvite.com SHA-1 certificate expired udsm.ac.tz SHA-1 certificate expired rdvmedicaux.com SHA-1 certificate expired univ-nantes.fr SHA-1 certificate expired l2inc.com SHA-1 certificate expired hellweg.de SHA-1 certificate expired meintrendyhandy.de SHA-1 certificate expired inweb24.com SHA-1 certificate expired planetnatural.com SHA-1 certificate expiredChicken & Egg: MozillaCloudFlare, as of today, adds another 4,000 sites of the top 100,000 to this soon-to-be-less-exclusive club.\nIt's a classic chicken-and-egg problem: customers with legacy browsers can't upgrade if the site where you download the modern browser requires a modern browser.\nAnd, starting January 1, 2016, you will no longer be able to get a new SHA-1 certificate from most certificate authorities.\nSHA-2: This Time It’s DifferentUnfortunately, unlike with the deprecation of MD5, where SHA-1 was widely available across even legacy browsers, SHA-2 support is more limited.\nSHA-1 FallbackThe practical solution is to serve SHA-2 signed certificates for modern browsers and fall back to SHA-1 certificates for browsers that cannot support SHA-2."], "author": "https://blog.cloudflare.com/sha-1-deprecation-no-browser-left-behind/"}, {"date": ["http://techcrunch.com/2015/10/19/common-building-opening/"], "header": "Common, The Co-Living Startup From A General Assembly Founder, Opens Its First Building in Brooklyn", "author": "http://techcrunch.com/2015/10/19/common-building-opening/", "paragraphs": ["Common, a co-living startup from General Assembly co-founder Brad Hargreaves, is unveiling its first building today in Brooklyn’s Crown Heights.\n“The whole idea here is is to use common areas and activate typically under-utilized space,” Hargreaves told me in a video tour via Skype.\nThey served a wide range of price tiers from luxury palace hotels on down through middle-income residential hotels and then into lower-income lodging houses and tenements.\nIn San Francisco, residential hotels went from serving 1/16th of the city population in 1880 to 1 out of every 10 people by 1910.\nOver the summer, Common partnered with a local New York City real estate developer to buy Crown Heights building earlier this year."], "team": "Webmaster"}, {"date": ["https://bugwolf.com/blog/the-advantages-of-outsourcing-application-testing"], "header": "The advantages of outsourcing application testing", "team": "Webmaster", "author": "https://bugwolf.com/blog/the-advantages-of-outsourcing-application-testing", "paragraphs": ["This isn’t always bad, in fact, outsourcing application testing can be a very smart move.\nQuality testing requires the skill, time and resources that small and midsized and sometimes even large companies cannot provide.\nSupporting a full time testing team is a costly proposition that only the biggest can afford.\nEven then, these large companies are known to, at times, outsource their testing requirements.\nIt’s rather easy for internal team members to be too gentle with each other."]}, {"date": ["http://blog.cryptographyengineering.com/2015/12/on-juniper-backdoor.html"], "header": "A Few Thoughts on Cryptographic Engineering", "paragraphs": ["Let me tell you the story of my tiny brush with the biggest crypto story of the year .\nA few weeks ago I received a call from a reporter a..."], "author": "http://blog.cryptographyengineering.com/2015/12/on-juniper-backdoor.html", "team": "Webmaster"}, {"date": ["http://www.wsj.com/article_email/google-plans-new-smarter-messaging-app-1450816899-lMyQjAxMTA1OTI5MjUyMDI5Wj"], "header": "Google Plans New, Smarter Messaging App", "team": "Webmaster", "paragraphs": ["But Google’s two messaging services—Hangouts and Messenger—trail far behind Facebook’s WhatsApp and Messenger and Tencent Holdings Ltd.’s WeChat, the most popular messaging app in China.\nFor its new service, Google, a unit of Alphabet Inc., plans to integrate chatbots, software programs that answer questions inside a messaging app, the people familiar with the matter said.\nGoogle is taking these capabilities, currently delivered in the form of a search service, and integrating them into its new messaging service, the people said.\nUsers typically join messaging services because they know other users; Google has struggled to create such network effects with both Hangouts and Messenger.\nSherpa Capital has invested in Luka.ai, another startup that is building a messaging service that also answers questions and performs other tasks."], "author": "http://www.wsj.com/article_email/google-plans-new-smarter-messaging-app-1450816899-lMyQjAxMTA1OTI5MjUyMDI5Wj"}, {"date": ["http://www.wired.com/2015/12/2015-losers/"], "header": "Tech Giants That Fell From Grace", "author": "http://www.wired.com/2015/12/2015-losers/", "paragraphs": ["This year, Quirky filed for bankruptcy, revealing just how difficult it is to run what was effectively a manufacturing company as a tech company.\nTheranos Was ExposedPeople hailed Theranos as tech’s Next Big Thing long before seeing real evidence supporting the blood-testing company’s claims.\nAll the while, the company has struggled to contain the rampant and dangerous abuse that takes place on the platform.\nStill, despite the depth of the company’s deception, Volkswagen’s stock price is already showing signs of a rebound.\nWe’re not counting Twitter out yet, but Dorsey certainly has a busy year ahead of him in 2016."], "team": "Webmaster"}, {"date": ["https://www.eff.org/deeplinks/2015/12/eff-court-lifetime-gps-tracking-violates-fourth-amendment"], "header": "EFF to Court: Lifetime GPS Tracking Violates the Fourth Amendment", "team": "Webmaster", "author": "https://www.eff.org/deeplinks/2015/12/eff-court-lifetime-gps-tracking-violates-fourth-amendment", "paragraphs": ["It held that the state’s GPS tracking statute violated Belleau’s Fourth Amendment right against unreasonable searches and seizures and retroactively increased the punishment for a crime.\nAnd because the statute subjects individuals to GPS surveillance after they are fully discharged from their sentences, it’s a form of retroactive punishment prohibited by the Constitution.\nThe law, among other things, imposed lifetime GPS monitoring on individuals who committed certain specified sexual violence offenses.\nThis is especially true given the accuracy of GPS technology; some of the GPS devices now available for purchase are advertised to be accurate within mere centimeters.\nAnd now we’re starting to see it with GPS tracking."]}, {"date": ["http://www.nytimes.com/2015/12/21/technology/as-downloads-take-over-a-turning-point-for-the-video-game-industry.html?ref=business"], "header": "As Downloads Take Over, a Turning Point for the Video Game Industry", "paragraphs": ["But the signs of a sharp turning point have piled up in the last month, as new data points have painted conflicting pictures of the game industry.\n“It finally feels like the inevitable is becoming the inevitable,” said Evan Wilson, an analyst who follows the game industry for Pacific Crest Securities.\nAs a result, it is becoming harder to judge the health of the industry based on sales of physical game discs.\nThe numbers were particularly striking because if game sales are ever going to grow, the time is now.\n“Customers cannot access that expertise downloading a game, nor can they trade in a digital game for currency that can be applied to the purchase of their next game,” Mr. Mooring said in an email."], "author": "http://www.nytimes.com/2015/12/21/technology/as-downloads-take-over-a-turning-point-for-the-video-game-industry.html?ref=business", "team": "Webmaster"}, {"date": ["http://konoff.co/move-really-fast-and-make-things-with-cookiecutter/"], "header": "Move (really) fast and make things – with Cookiecutter", "team": "Webmaster", "paragraphs": ["And now that you know how to make and adapt cookiecutter templates, you'll be able to make whatever your heart desires, and to make it fast, too.\nTo get started, find the cookiecutter repo you want, then clone it (here's a list of all of them).\nMe eat cookieWe’ve got the cookiecutter template ready to go, but how about deploying the apps you make with it?\nNow, whenever you make a project from your cookiecutter template, that button will make deploying that new project easy.\nLet's run through that now: we'll make a new project called cookietester from my custom cookiecutter template:mkvirtualenv cookietester pip install cookiecutter cookiecutter https://github.com/andkon/cookiemonster project_name [project_name]: cookietester repo_name [Reddit_Clone]: cookietester ... git add ."], "author": "http://konoff.co/move-really-fast-and-make-things-with-cookiecutter/"}, {"date": ["https://medium.com/@benschwarz/7-things-i-ve-learned-by-running-a-business-by-myself-5e047386be65#.gb89gukc2"], "header": "7 things I’ve learned by running a business by myself — Medium", "author": "https://medium.com/@benschwarz/7-things-i-ve-learned-by-running-a-business-by-myself-5e047386be65#.gb89gukc2", "paragraphs": ["Your customers don’t care if you use a fancy database or JavaScript library.\nYou don’t have to start building a huge business that will dominate everything in it’s path.\nColleagues are perfect for validating an idea, business contacts for affirming a proof of concept, but it’s actual customers who can vindicate a feature.\nEnergy and confidence can be easily defeated —It’s important to understand and take care of your mental health, especially if running a business on your own.\nSometimes, it can be better to put things off entirely until you’ve got the time to do them properly."], "team": "Webmaster"}, {"date": ["http://medicinehatnews.com/news/world-news/2015/12/22/the-latest-judge-bars-only-black-lives-matter-organizers-from-planned-mall-of-america-protest/"], "header": "Judge bars only Black Lives Matter organizers from planned Mall of America protest › Medicine Hat News", "team": "Webmaster", "author": "http://medicinehatnews.com/news/world-news/2015/12/22/the-latest-judge-bars-only-black-lives-matter-organizers-from-planned-mall-of-america-protest/", "paragraphs": ["MINNEAPOLIS – The latest developments on plans by Black Lives Matter activists to protest at the Mall of America (all times local):3:55 p.m.A judge has barred three people from attending an upcoming Black Lives Matter protest they organized at the Mall of America but says she doesn’t have the power to prevent others from showing up to demonstrate.\nBlack Lives Matter organizers plan to rally at the mall Wednesday to protest the death of Jamar Clark, who was shot by Minneapolis police Nov. 15 and later died.\nJudge Karen Janisch on Tuesday approved the nation’s largest mall’s request for a temporary restraining order barring the protest organizers from showing up there on Wednesday.\nBlack Lives Matter protesters have vowed to demonstrate regardless of the judge’s decision, hoping to draw attention to last month’s police killing of a black man and to pressure investigators to release video of the shooting.\nOn Monday, protesters vowed to hold their protest regardless of Janisch’s ruling."]}, {"date": ["http://www.rollingstone.com/politics/news/tens-of-thousands-of-college-students-have-nowhere-to-sleep-20151222"], "header": "Tens of Thousands of College Students Have Nowhere to Sleep", "paragraphs": ["Once in college, students face an incredible financial burden, made particularly acute if they lack support from their families.\nOn November 10, Democratic Sen. Patty Murray of Washington introduced legislation aiming to increase the resources available to those housing-insecure college students and ease the barriers to financial aid.\nThe Higher Education Access and Success for Homeless and Foster Youth Act of 2015 is meant to help homeless youth and children in the foster care system gain access to higher education.\nIn 2010, it created the Higher Education Helpline, where both students and university employees can call in with problems related to homelessness.\n\"For so many students, higher education can be a ticket to the middle class,\" Sen. Murray said in a statement to Rolling Stone, \"but students struggling with homelessness and students in foster care face several unique barriers that effectively shut that door of opportunity."], "author": "http://www.rollingstone.com/politics/news/tens-of-thousands-of-college-students-have-nowhere-to-sleep-20151222", "team": "Webmaster"}, {"date": ["https://www.quantamagazine.org/20151222-solution-the-fabulously-fair-feast/"], "header": "Solution: ‘The Fabulously Fair Feast’", "team": "Webmaster", "paragraphs": ["The rug is the artist’s rendition of a Hadamard matrix of order 428, which was the smallest unknown matrix order back in 2004.\nThe Hadamard conjecture states that Hadamard matrices exist for any number n that is a multiple of 4.\nMathematicians have consequently been trying to find Hadamard matrices for all multiples of 4, or find a multiple for which one does not exist.\nIn June of that year, Hadi Kharaghani and Behruz Tayfeh-Rezaie built a Hadamard matrix of order 428.\nThe drawing of the rug is based on this 428×428 Hadamard matrix."], "author": "https://www.quantamagazine.org/20151222-solution-the-fabulously-fair-feast/"}, {"date": ["http://www.maximise.dk/the-high-tech-floating-christmas-tree/"], "header": "Startups, economics, technology and a wee bit of poetry", "author": "http://www.maximise.dk/the-high-tech-floating-christmas-tree/", "paragraphs": ["Denmark is prone to some pretty decent december storms, and the christmas tree needs to be able to survive these.\nThe sailing yule tree – Video pattern test in Teglværkshavnen from Christian Liljedahl on Vimeo.\nFor a christmas tree to be spectacular when it is on a barge in the water it needs to be a certain size.\nThere were 2 main considerations;attachment of the christmas tree to the barge needed to be robust.\nFor the tree we used 12 RGB LED chains with the WS2811 controller built into each LED."], "team": "Webmaster"}, {"date": ["http://techcrunch.com/2015/12/21/gusto-is-looking-for-another-50m-to-take-on-zenefits/"], "header": "Gusto Raises $50M At A $1B Valuation To Take On Zenefits", "team": "Webmaster", "author": "http://techcrunch.com/2015/12/21/gusto-is-looking-for-another-50m-to-take-on-zenefits/", "paragraphs": ["Gusto (formerly ZenPayroll) has raised $50 million at a $1 billion pre-money valuation, CEO Joshua Reeves told TechCrunch.\nSo it makes sense that Gusto needs to continue picking up cash in order to get ahead of Zenefits.\nOriginally focused on payroll services, the company recently expanded into HR and benefits tools, an area where Zenefits is quickly growing after raising $500 million at a $4.5 billion valuation.\nGusto raised $60 million in April this year at a $560 million post-money valuation with its eyes on continuing to expand, which includes growing its headcount.\nBoth Zenefits and Gusto have to work their way into small businesses across the country, which can be capital intensive as it essentially requires picking them up one-by-one."]}, {"date": ["http://thenextweb.com/insider/2015/12/18/i-analyzed-250-saas-pricing-pages-heres-what-i-found/"], "header": "I analyzed 250 SaaS pricing pages — here’s what I found", "paragraphs": ["Here’s one of the rare cases from Constant Contact:What can this teach us about SaaS pricing pages?\nLet’s look at what I found when analyzing the SaaS pricing pages of the remaining 48.\nThere are a lot of best practices for SaaS pricing pages out there, with giants like HubSpot, ConversionXL and SixteenVentures being the authorities.\nThis shouldn’t teach you not to offer pricing on a sliding scale because only 4 percent of the most successful SaaS companies does it.\nInstead of listing a large fixed price for enterprise customers, SaaS products should opt for a ‘contact us’ or risk blowing big deals."], "author": "http://thenextweb.com/insider/2015/12/18/i-analyzed-250-saas-pricing-pages-heres-what-i-found/", "team": "Webmaster"}, {"date": ["https://www.reddit.com/r/IAmA/comments/3xtpod/my_name_is_thomas_helleday_a_cancer_scientist/"], "header": "My name is Thomas Helleday, a cancer scientist leading a lab of 70 scientist. Lets do an AMA!", "team": "Webmaster", "paragraphs": ["My name is Thomas Helleday.\n(The posts: http://imgur.com/gallery/sjz5KyI, http://imgur.com/gallery/6SRmqJc)So now we are starting an AMA series where you get to ask scientists questions.\nWe did a few post on imgur explaining our work and people expressed interest in an AMA.\nA little bit more about myself: My interests are many and most of them are related to the work we do in the lab.\nI am the professor leading the Helleday Laboratory."], "author": "https://www.reddit.com/r/IAmA/comments/3xtpod/my_name_is_thomas_helleday_a_cancer_scientist/"}, {"date": ["http://www.vox.com/2015/10/28/9626810/apple-iphone-profits-explained"], "header": "How Apple became the world's most valuable company, explained", "author": "http://www.vox.com/2015/10/28/9626810/apple-iphone-profits-explained", "paragraphs": ["The more than $206 billion Apple has now is on top of money it has already pushed out to shareholders.\nAt the low end of the market — phones that cost $300 or less — Android phones are totally dominant.\nAt the high end of the market, Android companies have been strugglingThe smartphone market is increasingly becoming two distinct submarkets.\nApple is the world's most valuable company by a wide margin, and on Tuesday it released financial results that demonstrated why its stock is valued so highly by investors.\nApple is mostly an iPhone companyTo understand why Apple is such a huge and profitable company, you really only have to look at a single product: the iPhone."], "team": "Webmaster"}, {"date": ["http://www.wsj.com/articles/youtube-says-t-mobile-is-throttling-its-video-traffic-1450821730"], "header": "YouTube Says T-Mobile Is Throttling Its Video Traffic", "team": "Webmaster", "author": "http://www.wsj.com/articles/youtube-says-t-mobile-is-throttling-its-video-traffic-1450821730", "paragraphs": ["YouTube said T-Mobile US Inc. is interfering with its video traffic, raising a new issue as federal regulators examine the wireless carrier’s streaming-video strategy.\nIn a less-noticed move, T-Mobile is also lowering the quality of video that isn’t part of the program, such as YouTube.\nT-Mobile recently began offering a program that delivers video at lower quality in exchange for waiving related data fees.\nYouTube, which is..."]}, {"date": ["http://mobile.nytimes.com/2015/12/23/business/dealbook/sued-over-old-debt-and-blocked-from-suing-back.html"], "header": "Sued Over Old Debt, and Blocked From Suing Back", "paragraphs": ["The tactic, they said, is emerging at an opportune time, given that debt collectors are being sued for violating federal law.\nIn the last few years, debt collectors have pushed the parameters of that legal strategy into audacious new territory.\nWhen defendants are absent, judges have little choice but to find in favor of the debt collectors, according to interviews.\nConsumer lawyers said this strategy was the legal equivalent of debt collectors having their cake and eating it, too.\nDebt collectors counter that they are buying loan contracts, and the terms come with them."], "author": "http://mobile.nytimes.com/2015/12/23/business/dealbook/sued-over-old-debt-and-blocked-from-suing-back.html", "team": "Webmaster"}, {"date": ["http://wilsonquarterly.com/stories/want-to-boost-the-economy-take-a-nap-at-work/"], "header": "Want to boost the economy? Take a nap at work. by Julia Higgins", "team": "Webmaster", "paragraphs": ["Further Reading:European Society of Cardiology, “Midday naps associated with reduced blood pressure and fewer medications,” August 29, 2015.\nNASA, the Huffington Post, Ben & Jerry’s, and AOL, among others, have since bought into the idea of nap rooms.\nGoogle was one of the first corporate mammoths to offer communal EnergyPods in its headquarters, spending thousands of dollars to ensure that employees could nap at work.\nJennifer R. Goldschmied, et al., “Napping to modulate frustration and impulsivity: a pilot study,” Personality and Individual Differences, November 2015.\nUp until the turn of the millennium, when the wellness industry developed into a booming commercial enterprise, Anglo-Saxon cultures were at the opposite end of the nap spectrum."], "author": "http://wilsonquarterly.com/stories/want-to-boost-the-economy-take-a-nap-at-work/"}, {"date": ["http://www.theparisreview.org/blog/2015/03/05/wittgenstein-schoolteacher"], "header": "What Wittgenstein Learned from Teaching Elementary School", "author": "http://www.theparisreview.org/blog/2015/03/05/wittgenstein-schoolteacher", "paragraphs": ["Great teaching, Wittgenstein reminds us, involves taking this struggle and engaging in it with others; his whole life was one great such struggle.\nEthics, religion, the nature of the world beyond objects … most statements of traditional philosophy, Wittgenstein contended, are therefore nonsense.\nHis sister Hermine told him that applying his genius to teaching children was like using a “precision instrument” to open crates.\nIn 1920, after a year of training, Wittgenstein took up a post at an elementary school in Trattenbach.\nIt was a tiny farming and factory village in the mountains south of Vienna; Wittgenstein accepted the job there after rejecting one in a town he decided was too cosmopolitan."], "team": "Webmaster"}, {"date": ["http://fermatslibrary.com/s/irrationality-of-square-root-of-m"], "header": "Irrationality of √m annotated/explained version.", "team": "Webmaster", "author": "http://fermatslibrary.com/s/irrationality-of-square-root-of-m", "paragraphs": ["Suggest a Paper you would like to see being annotated by the community (url):Send us your email and we will tell you when it's available:"]}, {"date": ["http://www.seattletimes.com/seattle-news/politics/inslee-error-releases-inmates-early-since-2002/"], "header": "Inslee: Error releases up to 3,200 inmates early", "paragraphs": ["OLYMPIA — For three years, state Department of Corrections staff knew a software-coding error was miscalculating prison sentences and allowing inmates to be released early.\nThe state does not have a complete list of names of those released early, according to Brown.\nJay Inslee announced Tuesday the Washington Department of Corrections has been making mistakes in calculating sentences since 2002, resulting in thousands of inmates leaving prison early.\nMany prisoners released early may not wind up being re-incarcerated, according to Brown.\nThe sentencing enhancements associated with the calculation error, according to DOC, are firearm enhancement, sex-offense enhancement, and deadly-weapon enhancement."], "author": "http://www.seattletimes.com/seattle-news/politics/inslee-error-releases-inmates-early-since-2002/", "team": "Webmaster"}, {"date": ["http://www.nytimes.com/2015/12/23/us/politics/1950s-us-nuclear-target-list-offers-chilling-insight.html?smtyp=cur&amp;_r=0"], "header": "1950s U.S. Nuclear Target List Offers Chilling Insight", "team": "Webmaster", "paragraphs": ["275 from the nuclear target list for 1959 may be the most chilling.\nMr. Burr, who specializes in nuclear history, said he believed it was the most detailed target list the Air Force had ever made public.\n“We’ve known the general contours of nuclear war planning for a few decades,” he said.\nIt was produced at a time before intercontinental or submarine-launched missiles, when piloted bombers were essentially the only means of delivering nuclear weapons.\nThe authors of the 1956 target list had lived through those experiences."], "author": "http://www.nytimes.com/2015/12/23/us/politics/1950s-us-nuclear-target-list-offers-chilling-insight.html?smtyp=cur&amp;_r=0"}, {"date": ["http://www.lionsroar.com/may-the-fourth-and-luke-skywalkers-wisdom-be-with-you/?utm_source=Shambhala+Sun+Community&utm_campaign=233ccf2f35-SF_Weekly_Dec_22_201512_21_2015&utm_medium=email&utm_term=0_1988ee44b2-233ccf2f35-21955001"], "header": "Luke Skywalker Practices the Dharma of Star Wars", "author": "http://www.lionsroar.com/may-the-fourth-and-luke-skywalkers-wisdom-be-with-you/?utm_source=Shambhala+Sun+Community&utm_campaign=233ccf2f35-SF_Weekly_Dec_22_201512_21_2015&utm_medium=email&utm_term=0_1988ee44b2-233ccf2f35-21955001", "paragraphs": ["He writes, “In Star Wars, it is Luke Skywalker in the saga’s ﬁnal chapter that best exempliﬁes wisdom and compassion.\nReprinted from “The Dharma of Star Wars” with permission from Wisdom Publications, 199 Elm Street, Somerville, MA 02144 USA.\nIn Return of the Jedi Luke has developed these qualities of being better than any Jedi before him—even better than his Master Obi-Wan.” Read about Luke Skywalker’s practice of wisdom.\nOffering understanding and compassion, Luke appeals to the good Anakin that remained in the shadows of Darth Vader.\nAfter his confrontation with Darth Vader in The Empire Strikes Back, Luke knows good still remains in his father."], "team": "Webmaster"}, {"date": ["https://www.washingtonpost.com/news/worldviews/wp/2015/12/23/zimbabwes-curious-plan-to-adopt-chinas-currency/"], "header": "Zimbabwe’s curious plan to adopt China’s currency", "team": "Webmaster", "author": "https://www.washingtonpost.com/news/worldviews/wp/2015/12/23/zimbabwes-curious-plan-to-adopt-chinas-currency/", "paragraphs": ["Chinese President Xi Jinping is greeted by Zimbabwean President Robert Mugabe as he arrives on Dec. 1, 2015, in Harare.\nMore on WorldViewsZimbabwean strongman Robert Mugabe wins China’s version of the Nobel Peace PrizeZimbabwe’s Mugabe says his people failed to protect Cecil the lion\nThe news is just the latest wild twist for the Zimbabwean currency.\nSix months ago, Zimbabwe's central bank announced that it was finally phasing out the local currency, the Zimbabwean dollar, after years of hyperinflation had left the currency virtually worthless.\nZimbabwe was the first stop on Chinese President Xi Jinping's tour of Africa this month, where Mugabe greeted him by saying, \"China is Zimbabwe's all-weather friend."]}, {"date": ["http://www.infoworld.com/article/3016733/application-development/in-search-of-a-cure-for-slow-mobile-downloads.html"], "header": "In search of a cure for slow mobile downloads", "paragraphs": ["Nobody likes waiting for downloads, and mobile users like it least of all -- a difficult fact of life for the makers of mobile apps.\nThis also means they fail to take advantage of unique opportunities afforded by the new dominant platform: native mobile apps.\nPacketZoom pairs an SDK with a cloud service for accelerating content delivery to native mobile apps.\nAnd yet almost every native mobile application on the market still runs on the HTTP protocol over TCP.\nThe security of native mobile apps deserves more attention."], "author": "http://www.infoworld.com/article/3016733/application-development/in-search-of-a-cure-for-slow-mobile-downloads.html", "team": "Webmaster"}, {"date": ["https://www.rt.com/usa/326834-americans-poverty-effect-greater-study/"], "header": "Poverty hinders IQ in the US more than other Western countries – study — RT USA", "team": "Webmaster", "paragraphs": ["Texan and Scottish researchers have found people born in the US suffer the effects of poverty more than in other western countries while studying the relationship between poverty and IQ.\nThe link between poverty and a lower IQ was less noticeable in western Europe and Australia, but not in the Netherlands.\nPoverty seems to have the biggest impact in US,” according to a statement from the University of Texas, Austin.\nUsing meta-analysis, researchers concluded that a person’s social environment can override their genetic potential for intelligence, at least in the US.\n“The authors determined that childhood poverty appears to reduce the potential contained with a person’s genes, and that the situation varies from country to country."], "author": "https://www.rt.com/usa/326834-americans-poverty-effect-greater-study/"}, {"date": ["http://www.bbc.com/news/magazine-31604026"], "header": "The girl who gets gifts from birds", "author": "http://www.bbc.com/news/magazine-31604026", "paragraphs": ["Media caption Gabi feeding birds in her gardenIt was after they adopted this routine that the gifts started appearing.\nBut crow gifts are not guaranteed.\nLots of people love the birds in their garden, but it's rare for that affection to be reciprocated.\nIt is an odd assortment of objects for a little girl to treasure, but to Gabi these things are more valuable than gold.\nShe feeds the crows in her garden - and they bring her gifts in return."], "team": "Webmaster"}, {"date": ["http://www.theguardian.com/commentisfree/2015/dec/23/embrace-future-longing-past-nostalgia-memories?CMP=twt_gu"], "header": "We can’t embrace the future if we’re longing for the past", "team": "Webmaster", "author": "http://www.theguardian.com/commentisfree/2015/dec/23/embrace-future-longing-past-nostalgia-memories?CMP=twt_gu", "paragraphs": [""]}, {"date": ["http://venturebeat.com/2015/12/22/google-is-reportedly-developing-a-chatbot-infused-messaging-service/"], "header": "Google is reportedly developing a chatbot-infused messaging service", "paragraphs": ["A report in the Wall Street Journal claims that Google is working on yet another mobile messaging service, with a heavy focus on artificial intelligence.\nHowever, as with its Google+ social network, the Alphabet subsidiary has found social more difficult to crack than with some of its other core businesses.\nGoogle has long participated in the instant messaging space, with current offering Hangouts having successfully completed a years-long transition from the previous primary IM solution, Google Talk.\nThe company is expected to open its service up to developers in hopes of encouraging a third-party bot ecosystem.\nThe platform would include a number of so-called “chatbots” for responding to user queries, according to the report — sort of an “OK Google” for in-chat assistance."], "author": "http://venturebeat.com/2015/12/22/google-is-reportedly-developing-a-chatbot-infused-messaging-service/", "team": "Webmaster"}, {"date": ["http://www.technologyreview.com/view/544991/ford-and-google-could-be-making-the-model-t-of-automated-driving/"], "header": "Ford and Google Could Be Making the Model T of Automated Driving", "team": "Webmaster", "paragraphs": ["In what could turn out to be a very important partnership for the future of the car, Ford and Google are reportedly planning a joint venture to develop automated driving technology.\nIf so, it would be a major moment in the history of automated driving.\nOther cars that feature some automated driving capabilities are similarly priced.\nGoogle’s prototype self-driving car is already being tested in Mountain View, California, and in Austin, Texas.\nThe venture could also help Google gain a foothold in the auto industry without needing to get into manufacturing cars itself."], "author": "http://www.technologyreview.com/view/544991/ford-and-google-could-be-making-the-model-t-of-automated-driving/"}, {"date": ["https://www.kickstarter.com/projects/754265265/peek-the-professional-microscope-that-fits-in-your"], "header": "The Professional Microscope that Fits in Your Wallet by Scrona —Kickstarter", "author": "https://www.kickstarter.com/projects/754265265/peek-the-professional-microscope-that-fits-in-your", "paragraphs": ["Besides standard bright-field microscopy, µPeek handles dark-field and fluorescence (only µPeek Blue) microscopy, as well as polarized illumination.\nMultiple Microscopy Modes - Single DeviceµPeek’s innovative (patent-pending) illumination design allows performing several distinctive modes of microscopy.\nSize MattersNot much larger than a credit card and about half the thickness of an average smartphone, µPeek comfortably disappears into any pocket and snugly fits into your wallet.\nµPeek is the first smartphone microscope that combines the functionality of a full-fledged microscope with pleasing aesthetics, true everyday portability and user-friendly operation via an Android/iOS App.\nPersonalize the outcome of your observations by combining the information of all available microscopy modes into your favorite visual setting."], "team": "Webmaster"}, {"date": ["http://www.bbc.com/news/blogs-news-from-elsewhere-35161213"], "header": "Italy: Town bans pizza-making over soaring pollution", "team": "Webmaster", "author": "http://www.bbc.com/news/blogs-news-from-elsewhere-35161213", "paragraphs": ["The measure has been prompted by \"utmost concern\" over worsening air quality, and will stay in place until 31 March.\n\"Naples has many more pizzerias than San Vitaliano but doesn't have the same pollution levels.\nBad air quality is a longstanding problem for San Vitaliano.\nImage copyright Getty Images Image caption Pizza-making is one of the factors that have made St Vitaliano one of the worst-polluted towns in ItalyA town in Italy has imposed a temporary ban on the traditional way of pizza-making as a measure to curb soaring pollution.\nIn 2015, San Vitaliano exceeded the threshold for emissions 114 times, compared to 86 times in Milan, another badly polluted Italian city, the paper says."]}, {"date": ["http://snowplowanalytics.com/blog/2015/12/22/snowplow-r74-european-honey-buzzard-with-weather-enrichment-released/"], "header": "Snowplow 74 European Honey Buzzard with Weather Enrichment released – Snowplow", "paragraphs": ["We are pleased to announce the release of Snowplow release 74 European Honey Buzzard.\nThis release adds a Weather Enrichment to the Hadoop pipeline - making Snowplow the first event analytics platform with built-in weather analytics!\nConfiguring the weather enrichmentTo use the new Weather Enrichment functionality you need to:Obtain an OpenWeatherMap.org API key to perform historical requests.\nBut the most-requested enrichment remains a Weather Enrichment: specifically, using the time and geo-location of each event to retrieve the weather and attach it to the event as a context, ready for later analysis.\nNotice that failed weather enrichment will cause your whole enriched event to end up in the bad bucketis the time in seconds after which request should be considered failed."], "author": "http://snowplowanalytics.com/blog/2015/12/22/snowplow-r74-european-honey-buzzard-with-weather-enrichment-released/", "team": "Webmaster"}, {"date": ["http://www.lionsroar.com/was-yoda-based-on-this-buddhist-master/?utm_source=Shambhala+Sun+Community&utm_campaign=233ccf2f35-SF_Weekly_Dec_22_201512_21_2015&utm_medium=email&utm_term=0_1988ee44b2-233ccf2f35-21955001"], "header": "Was Yoda based on this Buddhist master?", "team": "Webmaster", "paragraphs": ["Star Wars is loved by many Buddhists for its hidden Buddhist teachings (more on that in our excerpt from Matthew Bortolin’s The Dharma of Star Wars).\n\"[Rinpoche] had these deep, deep wrinkles on his forehead; it was the model for Yoda in Star Wars,\" \"[Rinpoche] had these deep, deep wrinkles on his forehead; it was the model for Yoda in Star Wars,\" said Berzin in a talk.\nThere is no try!”For more on the Jedi bodhisattvas, read our excerpt from Matthew Bortolin’s The Dharma of Star Wars.\nAccording to Buddhist scholar Alexander Berzin, George Lucas traveled to Dharamsala, India, prior to making Star Wars, and met a Tibetan Buddhist teacher named Tsenzhab Serkong Rinpoche, a debate partner and tutor of the Dalai Lama.\n'” Gitoku put that inspiration into a now-Internet-famous illustration of Yoda in the Zenga style alongside a calligraphy of “No, try not."], "author": "http://www.lionsroar.com/was-yoda-based-on-this-buddhist-master/?utm_source=Shambhala+Sun+Community&utm_campaign=233ccf2f35-SF_Weekly_Dec_22_201512_21_2015&utm_medium=email&utm_term=0_1988ee44b2-233ccf2f35-21955001"}, {"date": ["https://medium.com/@benschwarz/7-things-i-ve-learned-by-running-a-business-by-myself-5e047386be65"], "header": "7 things I’ve learned by running a business by myself — Medium", "author": "https://medium.com/@benschwarz/7-things-i-ve-learned-by-running-a-business-by-myself-5e047386be65", "paragraphs": ["Your customers don’t care if you use a fancy database or JavaScript library.\nYou don’t have to start building a huge business that will dominate everything in it’s path.\nColleagues are perfect for validating an idea, business contacts for affirming a proof of concept, but it’s actual customers who can vindicate a feature.\nEnergy and confidence can be easily defeated —It’s important to understand and take care of your mental health, especially if running a business on your own.\nSometimes, it can be better to put things off entirely until you’ve got the time to do them properly."], "team": "Webmaster"}, {"date": ["http://a16z.com/2015/08/06/wechat-china-mobile-first/"], "header": "When One App Rules Them All: The Case of WeChat and Mobile in China", "team": "Webmaster", "author": "http://a16z.com/2015/08/06/wechat-china-mobile-first/", "paragraphs": ["In China, meanwhile, usage of the WeChat Payments platform is growing so quickly that WeChat is experimenting with processing payments offline via QR codes at brick-and-mortar stores, live events, vending machines, restaurants, and hotels.\nInterestingly, because the official accounts platform also allows for “white listing” of users, WeChat official accounts empower both large companies and small- and medium-sized businesses (SMBs) to create easy-to-develop enterprise-grade solutions.\nIt’s worth sharing that before WeChat launched in 2011, the most popular messaging app in China was called QQ — and it was also made by Tencent.\nWhile seemingly just a messaging app, WeChat is actually more of a portal, a platform, and even a mobile operating system depending on how you look at it.\nThis makes WeChat more like a browser for mobile websites, or, arguably, a mobile operating system — complete with its own proprietary app store."]}, {"date": ["http://blogs.howstuffworks.com/brainstuff/what-does-a-gigabyte-of-internet-service-really-cost-a-look-at-the-worst-case-scenario.htm"], "header": "What does a gigabyte of Internet service really cost? A look at the worst case scenario", "paragraphs": ["$1 per gigabyte), it brings up a great question – how much does it really cost to provide Internet access?\nIn other words, Internet service can be provided profitably for pennies per gigabyte in the absolute worst case scenario.\nGiven that cost structure, and the fact that the cable can handle (in round numbers) 5 terabits/second or 500 gigabytes/second, how much does a gigabyte cost in this system?\nIf they did use it evenly, then the cost per gigabyte truly would be 1.9 cents per gigabyte.\nThe question we have to ask, however, is this: does that number represent the true cost of bandwidth?"], "author": "http://blogs.howstuffworks.com/brainstuff/what-does-a-gigabyte-of-internet-service-really-cost-a-look-at-the-worst-case-scenario.htm", "team": "Webmaster"}, {"date": ["http://blog.pieratt.com/post/977179815/in-praise-of-quitting-your-job"], "header": "In Praise of Quitting Your Job", "team": "Webmaster", "paragraphs": ["The reason I’m so supportive of you quitting your job is that I’m intensely empathetic to your situation and I believe that you’re doing everyone a disservice by sticking around.\nI hope that you’re able to recognize this fact and move forward accordingly.\nBy 7 months the work was having a tangible effect on my mood and outlook, and by nine months, I’ve quit almost every job I’ve held.\nIn Praise of Quitting Your JobI wrote this email to a friend a few weeks ago, and then the topic came up again last night with an old buddy who was frustrated with his work.\nThis is something that I came to peace with after I left my last job, and I get the sense that you’re still struggling with it."], "author": "http://blog.pieratt.com/post/977179815/in-praise-of-quitting-your-job"}, {"date": ["http://kkovacs.eu/cassandra-vs-mongodb-vs-couchdb-vs-redis"], "header": "Cassandra vs MongoDB vs CouchDB vs Redis vs Riak vs HBase vs Couchbase vs Hypertable vs ElasticSearch vs Accumulo vs VoltDB vs Scalaris comparison", "author": "http://kkovacs.eu/cassandra-vs-mongodb-vs-couchdb-vs-redis", "paragraphs": [""], "team": "Webmaster"}, {"date": ["https://soundcloud.com/nzherald/kim-dotcoms-new-zealand-lawyer-rob-mansfield"], "header": "Kim Dotcom's New Zealand lawyer Rob Mansfield by nzherald", "team": "Webmaster", "author": "https://soundcloud.com/nzherald/kim-dotcoms-new-zealand-lawyer-rob-mansfield", "paragraphs": ["Dotcom's lawyer Rob Mansfield talks to Newstalk ZB's Larry Williams about the decision.\nKim Dotcom is vowing to fight a court decision ruling he should be extradited to the United States."]}, {"date": ["http://netforza.com/genial-santa-claus-2-the-christmas-cards/"], "header": "Genial Santa Claus 2 – the Christmas Cards", "paragraphs": ["In “Genial Santa Claus 2 – the Christmas Cards” You have to match 3+ Christmas cards in a row to create toys.\n“Genial Santa Claus 2 – the Christmas Cards” is the continuation of the first Genial Santa game, it’s a winter holidays themed sliding puzzle with match 3 mechanics.\nIf Santa Claus has no more presents to give, you lose.\nThe toys can be used to fulfill Christmas wishes and earn smiles.\nWe have considered all the mistakes we made in the first version and released an improved game that will bring you hours of fun."], "author": "http://netforza.com/genial-santa-claus-2-the-christmas-cards/", "team": "Webmaster"}, {"date": ["http://arstechnica.com/science/2015/12/big-first-step-single-chip-handles-both-optical-and-electrical-signals/"], "header": "Progress! New CMOS chip can process both light and electricity", "team": "Webmaster", "paragraphs": ["Putting together a mixed electronic and optical chip required figuring out a whole series of similar approaches to work around limitations.\nOnce the light reaches the chip, however, everything that handles that light has to be made of silicon.\nFurther Reading IBM demos first fully integrated monolithic silicon photonics chip Electro-optical chips could bring big bandwidth gains and lower power consumption.\nWhile there's still a lot of work left to get this technology up to its potential, optical hardware may start showing up close to the CPU sooner than that, relying on separate optical chips.\nAs a result, most efforts in this area have used separate chips: one for the processor, one for the optical interconnect."], "author": "http://arstechnica.com/science/2015/12/big-first-step-single-chip-handles-both-optical-and-electrical-signals/"}, {"date": ["http://www.theatlantic.com/magazine/archive/2002/04/seeing-around-corners/302471/"], "header": "Seeing Around Corners", "author": "http://www.theatlantic.com/magazine/archive/2002/04/seeing-around-corners/302471/", "paragraphs": ["The new science of artificial societies suggests that real ones are both more predictable and more surprising than we thought.\nMoreover, artificial societies do not belong to any one academic discipline, and their roots are, accordingly, difficult to trace.\nWhen I first looked at it, I thought I must be seeing a model of a community full of racists.\nWeb-only Sidebars:Artificial Society AnimationsWatch QuickTime animations of the artificial societies discussed in this article.\n(March 29, 2002)Jonathan Rauch talks about what the study of artificial societies has to tell us about the real world."], "team": "Webmaster"}, {"date": ["https://www.washingtonpost.com/lifestyle/style/jingle-bell-rock-lots-of-radio-stations-go-all-christmas-in-december-heres-why/2015/12/21/5b2a5836-a442-11e5-ad3f-991ce3374e23_story.html"], "header": "Jingle bell rock: Lots of radio stations go all-Christmas in December. Here’s why.", "team": "Webmaster", "author": "https://www.washingtonpost.com/lifestyle/style/jingle-bell-rock-lots-of-radio-stations-go-all-christmas-in-december-heres-why/2015/12/21/5b2a5836-a442-11e5-ad3f-991ce3374e23_story.html", "paragraphs": ["And there are the radio stations that have to choose between the two.\nIn the meantime, though, you may notice a certain comforting similarity to the Christmas songs you hear on most stations.\nSame goes for Christmas radio.\nIn Baltimore, holiday station 101.9 WLIF also rose from fifth to first last year.\n1 in listener share last holiday season, according to Nielsen Audio polling."]}, {"date": ["http://techcrunch.com/2015/12/23/palantir-has-raised-880-million-at-a-20-billion-valuation/"], "header": "Palantir Has Raised $880 Million At A $20 Billion Valuation", "paragraphs": ["Palantir also now has a valuation of $20.33 billion, up from $15 billion in 2014.\nThe Securities Investment Protection Corporation used Palantir’s technology to convict Ponzi schemer Bernie Madoff, for example.\nPalantir, the data analytics platform used by government agencies and law enforcement pocketed $880 million in new funding, according to a filing from the Securities and Exchange Commission out today.\nThe new valuation makes it the fourth most highly valued tech startup, just under Airbnb, Xiaomi and Uber.\nThe startup has now raised $2.32 billion in total."], "author": "http://techcrunch.com/2015/12/23/palantir-has-raised-880-million-at-a-20-billion-valuation/", "team": "Webmaster"}, {"date": ["http://www.i-programmer.info/news/145-mapping-a-gis/9164-gps-always-over-estimates-distances.html"], "header": "GPS Always Overestimates Distances", "team": "Webmaster", "paragraphs": ["A moment's thought should reveal that this suggests that the GPS distance will be less than the true path.\nSo given that the GPS path is just a sum of distances computed between pairs of points, the total estimated distance is going to be bigger than the true distance because of random errors.\nGiven this observation you would expect the distance between two points located with unbiased random error would also be unbiased, i.e.\nGPS devices can measure speed using Doppler shift and this is accurate and not subject to the same measurement bias.\nHave you had a suspicion that your GPS app is overestimating the distance traveled?"], "author": "http://www.i-programmer.info/news/145-mapping-a-gis/9164-gps-always-over-estimates-distances.html"}, {"date": ["http://venturebeat.com/2015/12/23/rnts-media-buys-mobile-ad-network-heyzap-for-20m/"], "header": "RNTS Media buys mobile ad network Heyzap for $45M", "author": "http://venturebeat.com/2015/12/23/rnts-media-buys-mobile-ad-network-heyzap-for-20m/", "paragraphs": ["We're closing the doors to yesterday's mobile ad experience and introducing the world to our machine-learning algorithms and elegant design.\nHeyzap’s acquisition will join its platform with mobile advertising service Fyber, which RNTS Media picked up in 2014.\nHeyzap, a provider of mobile advertising for app developers, has been acquired by RNTS Media in a move intended to beef up its own offering in the space.\nAccording to a statement from RNTS Media, Heyzap is expected to reach $20 million in revenue in 2016 and has been a profitable company since the latter half of this year.\nThe grab by RNTS Media is an effort to capitalize on mobile advertising mediation, a way by which developers can display ads from multiple networks in a transparent way."], "team": "Webmaster"}, {"date": ["http://www.theguardian.com/artanddesign/jonathanjonesblog/2015/dec/23/the-strange-tale-of-snowflake-man-wilson-bentley"], "header": "The strange tale of the Snowflake Man", "team": "Webmaster", "author": "http://www.theguardian.com/artanddesign/jonathanjonesblog/2015/dec/23/the-strange-tale-of-snowflake-man-wilson-bentley", "paragraphs": ["Photograph: GraphicaArtis/CorbisHe is remembered as Snowflake Bentley or The Snowflake Man.\nAnd Snowflake Bentley taught us to see them.\nFacebook Twitter Pinterest Bentley’s Study of a Snowflake, circa 1890-1903, was from the first series of snowflakes ever captured under a microsope.\nFacebook Twitter Pinterest Bentley took more than 5,000 photos of snowflakes, some of which are in the Smithsonian’s collection.\nFacebook Twitter Pinterest Bentley in the field in 1906."]}, {"date": ["http://www.adelaidenow.com.au/news/south-australia/sa-court-orders-google-pay-dr-janice-duffy-115000-damages-for-defamatory-search-engine-results/news-story/6713798257490c7c36c15e393880ea44"], "header": "SA court orders Google pay Dr Janice Duffy $115,000 damages for defamatory search engine results", "paragraphs": ["MORE than six years ago, Dr Janice Duffy asked the world’s biggest internet search engine, Google, for its help.\nOutside court, Dr Duffy said the damages were not, and had never been, her goal.\nDr Janice Duffy outside the Supreme Court.\nOn Wednesday, Justice Blue awarded Dr Duffy damages of $100,000 and a $15,000 lump sum to cover interest.\nJustice Malcolm Blue found the search results either published, republished or directed users toward comments harmful to her reputation."], "author": "http://www.adelaidenow.com.au/news/south-australia/sa-court-orders-google-pay-dr-janice-duffy-115000-damages-for-defamatory-search-engine-results/news-story/6713798257490c7c36c15e393880ea44", "team": "Webmaster"}, {"date": ["http://wonderingminstrels.blogspot.com/2004/01/telnet-song-guy-l-steele-jr.html"], "header": "The Wondering Minstrels: Telnet Song -- Guy L Steele, Jr", "team": "Webmaster", "paragraphs": ["Anything he types gets executed by machine C. Now supposing he wants to send a keystroke to machine B instead?\nTo send the X to machine A, we need to send a ^|X to machine B.\nNope - because the ^|^| sends a ^| to machine B, and then the X goes to *machine C*, the machine at the top of the stack.\nHe knew he could quit whenever he wanted to: all he had to do was type control up-arrow Q.\nControl up-arrow is the escape; it's doubled to send it through, and \"quit\" is control up-arrow Q."], "author": "http://wonderingminstrels.blogspot.com/2004/01/telnet-song-guy-l-steele-jr.html"}, {"date": ["http://urbankchoze.blogspot.com/2014/04/euclidian-zoning.html"], "header": "Euclidian zoning", "author": "http://urbankchoze.blogspot.com/2014/04/euclidian-zoning.html", "paragraphs": ["It's actually an English translation of my French-language blog \"kchoze urbaine\".\n\"Chose urbaine\" in French means literally \"urban thing\".\nJust a blog about urban and transport issues.\n) from Québec, I have no urbanist formation, this is only my musings and my opinions.\nWhy \"kchoze\" instead of \"chose\"?"], "team": "Webmaster"}, {"date": ["http://jeremykun.com/2014/07/07/when-greedy-algorithms-are-good-enough-submodularity-and-the-1-1e-approximation/"], "header": "When Greedy Algorithms are Good Enough: Submodularity and the (1 – 1/e)-Approximation", "team": "Webmaster", "author": "http://jeremykun.com/2014/07/07/when-greedy-algorithms-are-good-enough-submodularity-and-the-1-1e-approximation/", "paragraphs": ["The first is that if you do both this augmented greedy algorithm and the greedy algorithm that ignores costs, then at least one of these can’t do too poorly.\nExtensions and VariationsThis result on monotone submodular functions is just one part of a vast literature on finding approximation algorithms for submodular functions in various settings.\nConversely, if we have the condition from the definition, then using the fact that we can inductively apply the inequality to each element of to getNext, we can tweak and combine submodular functions to get more submodular functions.\nBut note that allowing the greedy algorithm to run longer can give much stronger guarantees, though it requires you to sacrifice the cardinality constraint.\nWhat we did in this post was maximize a monotone submodular function subject to a cardinality constraint ."]}, {"date": ["http://www.slashgear.com/google-buys-fiber-internet-system-in-utah-for-one-dollar-19278593/"], "header": "Google buys fiber internet system in Utah for one dollar", "paragraphs": ["Google buys fiber internet system in Utah for one dollarIt's not secret that Google's Fiber Internet program is growing by leaps and bounds - and here in Provo, Utah, it's being initiated in a deal that's costing Google only $1 USD at the outset.\nJust this past month AT&T Fiber Internet was announced for Austin, Texas as well.\nThis will be just the newest in a line of Google Fiber systems being set up, Kansas City, Missouri and Austin, Texas already coming up quick.\nWith Google onboard, they'll be grabbing internet service at no additional fee just so long as they pay a much more reasonable $30 hook-up charge.\nThis deal is being made by Google to purchase the city's municipal fiber-optic system that originally cost around $39 million to build."], "author": "http://www.slashgear.com/google-buys-fiber-internet-system-in-utah-for-one-dollar-19278593/", "team": "Webmaster"}, {"date": ["https://codewords.recurse.com/issues/five/why-do-neural-networks-think-a-panda-is-a-vulture"], "header": "How to trick a neural network into thinking a panda is a vulture", "team": "Webmaster", "paragraphs": ["We’re going to learn a little about neural networks, and then I’ll teach you how to trick a neural network into thinking a panda is a vulture.\nHow it works: neural networksI’m going to be totally honest here: I’m not a neural networks expert, and my neural networks explanations are not going to be great.\n( x 1 , x 2 , x 3 , x 4 , x 5 ) (x_1, x_2, x_3, x_4, x_5) (x​1​​,x​2​​,x​3​​,x​4​​,x​5​​), between 0 and 255.\nI installed Caffe, which is neural network software written by some people at the Berkeley Vision and Learning Center at Berkeley.\nMaking our first predictionWe’re going to load a neural network, make some predictions, and then break those predictions."], "author": "https://codewords.recurse.com/issues/five/why-do-neural-networks-think-a-panda-is-a-vulture"}, {"date": ["http://www.bostonglobe.com/business/2015/12/23/from-boston-penthouse-world-best-fantasy-player-plunges-into-startup-world/QHNpLh0O3QMyUDqTd4t27N/story.html"], "header": "From a Boston penthouse, world’s best fantasy player plunges into startup world", "author": "http://www.bostonglobe.com/business/2015/12/23/from-boston-penthouse-world-best-fantasy-player-plunges-into-startup-world/QHNpLh0O3QMyUDqTd4t27N/story.html", "paragraphs": ["The 27-year-old Sud is a professional fantasy sports player — in fact, he’s considered the best in the world.\nHis company, RotoQL , is the latest entry in a field of startups founded by professional fantasy players.\nSoftware tools have been controversial, with some fantasy players questioning whether they give high-powered players an unfair edge.\nSuzanne Kreiter/Globe Staff Saahil Sud is considered the best player of fantasy sports in the world.\nHe recently moved into the penthouse apartment that was once the home of former Boston Celtics star Rajon Rondo."], "team": "Webmaster"}, {"date": ["http://www.wsj.com/article_email/amazon-seeks-to-ease-ties-with-ups-1450835575-lMyQjAxMTA1MDI3MzcyOTMzWj"], "header": "Amazon Seeks to Ease Ties With UPS", "team": "Webmaster", "author": "http://www.wsj.com/article_email/amazon-seeks-to-ease-ties-with-ups-1450835575-lMyQjAxMTA1MDI3MzcyOTMzWj", "paragraphs": ["This year, its Amazon account exceeds $1 billion, say former Amazon and UPS executives.\nThe goal is to reduce its reliance on carriers like UPS, according to people familiar with the matter.\nA few years ago, UPS shared some of its routing data with Amazon, according to an executive.\nThe company agreed, although some UPS executives questioned whether to assume the low-margin business.\nBut the symbiotic relationship between the two giants has come under increasing strain, according to interviews with more than a dozen current and former UPS and Amazon executives."]}, {"date": ["https://peadarcoyle.wordpress.com/2015/12/23/three-things-i-wish-i-knew-earlier-about-machine-learning/"], "header": "Three things I wish I knew earlier about Machine Learning", "paragraphs": ["In the new year I’ll probably try to write out a blog post only on feature extraction and feature selection.\nI struggle to find a direct competitor on the market right now, and I really think they’ve nailed a fascinating problem.\nI’ve been working with Machine Learning models both in academic and industrial settings for a few years now.\nAnd I wish I knew that a lot earlier :)My friend Ian has some great remarks on ‘Data Science Delivered’ which is a great read for any professional (junior or senior) who build machine learning models for a living.\nI think we need a lot more commentary about these ‘dirty’ aspects of machine learning."], "author": "https://peadarcoyle.wordpress.com/2015/12/23/three-things-i-wish-i-knew-earlier-about-machine-learning/", "team": "Webmaster"}, {"date": ["http://pmarchive.com/how_to_hire_the_best_people.html"], "header": "How to hire the best people you've ever worked with", "team": "Webmaster", "paragraphs": ["How to hire the best people you've ever worked withThere are many aspects to hiring great people, and various people smarter than me have written extensively on the topic.\n(I don't know if the new, MBA-heavy Microsoft still does this, but I do know this is how Microsoft in its heyday worked.\nBut I am going to relay some lessons learned through hard experience on how to hire the best people you've ever worked with -- particularly for a startup.\nOne way to test for an aspect of ethics -- honesty -- is to test for how someone reacts when they don't know something.\nPick a topic you know intimately and ask the candidate increasingly esoteric questions until they don't know the answer."], "author": "http://pmarchive.com/how_to_hire_the_best_people.html"}, {"date": ["http://www.theguardian.com/books/2015/dec/23/japanese-bookshop-stocks-only-one-book-at-a-time"], "header": "Japanese bookshop stocks only one book at a time", "author": "http://www.theguardian.com/books/2015/dec/23/japanese-bookshop-stocks-only-one-book-at-a-time", "paragraphs": ["“This bookstore that sells only one book could also be described as ‘a bookstore that organises an exhibition derived from a single book’.\nDuring such events, a lot of people visited the store for the sake of a single book.\nFor instance, when selling a book on flowers, in the store could be exhibited a flower that actually appears in the book.\nThere, I had around 200 books as stock, and used to organise several book launches per year.\nThe owner of one small bookshop in Tokyo has taken an unusual approach to the problem: Morioka Shoten, located in the luxury shopping district of Ginza, offers just one title to its customers."], "team": "Webmaster"}, {"date": ["https://www.quantamagazine.org/20151221-hope-rekindled-for-abc-proof/"], "header": "Hope Rekindled for ABC Proof", "team": "Webmaster", "author": "https://www.quantamagazine.org/20151221-hope-rekindled-for-abc-proof/", "paragraphs": ["For instance, a proof of the abc conjecture would improve on a landmark result in number theory.\nBefore Mochizuki began working on IUT theory, he spent a long time developing a different type of mathematics in pursuit of an abc proof.\nWhat they did hope to achieve was a sense of the strength of Mochizuki’s work.\nHe called the work “inter-universal Teichmüller theory” (IUT theory) and explained that the papers contained a proof of the abc conjecture, one of the most spectacular unsolved problems in number theory.\nFew entered the week expecting to leave with a complete understanding of Mochizuki’s work or a clear verdict on the proof."]}, {"date": ["http://calculist.org/blog/2015/12/23/neon-node-rust/"], "header": "Node + Rust = 💖", "paragraphs": [""], "author": "http://calculist.org/blog/2015/12/23/neon-node-rust/", "team": "Webmaster"}, {"date": ["http://www.codingdefined.com/2015/12/understanding-global-assembly-cache-gac.html"], "header": "Understanding Global Assembly Cache (GAC)", "team": "Webmaster", "paragraphs": ["In this post we will show you how to create a text-to-speech module in Node.js using Edge.js.\nText to Speech application actually means t..."], "author": "http://www.codingdefined.com/2015/12/understanding-global-assembly-cache-gac.html"}, {"date": ["http://www.nbcnews.com/tech/innovation/big-easy-button-app-fights-crime-new-orleans-n456536"], "header": "Big Easy Button: App Fights Crime in New Orleans", "author": "http://www.nbcnews.com/tech/innovation/big-easy-button-app-fights-crime-new-orleans-n456536", "paragraphs": ["An off-duty NOPD officer working on the French Quarter Task Force patrols the French Quarter in New Orleans on May 6, 2015.\nA year ago, New Orleans' storied French Quarter was facing two big problems: a shortage of police and a spike in crime.\n\"The French Quarter Task Force app.\n\"The citizens of the French Quarter or anywhere else, tourists, anyone coming to visit can download the app on their phone.\nBRETT DUKE / The Times-Picayune / Landov\"We're the beat cop of the 21st century,\" said Bob Simms, who has been running the day-to-day operation of the \"French Quarter Task Force\" since it launched in March."], "team": "Webmaster"}, {"date": ["http://motherboard.vice.com/read/heres-what-the-hell-happened-in-bitcoin-in-2015"], "header": "Here's What the Hell Happened In Bitcoin In 2015", "team": "Webmaster", "author": "http://motherboard.vice.com/read/heres-what-the-hell-happened-in-bitcoin-in-2015", "paragraphs": ["***And this concludes your recap of Bitcoin, season seven.\nAnd yes, there could still be more crooked cops on the Silk Road case.\nBitcoin season seven—on the web since 2008!—is drawing to a close, and it’s clear that the writers have started to run out of ideas.\nIntroducing... Satoshi Nakamoto!\nIn New York State, much-maligned BitLicense legislation began forcing Bitcoin businesses to get a license to operate in September of 2015."]}, {"date": ["http://motherboard.vice.com/read/here-are-the-apps-we-actually-used-this-year"], "header": "Here Are the Apps We Actually Used This Year", "paragraphs": ["Rather than put together a roundup of best apps, or new apps, or apps in a hyper-specific category, we figured, why not just round up the apps we actually use?\nAs everyone else said, Pocket is great, Pocket Casts is great, Spotify is great, and, frankly, iMessage is great.\nYou probably have a lot of apps, but how many of those do you actually use?\nA friend turned us onto an app called Splitwise, and it’s easily the best cost-splitting app that I’ve ever used.\nIn that spirit, here are the apps that some of Motherboard’s staff found most useful or used the most in 2015 (obvious contenders, like Twitter or Facebook aside)."], "author": "http://motherboard.vice.com/read/here-are-the-apps-we-actually-used-this-year", "team": "Webmaster"}, {"date": ["http://motherboard.vice.com/read/why-jon-stewarts-family-decided-to-open-an-animal-sanctuary"], "header": "Why Jon Stewart’s Family Decided to Open an Animal Sanctuary", "team": "Webmaster", "paragraphs": ["“Honestly I feel like this is what I’ve been working towards since the day I was born,” Tracey told me via Skype.\nShe “reluctantly” became vegetarian after reading a book by Farm Sanctuary founder Gene Baur, which had been left on the table of a beach house the family once rented.\nImage: Jo-Anne McArthur/Farm SanctuaryThose animals find their way to Farm Sanctuary through a number of conduits—some more cloak-and-dagger than others.\nBut over the course of the next year, he and his family will be taking on some new responsibilities: raising rescued farm animals on their 12-acre property in Middletown, New Jersey.\nThough the whole family are animal lovers, Tracey in particular has a passion for animals."], "author": "http://motherboard.vice.com/read/why-jon-stewarts-family-decided-to-open-an-animal-sanctuary"}, {"date": ["https://www.techinasia.com/talk/quick-tips-build-userfriendly-apps-2016"], "header": "Connecting Asia's startup ecosystem", "author": "https://www.techinasia.com/talk/quick-tips-build-userfriendly-apps-2016", "paragraphs": [""], "team": "Webmaster"}, {"date": ["http://startupljackson.com/post/135800367395/how-to-get-rich-in-tech-guaranteed"], "header": "Startups and Shit, How to get rich in tech, guaranteed.", "team": "Webmaster", "author": "http://startupljackson.com/post/135800367395/how-to-get-rich-in-tech-guaranteed", "paragraphs": ["Employees who like that, might also like Hunter’s article from last week on (not) getting rich at startups.\nOne question I get asked over and over again in various forms is, do you think I’ll get rich from startup X?\nHow to get rich in tech, guaranteed.\nIf you want to get rich, your best bet on a risk-adjusted basis is to join a profitable and growing public company.\nLook at 200 startups, contact 50, do first interviews with 20, move forward with 5, pick between 2-3 good options."]}, {"date": ["http://osherove.com/blog/2015/12/21/music-production-vs-code-production.html"], "header": "Music Production vs. Code Production", "paragraphs": ["TDD in .NET Online CourseTDD and BDD in Ruby Online CourseFollow @RoyOsheroveSubscribe!\nThis site aims to connect all the dots of my online activities - from tools, books blogs and twitter accounts, to upcoming conferences, engagements and user group talks."], "author": "http://osherove.com/blog/2015/12/21/music-production-vs-code-production.html", "team": "Webmaster"}, {"date": ["http://www.jpctechnologies.net/blog-detail/import-contacts-from-google-using-php"], "header": "How to import contacts from google using php", "team": "Webmaster", "paragraphs": ["Import Contacts from Google using PHPPosted on 16-Jun-2015Inviting friends over a website or webapp is a key factor to get in more traffic and users.\nIn this tutorial we will explain you the process of getting the contact list using google APIs for the signed is user along with a PHP script to extract the list in a variable.\nGet API Keys from googleLogin to your google account Visit https://code.google.com/apis/console/ Under APIS and Auth click on APIs to see the list of API on left, Enable \"Contacts API\" from that list.\n6.If All goes well API credentials will be created , copy them in safe location for use in PHP code.\nPlease follow below steps and in case of any difficulties please feel free to report an issue in github."], "author": "http://www.jpctechnologies.net/blog-detail/import-contacts-from-google-using-php"}, {"date": ["http://www.wired.com/2015/12/the-cia-secret-to-cybersecurity-that-no-one-seems-to-get/"], "header": "The CIA Secret to Cybersecurity That No One Seems to Get", "author": "http://www.wired.com/2015/12/the-cia-secret-to-cybersecurity-that-no-one-seems-to-get/", "paragraphs": ["If you want to keep yourself up at night, spend some time reading about the latest developments in cybersecurity.\nThe CIA TriadThe information security community has a model to assess and respond to threats, at least as a starting point.\nData integrity schemes based on Merkle hash trees, scalable provable data possession (SPDP), and dynamic provable data possession (DPDP), among others, enable protection of data in untrusted stores from intentional and malicious modification.\nIt breaks information security into three essential components: confidentiality, integrity, and availability.\nWIRED Opinion About Mike Gault is the founder and CEO of Guardtime, a blockchain technology platform that authenticates networks and data at industrial scale."], "team": "Webmaster"}, {"date": ["http://mentalfloss.com/uk/technology/32106/the-true-purpose-of-solitaire-minesweeper-hearts-and-freecell"], "header": "The True Purpose of Microsoft Solitaire, Minesweeper, and FreeCell", "team": "Webmaster", "author": "http://mentalfloss.com/uk/technology/32106/the-true-purpose-of-solitaire-minesweeper-hearts-and-freecell", "paragraphs": ["These simple Windows games have probably caused more lost worker hours than anything short of a worldwide coffee shortage.\nThe oldest of the four, Microsoft Solitaire, was first added to Windows 3.0 in 1990.\nLike us on FacebookIf you haven't ever played Solitaire, Minesweeper, Hearts or FreeCell, it's safe to say you're in the minority.\nEventually, in 2012, Microsoft released a version, Windows 8, without any of the games.\nUsers could download the Solitaire Collection and Minesweeper separately, but you had to pay extra to play without ads."]}, {"date": ["http://www.murthy.com/2015/06/25/uscis-returning-h1b-cap-petitions-not-selected-in-lottery/"], "header": "USCIS Returning H1B Cap Petitions Not Selected in Lottery « Murthy Law Firm", "paragraphs": ["USCIS Returning H1B Cap Petitions Not Selected in LotteryOn June 12, 2015, the Murthy Law Firm received the first few packages containing H1B filings returned as not having been selected in the fiscal year 2016 (FY16) random H1B lottery.\nReturned H1B PackagesAs mentioned, the first returned packages to the Murthy Law Firm arrived in the mail on June 12th.\n\"Please note that the rejection of an H1B package occurs when the USCIS mailroom returns the H1B package without reviewing the merits of the case.\nCopyright © 2015, MURTHY LAW FIRM.\nAlmost a month has elapsed since the firm last received any new H1B receipt notices for cases selected in the lottery."], "author": "http://www.murthy.com/2015/06/25/uscis-returning-h1b-cap-petitions-not-selected-in-lottery/", "team": "Webmaster"}, {"date": ["http://brainfreez3.blogspot.com/2015/12/the-svnit-job-fest-2016.html"], "header": "The SVNIT Job Fest 2016", "team": "Webmaster", "paragraphs": [""], "author": "http://brainfreez3.blogspot.com/2015/12/the-svnit-job-fest-2016.html"}, {"date": ["http://www.theguardian.com/media-network/media-network-blog/2014/dec/18/future-advertising-digital-media-technology"], "header": "Welcome to the future of advertising, where digital is redundant", "author": "http://www.theguardian.com/media-network/media-network-blog/2014/dec/18/future-advertising-digital-media-technology", "paragraphs": [""], "team": "Webmaster"}, {"date": ["http://arstechnica.com/tech-policy/2015/12/australian-government-tells-citizens-to-turn-off-two-factor-authentication/"], "header": "Australian government tells citizens to turn off two-factor authentication", "team": "Webmaster", "author": "http://arstechnica.com/tech-policy/2015/12/australian-government-tells-citizens-to-turn-off-two-factor-authentication/", "paragraphs": ["The Australian government has repeatedly called for citizens to turn off two-factor authentication (2FA) at its main digital government portal, myGov.\nEven if it did though, a few additional passwords aren't a true replacement for good ol' two-factor authentication.\n\"The portal is the place where Australian citizens can use and manage a number of governmental services, including health insurance, tax payments, and child support.\nIn case of myGov, two-factor authentication is implemented by sending users text messages that contain one-time codes to complement their usual passwords.\nOnce this is done, they won't be able to receive myGov security codes without reinstalling their Australian SIMs, which is a hassle."]}, {"date": ["http://www.smithsonianmag.com/arts-culture/why-japan-is-obsessed-with-kentucky-fried-chicken-on-christmas-1-161666960/?no-ist"], "header": "Why Japan is Obsessed with Kentucky Fried Chicken on Christmas", "paragraphs": ["Fried chicken and Christmas have become synonymous: KFC’s advertisements feature major pop cultural figures chomping on drumsticks, the company website even has a countdown until Christmas.\nToday the christmas chicken dinner (which now boasts cake and champagne) goes for about 3,336 yen ($40).\nKeeping the tradition alive, they will trek with their families to feast at … the popular American fast food chain KFC.\nWhen a group of foreigners couldn’t find turkey on Christmas day and opted for fried chicken instead, the company saw this as a prime commercial opportunity and launched its first Christmas meal that year: Chicken and wine for 834 2,920 yen($10)—pretty pricey for the mid-seventies.\nThe first KFC Japan opened in Nagoya in 1970 and quickly gained popularity."], "author": "http://www.smithsonianmag.com/arts-culture/why-japan-is-obsessed-with-kentucky-fried-chicken-on-christmas-1-161666960/?no-ist", "team": "Webmaster"}, {"date": ["http://www.awaken.com/2015/03/95-year-old-smashes-200m-world-record-bodies-can-be-rebuilt-at-any-age/"], "header": "95-Year-old Smashes 200m World Record: ‘Bodies Can Be Rebuilt At Any Age’", "team": "Webmaster", "paragraphs": [")Eugster’s intense weight training has shown him that bodies can be rebuilt at any age — even in your 90s.\n“I want to make old age something wonderful, stupendous, glorious… interesting, exciting… the best part of one’s life.”He started sprinting in his 90s and enjoys it because it is new and different.\n“Work is the most important thing for a healthy old age; number one is work, number two is nutrition and number three is exercise, in that order.” (His role model for a working senior?\n“I want to change the world,” he told Sportvibe.tv.\nHis latest record-breaking performance came at a British Masters Athletics meet on Sunday when he ran the 200m race in 55.48 seconds."], "author": "http://www.awaken.com/2015/03/95-year-old-smashes-200m-world-record-bodies-can-be-rebuilt-at-any-age/"}, {"date": ["http://www.telegraph.co.uk/finance/economics/11999966/Switzerland-to-vote-on-banning-banks-from-creating-money.html"], "header": "Switzerland to vote on banning banks from creating money", "author": "http://www.telegraph.co.uk/finance/economics/11999966/Switzerland-to-vote-on-banning-banks-from-creating-money.html", "paragraphs": ["\"Due to the emergence of electronic payment transactions, banks have regained the opportunity to create their own money,\" said the Swiss Sovereign Money campaign.\nSwitzerland will hold a referendum to decide whether to ban commercial banks from creating money.\nBut over 90pc of money in circulation in Switzerland now exists in the form \"electronic\" cash created by private banks, rather than the central bank.\nThe campaign - led by the Swiss Sovereign Money movement and known as the Vollgeld initiative - is designed to limit financial speculation by requiring private banks to hold 100pc reserves against their deposits.\nCentral banks aim to influence the money supply with monetary policy and regulatory tools."], "team": "Webmaster"}, {"date": ["http://techcrunch.com/2015/12/23/slack-and-hipchat-are-on-the-verge-of-launching-chat-wars/"], "header": "Slack And HipChat Are On The Verge Of Launching Chat Wars", "team": "Webmaster", "author": "http://techcrunch.com/2015/12/23/slack-and-hipchat-are-on-the-verge-of-launching-chat-wars/", "paragraphs": [") While it’s still far too early to declare a winner, the battle to be the monopoly in enterprise messaging has clearly begun.\n\"It’s not a finite pie that Slack and HipChat are going to carve up,\" Goldsmith said.\nBut there’s little spill over between different companies, so these platforms’ network effects are still highly localized.\nBecause they’re run within self-contained platforms – not open protocols like email – both Slack and HipChat have the potential for strong network effects.\nWhile there may be room for many siloed messaging platforms, there’s typically room for only one, or at most two, top development platforms in any market."]}, {"date": ["https://www.ruby-lang.org/en/news/2015/12/25/ruby-2-3-0-released/"], "header": "Ruby 2.3.0 Released", "paragraphs": ["Posted by naruse on 25 Dec 2015We are pleased to announce the release of Ruby 2.3.0.\nRuby 2.3 introduces a new magic comment and command line option to freeze all string literals in the source files.\nThis is the first stable release of Ruby 2.3 series.\nWith Ruby 2.1, \"str\".freeze has been optimized to reduce object allocation.\nWith those changes, 2946 files changed, 104057 insertions(+), 59478 deletions(-) since Ruby 2.2.0!"], "author": "https://www.ruby-lang.org/en/news/2015/12/25/ruby-2-3-0-released/", "team": "Webmaster"}, {"date": ["https://medium.com/@venkvis/a-massive-online-thermodynamic-experiment-f37c35ec6a34#.tyjs4xsit"], "header": "A massive online thermodynamic experiment — Medium", "team": "Webmaster", "paragraphs": ["A massive online thermodynamic experimentI am going to embark on an interesting adventure running a massive online open course (MOOC) on thermodynamics.\nIn addition, all the associated questions an academic has about online education: Where is this online learning going?\nFunds: This was going to be challenging since a traditional massive online open course (MOOC) had not been done before at Carnegie Mellon.\nI was allowed to teach graduate thermodynamics and I felt like this would be a great class to flip and turn into an online course.\nThis planted the first seeds in my head about online learning; but I was still a PhD student at this point."], "author": "https://medium.com/@venkvis/a-massive-online-thermodynamic-experiment-f37c35ec6a34#.tyjs4xsit"}, {"date": ["http://motherboard.vice.com/read/this-piracy-group-promises-to-leak-40-of-hollywoods-top-movies-in-a-row"], "header": "This Piracy Group Promises to Leak 40 of Hollywood’s Top Movies in a Row", "author": "http://motherboard.vice.com/read/this-piracy-group-promises-to-leak-40-of-hollywoods-top-movies-in-a-row", "paragraphs": ["Image: Columbia PicturesA movie piracy release group called Hive-CM8 says it’s planning to leak no fewer than 40 top Hollywood movies over the next few weeks.\n) The leaked movies are all high-quality DVD screeners, which are copies of a film sent to people like journalists and other movie industry professionals for evaluation purposes.\n(Usenet, which predates the web, is kind of like a giant message board, but with the ability to easily and quickly share large files.\nThe release group Hive-CM8, whose slogan appears to be “doing it right the first time,” has been around for at least five years, with versions of films like The Social Network, The Hobbit, 12 Years a Slave, and Interstellar all having been leaked by the group.\nSeveral of the highest-profile films of the year, including recent releases like Will Smith drama Concussion, Creed, Joy, and Steve Jobs, are among the films already available to download on various piracy sites."], "team": "Webmaster"}, {"date": ["https://blog.heroku.com/archives/2015/12/25/ruby-2-3-0-on-heroku-with-matz"], "header": "Ruby 2.3 on Heroku with Matz", "team": "Webmaster", "author": "https://blog.heroku.com/archives/2015/12/25/ruby-2-3-0-on-heroku-with-matz", "paragraphs": ["We had the pleasure of speaking with Matz (Yukihiro Matsumoto), the creator of Ruby and Chief Ruby Architect at Heroku, about the release.\nCongratulations to the ruby-core team on a successful 2.3.0 release, which is now available on Heroku -- you can learn more about Ruby on Heroku at heroku.com/ruby.\nI expect every Ruby 2.x program to run without any modification in the future version of Ruby.\nInstead of using nil , they use optional types.\nIn Ruby 3, if we do have to make an incompatible change, we have to provide a reasonable reason."]}, {"date": ["http://www.midwesternmac.com/blogs/jeff-geerling/benchmarking-drupal-8-php-7-vs-hhvm"], "header": "Benchmarking PHP 7 vs HHVM - Drupal and Wordpress", "paragraphs": ["Both PHP 7 and HHVM blow PHPSkip to benchmark results:Introduction and MethodologyAs PHP 7 became a reality through this past year, there were scores of benchmarks pitting PHP 7 against 5.6 and HHVM using applications and frameworks like Drupal, Wordpress, Joomla, Laravel, October, etc.\n[Multiple updates: I've added results for concurrencies of 1 and 10, results on bare metal vs. VMware instances, tested Drupal 8 vs Drupal 7 vs Wordpress 4.4, and I've also retested every single benchmark at least twice!\nIt's interesting to see that PHP 7 and HHVM are practically neck-and neck for front-facing portions of Wordpress (and FAR faster than 5.6), while HHVM runs even a little faster than PHP 7 for administrative tasks.\nSummarytl;dr: For Drupal 7 and Drupal 8 at least, PHP 7 takes the performance crown—by a wide margin.\nPHP 7 is actually faster than HHVM in many cases, neck-in-neck in others, and slightly slower in others."], "author": "http://www.midwesternmac.com/blogs/jeff-geerling/benchmarking-drupal-8-php-7-vs-hhvm", "team": "Webmaster"}, {"date": ["http://slatestarcodex.com/2015/12/24/how-bad-are-things/"], "header": "How Bad Are Things?", "team": "Webmaster", "paragraphs": ["But people have a bad tendency to follow it up with “And so now most people have it pretty good”.\nHow should they know how many people have it pretty good or not?\nIt doesn’t count things that I couldn’t find good statistics on, like “had a child die recently”.\nIt doesn’t count things that I would have gotten in trouble for including, like “autistic” or “single mother”.\nI don’t think we have any idea how many people do or don’t have it pretty good."], "author": "http://slatestarcodex.com/2015/12/24/how-bad-are-things/"}, {"date": ["http://www.androidpolice.com/2015/12/23/the-beatles-coming-to-all-streaming-services-including-google-play-on-december-24th/"], "header": "The Beatles Coming To Streaming Services (Including Google Play) On December 24th", "author": "http://www.androidpolice.com/2015/12/23/the-beatles-coming-to-all-streaming-services-including-google-play-on-december-24th/", "paragraphs": ["The Beatles will be available everywhere in streaming form on December 24th at 12:01AM, including Google Play Music.\nThe selection will be the same on services like Slacker, Microsoft Groove (formerly Xbox Music... formerly Zune Music), and more.\nIf you say, \"Ok Google, play the Beatles,” the phone will reply with some variation of \"Let it stream.\nFor years, you couldn't even get The Beatles music in digital format, then Apple struck a deal to sell it all exclusively.\nGoogle is also building at least one easter egg into Play Music to celebrate the launch."], "team": "Webmaster"}, {"date": ["http://www.cbsnews.com/news/south-korean-mock-funerals-seek-to-ease-lifes-stresses/"], "header": "South Korean \"mock funerals\" seek to ease life's stresses", "team": "Webmaster", "author": "http://www.cbsnews.com/news/south-korean-mock-funerals-seek-to-ease-lifes-stresses/", "paragraphs": ["Many who join the mock funerals seek relief from the stresses of modern life in South Korea, whose suicide rate tops the developed world.\nA handful of companies conduct the mock funerals, and the rivalry is getting ugly.\nBut not all is peaceful and contemplative in the mock funeral business.\n\"The mock funerals are part of a \"well-dying\" trend in South Korea, a sign that the country, once one of the world's poorest after the devastating 1950-53 Korean War, has grown affluent enough to consider quality-of-life issues.\n\"There should be morality in business,\" said Kim Giho, the head of Beautiful Life, who plans to sue Hyowon."]}, {"date": ["http://venturebeat.com/2015/12/23/leaked-mozilla-document-shows-firefox-os-tablet-tv-stick-router-and-even-a-keyboard-computer/"], "header": "Leaked Mozilla document shows Firefox OS tablet, TV stick, router, and even a keyboard computer", "paragraphs": ["Leaked by Spanish blog Hipertextual, the document shows four Firefox OS devices: a tablet, a router, a smart TV stick, and a keyboard computer.\nKeep in mind that Firefox OS tablets already exist.\nEarlier this month, Mozilla announced that Firefox OS smartphones would no longer be sold via carriers.\nFirefox OS smart TVs are also available.\nMozilla emphasized repeatedly that it isn’t yet ready to discuss the future of Firefox OS."], "author": "http://venturebeat.com/2015/12/23/leaked-mozilla-document-shows-firefox-os-tablet-tv-stick-router-and-even-a-keyboard-computer/", "team": "Webmaster"}, {"date": ["http://motherboard.vice.com/read/best-buy-turned-the-10-toy-into-a-120-wifi-enabled-piece-of-crap"], "header": "Best Buy Turned the $10 Toy Into a $120 Wifi-Enabled Piece of Crap", "team": "Webmaster", "paragraphs": ["Surely, surely, no child is playing with a Sphero 2.0 for more than a couple hours.\nBut we’re so obsessed with the physicality of stuff as gifts that wholly unnecessary stores like Best Buy can survive off the aunts and uncles of the world who won’t give up on wrapping paper.\nA real product you can now purchase at Best Buy is the “Sphero 2.0,” a $129.99 “smartphone-enabled ball” that rolls around on the table via taps on your iPad.\nPerhaps age 27 is too young to become a back-in-my-day old man blogger, but I cannot stand idly by as Best Buy has begun selling almost exclusively overpriced smartphone-enabled garbage targeted at guilty parents and relatives who don’t know any better.\nSimply put: In a time where streaming video games, movies, and songs have replaced its core business, Best Buy is only still in business because people are obsessed with giving physical stuff, regardless of the usefulness or value of that stuff."], "author": "http://motherboard.vice.com/read/best-buy-turned-the-10-toy-into-a-120-wifi-enabled-piece-of-crap"}, {"date": ["http://motherboard.vice.com/en_ca/read/this-piracy-group-promises-to-leak-40-of-hollywoods-top-movies-in-a-row"], "header": "This Piracy Group Promises to Leak 40 of Hollywood’s Top Movies in a Row", "author": "http://motherboard.vice.com/en_ca/read/this-piracy-group-promises-to-leak-40-of-hollywoods-top-movies-in-a-row", "paragraphs": ["Image: Columbia PicturesA movie piracy release group called Hive-CM8 says it’s planning to leak no fewer than 40 top Hollywood movies over the next few weeks.\n) The leaked movies are all high-quality DVD screeners, which are copies of a film sent to people like journalists and other movie industry professionals for evaluation purposes.\n(Usenet, which predates the web, is kind of like a giant message board, but with the ability to easily and quickly share large files.\nThe release group Hive-CM8, whose slogan appears to be “doing it right the first time,” has been around for at least five years, with versions of films like The Social Network, The Hobbit, 12 Years a Slave, and Interstellar all having been leaked by the group.\nSeveral of the highest-profile films of the year, including recent releases like Will Smith drama Concussion, Creed, Joy, and Steve Jobs, are among the films already available to download on various piracy sites."], "team": "Webmaster"}, {"date": ["https://medium.com/@NWChen/what-you-have-to-say-784afcc53c76#.aeryfcdvv"], "header": "What you have to say — Medium", "team": "Webmaster", "author": "https://medium.com/@NWChen/what-you-have-to-say-784afcc53c76#.aeryfcdvv", "paragraphs": ["Similarly, Chinese student Liu Di posted online content satirizing the Chinese government and called for the release of Chinese Internet dissidents.\nThe First Amendment to the United States Constitution, for example, explicitly forbids the creation of a law “abridging the freedom of speech”.\nCensorship, then, stands to revoke the human rights of life, liberty, and security of person; self-censorship stands to revoke the right to think, say, and, in turn, be human.\nSome Chinese netizens, for example, have taken to the use of the seemingly innocuous term “grass mud horse” to indicate resistance to Internet censorship.\nUnlike the Great Wall, this information blockade — the “Great Firewall” of China — is more often crossed in pursuit of escape, not invasion."]}, {"date": ["http://www.datchley.name/es6-rest-spread-defaults-and-destructuring/"], "header": "Spread, Defaults and Destructuring", "paragraphs": ["// get base logarithm of n function log(n, base) { base = base || 10; return Math.log(n) / Math.log(base); } log(1000, 10); //=> 2.9999999999999996Note: this gets us nearly 3, as IEEE 754 floating point rounding used in Javascript only gets us close.\nHere's our new log() function using default arguments and ES6 arrow function expression syntax.\nconst numbers = [1,2,3,4,5,6,7]; let [first, ...rest] = numbers; //=> first=1, rest=[2,3,4,5,6,7]And, we can use default values, much like our default argument values for functions, when destructuring as well.\nWhile this gives us the ability to set default values for function arguments, it isn't very explicit.\nDefault Function ArgumentsFunctions in javascript are extremely versatile to begin with, as they are first-class objects in the language."], "author": "http://www.datchley.name/es6-rest-spread-defaults-and-destructuring/", "team": "Webmaster"}, {"date": ["http://techspanda.com/raspberry-pi-was-offered-cash-to-pre-install-malware-on-miniature-computers/"], "header": "Raspberry Pi was offered cash to pre-install malware on miniature computers", "team": "Webmaster", "paragraphs": ["Certainly that it is not the real name as in the picture and overseen the success of Raspberry Pi have brought them into the limelight.\nOn Wednesday, the Raspberry Pi tweeted a photo of an email which offered the cash and ask the foundation to install a malware onto their computer before shipping them out.\nRead Also – > 7 Reasons to buy Raspberry Pi Zero right now‘Raspberry Pi Foundations ‘ Liz Upton has deemed them, But after reading, reading about the estimated $70 million torrent piracy sites are ranking for serving malware to free media seekers.\nWhich was kind a insane thing to ask to such a great foundation.\nThe foundation also train teachers for free and provide free educational resources."], "author": "http://techspanda.com/raspberry-pi-was-offered-cash-to-pre-install-malware-on-miniature-computers/"}, {"date": ["https://johncarlosbaez.wordpress.com/2015/12/24/good-news-part-1/"], "header": "Good News (Part 1)", "author": "https://johncarlosbaez.wordpress.com/2015/12/24/good-news-part-1/", "paragraphs": ["As we head toward the new year, I’d like to talk about some good news!\nBut you may not have heard this good news:• From 1990 and 2015, the proportion of the world’s population that is undernourished has almost halved, dropping from 19% to 11%.\n• Since 2000, worldwide cases of measles have dropped by more than two-thirds, saving more than 17 million lives—largely thanks to vaccination.\n• Worldwide , the number of children not going to primary school has fallen from 100 million in 2000 to a projected 57 million in 2015.\nSo, 6.7 million fewer children under the age of five are dying each year now than in 1990."], "team": "Webmaster"}, {"date": ["http://techspanda.com/9-chrome-extensions-to-make-your-life-easier/"], "header": "9 Chrome Extensions to Make Your Life Easier", "team": "Webmaster", "author": "http://techspanda.com/9-chrome-extensions-to-make-your-life-easier/", "paragraphs": ["9 Chrome Extensions to Make Your Life Easier1) AdBlockThis one is my favorite Chrome extension, it blocks almost all ads on a web page.\n9 Chrome Extensions to Make Your Life EasierGoogle Chrome is one of the best web browser, it is fast and clean and it integrates deeply with Google and boasts an ever-improving marketplace of lightweight softwares.\nChrome also allows you to integrates some pretty awesome and helpful extensions, some of themare here.\nAds on any web page or on YouTube video are very annoying.\nAny.Do’s Chrome extension syncs your browser with its excellent mobile apps so that you never forget to remember that thing you didn’t want to forget to remember, no matter where you’re working."]}, {"date": ["http://www.entrepreneur.com/article/253594"], "header": "Are You 'Intelligent' Enough to Be an Entrepreneur?", "paragraphs": ["I believe that good entrepreneurs use this to see new markets first, predict world trends and devise effective marketing campaigns and demographics for focus.\nIn addition to looking at intelligence, every aspiring entrepreneur needs to look at mindset.\nBusiness entrepreneurs who are also good at invention and building innovative new products are especially strong in this area.\nGood entrepreneurs need these skills to lead a team, sell ideas to customers and investors and write business plans.\nGood entrepreneurs must be able to surround themselves with advisors and partners who complement their skills to find satisfaction and happiness."], "author": "http://www.entrepreneur.com/article/253594", "team": "Webmaster"}, {"date": ["http://fortune.com/2015/12/24/saudi-prince-invests-lyft/"], "header": "Saudi's Kingdom Holding among group investing $247.7 million in Lyft", "team": "Webmaster", "paragraphs": ["Please find information on various licensing contacts below and choose the one that best suits your needs:1.\nThank you for your interest in licensing Fortune content.\nTo license a Fortune cover, order reprint or e-print copies of an article or cover, or license an accolade, please contact PARS International at www.timeincreprints.com.\nTo license Fortune articles, excerpts, or headlines for republication in various media (including books, eBooks, film, web, newsletters, newspapers, magazines and others), please email syndication@timeinc.com.\nTo license text only photocopies of Fortunearticles as print or digital handouts in academic settings, or in academic coursepacks, please contact the Copyright Clearance Center at www.copyright.com"], "author": "http://fortune.com/2015/12/24/saudi-prince-invests-lyft/"}, {"date": ["https://medium.com/@networksecurity/oleoutlook-bypass-almost-every-corporate-security-control-with-a-point-n-click-gui-37f4cbc107d0#.rxli64ped"], "header": "bypass almost every Corporate security control with a point’n’click GUI — Medium", "author": "https://medium.com/@networksecurity/oleoutlook-bypass-almost-every-corporate-security-control-with-a-point-n-click-gui-37f4cbc107d0#.rxli64ped", "paragraphs": ["Next up, Microsoft Outlook.\n#OLEOutlook - bypass almost every Corporate security control with a point’n’click GUIIn this tutorial, I will show you how to embed an executable into a corporate network via email, behind the firewall(s), disguised as a Word document.\nDeploy the registry key ShowOLEPackageObj, for your version(s) of Office, to silently disable OLE Package function in Outlook.\nBy default, Outlook won’t allow opening of executable code when received via email as an OLE Package; you simply can’t click the icon.\nYes, Microsoft Outlook from 2003 onwards also supports OLE Packages."], "team": "Webmaster"}, {"date": ["http://techspanda.com/five-must-have-apps-to-boost-sex-life/"], "header": "Five must have apps to boost your sex life", "team": "Webmaster", "author": "http://techspanda.com/five-must-have-apps-to-boost-sex-life/", "paragraphs": ["Sex 101 : Sex 101 is basically pocket collection of all the sex blogs on the net.The benefits of using Sex 101 includes sex toy reviews, original erotic stories, tips,FAQs,Personal Experience and many more.Sex 101 is more like having Sexperts in your mobile.It is more of a notes than a book.\nFive must have apps to boost your sex life !\nYou have three options: Yes, Yes (but we need to talk first), or No Thanks.\n5. iKamaSutra : The name itself is enough to know why this app is on the list.\niKamasutra is similar to Business Manager app which keeps a track of an individual’s daily track of business,to-do list,stats and other but here ,The focus is entirely on the sex education."]}, {"date": ["http://blog.zestapps.com/ab-testing-everything-you-need-to-know-and-how-to-do-it/"], "header": "B Testing: Everything you Need to Know and How to Do it", "paragraphs": ["What to A/B TestYou already know how to conduct an A/B test and when conducting one what are the things that you need to keep in mind.\nPlan your A/B TestDon’t A/B test just because you can.\nConclusionFrom all that I’ve told you from the beginning, you might have already figured out how A/B testing could be the source of life for your landing page.\nA/B Test Customer TestimonialsFinally, we’re done to the last element that you might want to test and that’s the customer testimonials or reviews about your services.\nI know how exciting it can be when you’ve just put together your landing page and how proud you feel as you look it over."], "author": "http://blog.zestapps.com/ab-testing-everything-you-need-to-know-and-how-to-do-it/", "team": "Webmaster"}, {"date": ["http://gemini.no/en/2015/12/iron-age-norwegians-liked-their-bling/"], "header": "Iron-age Norwegians liked their bling", "team": "Webmaster", "paragraphs": ["Not far from here – but outside of the bounds of the site – Ystgaard expects there are graves, too, and a harbour with boat houses.\nOne was a delicate blue glass bead and several amber beads, too, suggesting the former residents liked their bling.\nPhoto: Åge Hojem, NTNU University MuseumIron-age Norwegians liked their blingNorway’s Main Air Station at Ørland will be expanded to house the country’s new F-35 fighter jets.\nClick to openThat 1500-year-old sheltered bay and the fertile fields surrounding it turned out to be the perfect home for a settlement of Iron Age Norwegians – Norwegians who actively traded and liked their bling, if archaeological finds from the recent dig are any indication.\nClick to openIn the case of the Ørland site, the excavators are brought in to remove the layer of soil that has been recently farmed."], "author": "http://gemini.no/en/2015/12/iron-age-norwegians-liked-their-bling/"}, {"date": ["http://eev.ee/blog/2015/12/19/you-should-make-a-doom-level-part-1/"], "header": "You should make a Doom level, part 1: the basics", "author": "http://eev.ee/blog/2015/12/19/you-should-make-a-doom-level-part-1/", "paragraphs": ["SLADE has four modes, corresponding to the four major kinds of stuff in a Doom map.\nBut a lot of mappers still target the Doom format, because it’s guaranteed to run on any Doom fork.\nThe hallway is also taller than any door texture, so I lowered the door trim ceiling a bit (and made it upper unpegged).\n) So I’m going to make the cavern dark, “unlink”, and make the lava very bright:It’s not much of a Doom map without some monsters, so I’m going to add some.\nYou could use any of the games that ZDoom supports: Final Doom, Heretic, Hexen, Strife, and a couple more obscure options."], "team": "Webmaster"}, {"date": ["http://nautil.us/issue/31/stress/what-i-learned-from-losing-200-million"], "header": "What the Economic Crash of 2008 Taught Me", "team": "Webmaster", "author": "http://nautil.us/issue/31/stress/what-i-learned-from-losing-200-million", "paragraphs": ["Stress testing is a standard technique derivatives traders use to test how their portfolio will perform in an imagined “worst-case” scenario.\n“A central bank stress test can never be credible because of the incentives built in to get a pass result,” he added.\nI was a derivatives trader, but also the supervisor of the bank’s oil options trading team, about a dozen guys split between Singapore, London, and New York.\nBut it sure can make you feel confident—which is how I felt after the successes I’d had before 2008.\nWhile I was still executing the trade, I’d stress tested my strategy by imagining oil prices plummeting by 30 percent, option-implied volatilities spiking to record levels, and so on."]}, {"date": ["http://www.economist.com/news/business/21684107-cult-extreme-physical-endurance-taking-root-among-executives-here-comes-superboss"], "header": "Here comes SuperBoss", "paragraphs": ["But for all its inanity, the WEF’s tweeting does point to something real: a growing cult of extreme performance among the Davos crowd.\nToday’s code is all about effortful superiority: the successful deserve their success because they get on the treadmill and sweat.\n(“Novel-writing and art-making are easy to skip when you’ve been in meetings all day.”) They connect with their spouses.\nSports teams routinely use biometric devices to track their star athletes (and occasionally drugs to boost their performance).\nWorking around the clock is probably a sign that you are incapable of delegating, not that you are an invincible hero."], "author": "http://www.economist.com/news/business/21684107-cult-extreme-physical-endurance-taking-root-among-executives-here-comes-superboss", "team": "Webmaster"}, {"date": ["http://www.nytimes.com/interactive/2015/12/24/upshot/24up-family.html"], "header": "The Typical American Lives Only 18 Miles From Mom", "team": "Webmaster", "paragraphs": ["The Typical American Lives Only 18 Miles From MomMedian Distance From Mother 612182430+Families traveling from far-flung places, returning home for the holidays.\nGrandparents help care for grandchildren; their own children will help care for them later.\nOver all, the median distance Americans live from their mother is 18 miles, and only 20 percent live more than a couple hours’ drive from their parents.\nPerhaps it is a testament to the American family that the safety net for many of them are relatives.\nGenerational help goes the other direction, too, as grown children turn to their parents for child care for their own children."], "author": "http://www.nytimes.com/interactive/2015/12/24/upshot/24up-family.html"}, {"date": ["http://www.nytimes.com/2015/12/22/science/california-wants-to-store-water-for-farmers-but-struggles-over-how-to-do-it.html?rref=collection%2Fsectioncollection%2Fscience&amp;action=click&amp;contentCollection=science&amp;region=rank&amp;module=package&amp;version=highlights&amp;contentPlacement=5&amp;pgtype=sectionfront"], "header": "California Wants to Store Water for Farmers, but Struggles Over How to Do It", "author": "http://www.nytimes.com/2015/12/22/science/california-wants-to-store-water-for-farmers-but-struggles-over-how-to-do-it.html?rref=collection%2Fsectioncollection%2Fscience&amp;action=click&amp;contentCollection=science&amp;region=rank&amp;module=package&amp;version=highlights&amp;contentPlacement=5&amp;pgtype=sectionfront", "paragraphs": ["And if a new dam is built — at Temperance Flat, say — it could potentially help supply water for the aquifer-recharging projects.\nSnow, a former head of water resources for California and veteran of the state’s water battles.\nIn the mid-20th century, two enormous government projects — the federal Central Valley Project and the State Water Project — were built to capture those flows.\nBut no option confronting California farmers is perfect.\nIt turns out that California already has a place to store immense amounts of water, without necessarily building new dams."], "team": "Webmaster"}, {"date": ["http://lens.blogs.nytimes.com/2015/12/23/the-future-of-computational-photography/"], "header": "Photography Without a Lens? Future of Images May Lie in Data", "team": "Webmaster", "author": "http://lens.blogs.nytimes.com/2015/12/23/the-future-of-computational-photography/", "paragraphs": ["He has also published papers in collaboration with Sony’s imaging research team detailing HDR sensors for more than 10 years.\n“The hope is that if this architecture is adopted, you’ll see smaller and smaller cameras producing images with orders of magnitude higher resolution,” Mr. Nayar said.\nHDR sensors of different designs have started to be installed in major smartphones like Sony’s Xperia line, according to a Sony spokesman.\nPhoto“That’s your first example of a widespread use of computational photography in some ways,” Mr. Nayar said, referring to the adoption of HDR sensors in smartphones.\nBut with Mr. Nayar’s HDR sensor, some pixels are less reactive, some more so, and some are weighted normally."]}, {"date": ["http://www.csmonitor.com/Science/2015/1223/Inventive-crows-caught-on-camera-making-tools"], "header": "Inventive crows caught on camera making tools", "paragraphs": ["In those scenarios, the animal is not making its own tool, making the New Caledonian crows stand out as toolmakers.\n\"It just shows that you don't necessarily need a big brain to be adaptive and adept at making tools.\nBut one species is particularly technologically advanced: New Caledonian crows actually make their own hook-shaped tools, which they use for foraging.\nDespite hundreds of hours of observing New Caledonian crows in their natural habitat, scientists had only glimpsed the behavior and still had questions about how the crows did it.\nSure, the crows built tools in that artificial setting, scientists reasoned, but how skillful were the feathered engineers in the wild?"], "author": "http://www.csmonitor.com/Science/2015/1223/Inventive-crows-caught-on-camera-making-tools", "team": "Webmaster"}, {"date": ["http://motherboard.vice.com/read/the-rise-and-fall-of-boring-dystopia-the-anti-facebook-facebook-group"], "header": "The Rise and Fall of ‘Boring Dystopia,’ the Anti-Facebook Facebook Group", "team": "Webmaster", "paragraphs": ["Image: Sarah Scoffield/Boring DystopiaAt first glance, Boring Dystopia looked like a Facebook group for people who hated Facebook.\nPeople weren’t literally forced to be in factories, and this is the same.”Fittingly, the future of Boring Dystopia is very much rooted IRL: “What I’m going to do is put a book together based on Boring Dystopia.\nThe punchline to the Boring Dystopia group is that by using Facebook in the first place we are likely already too boring to appreciate it.\nUntil then we’ll have to continue without Boring Dystopia, trudging through the labour of Likes and sharing, morphing into crap robots ourselves.\nAlthough a protest group by nature, Boring Dystopia shunned hot takes and screeds, employing only images in place of language."], "author": "http://motherboard.vice.com/read/the-rise-and-fall-of-boring-dystopia-the-anti-facebook-facebook-group"}, {"date": ["https://www.linkedin.com/pulse/facebook-misleading-indians-its-full-page-ads-free-basics-murthy"], "header": "Facebook is misleading Indians with its full-page ads about Free Basics.", "author": "https://www.linkedin.com/pulse/facebook-misleading-indians-its-full-page-ads-free-basics-murthy", "paragraphs": ["Now to counter the \"10 clarifications about Facebook Free Basics\" that we 'activists' have apparently hidden from you.\nThere are many other reasons why Facebook Free Basics Digital Apartheid is bad.\nSo they've changed the name to Free Basics and have come back to try shove it down our throats again.\n\"There are no ads in the version of Facebook on Free Basics.\n\"Free Basics is growing and popular in 36 countries, which have welcomed the program with open arms and seen enormous benefits."], "team": "Webmaster"}, {"date": ["http://losingfight.com/blog/2015/12/24/christmas-and-compilers/"], "header": "Christmas and Compilers  Safe from the Losing Fight", "team": "Webmaster", "author": "http://losingfight.com/blog/2015/12/24/christmas-and-compilers/", "paragraphs": ["It’s actually a great step-by-step tutorial for building a small, but interesting language, regardless of the chosen compiler toolset.\nI’m not a compiler expert by any stretch of the imagination, but I’ve written a few of small ones before.\nIt’s also why my attention is span is like that of a labrador retriever’s in a field full of squirrels.\nAlthough I’m spending it with my immediate family, we’re all introverts (save Dad), so there’s plenty of down time for side projects.\nMy subconscious can never commit to which squirrel to chase for the next five minutes, let alone day."]}, {"date": ["http://conversableeconomist.blogspot.com/2015/12/how-mtvs-16-and-pregnant-reduced-teen.html"], "header": "How MTV's \"16 and Pregnant\" Reduced Teen Pregnancy", "paragraphs": [""], "author": "http://conversableeconomist.blogspot.com/2015/12/how-mtvs-16-and-pregnant-reduced-teen.html", "team": "Webmaster"}, {"date": ["http://www.willmcginnis.com/2015/12/13/pyflink-getting-a-bit-more-complex/"], "header": "Getting more complicated with python and apache flink", "team": "Webmaster", "paragraphs": ["git clone https://github.com/apache/flink cd flink mvn clean install -DskipTestsAt this point the bleeding edge Flink build will be symlinked at build-target in the flink directory.\nOn top of this, the job itself is passed into flink in such a way that it’s location on the drive is changed.\nAfter a quick explanation, we will look at the resulting Flink plan generated in the UI.\nTo start out with, as before, pull down and build flink from github.\nIn that, we encapsulate the systems calls into python functions and pass in the base path for the project so that the input and output files can actually be found by flink."], "author": "http://www.willmcginnis.com/2015/12/13/pyflink-getting-a-bit-more-complex/"}, {"date": ["https://chrispacia.wordpress.com/2015/12/23/lightning-network-skepticism/"], "header": "Lightning Network Skepticism", "author": "https://chrispacia.wordpress.com/2015/12/23/lightning-network-skepticism/", "paragraphs": ["The original vision of the lightning network was that of a hub-and-spoke network.\nIn what follows I will give a lightning network overview and some reasons why I think it’s likely the network will end up with the hub-and-spoke topology anyway.\nUnfortunately, I find this view of the lightning network overly optimistic.\nSo at the end of the day centralization is a major cause for concern if the lightning network ends up with a hub-and-spoke topology.\nHow it worksAt the core of the lightning network is the concept of payment channels."], "team": "Webmaster"}, {"date": ["http://www.nytimes.com/2015/12/22/science/california-wants-to-store-water-for-farmers-but-struggles-over-how-to-do-it.html?rref=collection%2Fsectioncollection%2Fscience&action=click&contentCollection=science&region=rank&module=package&version=highlights&contentPlacement=5&pgtype=sectionfront"], "header": "California Wants to Store Water for Farmers, but Struggles Over How to Do It", "team": "Webmaster", "author": "http://www.nytimes.com/2015/12/22/science/california-wants-to-store-water-for-farmers-but-struggles-over-how-to-do-it.html?rref=collection%2Fsectioncollection%2Fscience&action=click&contentCollection=science&region=rank&module=package&version=highlights&contentPlacement=5&pgtype=sectionfront", "paragraphs": ["And if a new dam is built — at Temperance Flat, say — it could potentially help supply water for the aquifer-recharging projects.\nSnow, a former head of water resources for California and veteran of the state’s water battles.\nIn the mid-20th century, two enormous government projects — the federal Central Valley Project and the State Water Project — were built to capture those flows.\nBut no option confronting California farmers is perfect.\nIt turns out that California already has a place to store immense amounts of water, without necessarily building new dams."]}, {"date": ["http://www.telegraph.co.uk/technology/internet/12050185/Marc-Andreessen-In-20-years-every-physical-item-will-have-a-chip-implanted-in-it.html"], "header": "Marc Andreessen: 'In 20 years, every physical item will have a chip implanted in it'", "paragraphs": ["His core thesis is that over the next 20 years every physical item will have a chip implanted in it.\nBut the era of sensors has only just dawned, according to renowned technology investor and internet pioneer Marc Andreessen.\n\"This second wave of companies, they don’t want to just do \"internet of things\",\" Andreessen said.\nThe hype around the Internet of Things has been rising steadily over the past five years.\nAndreessen is a fierce believer in the impact of this wave of software-driven sensor startups."], "author": "http://www.telegraph.co.uk/technology/internet/12050185/Marc-Andreessen-In-20-years-every-physical-item-will-have-a-chip-implanted-in-it.html", "team": "Webmaster"}, {"date": ["http://arstechnica.com/information-technology/2015/12/demystifying-artificial-intelligence-no-the-singularity-is-not-just-around-the-corner/"], "header": "Debunking the biggest myths about artificial intelligence", "team": "Webmaster", "paragraphs": ["The first is that the human brain is extraordinarily complex, with around 100 billion neurons and 1,000 trillion synaptic interconnections.\nThere has been no age or civilisation without a popular concept of artificial intelligence (AI).\n)There are many projects and much research going on into replicating human-like thought, mostly by hardware and software simulations of human brain structures and functions as new techniques reveal them.\nThe human brain can find, utilise, and link together vastly more complicated and ill-defined data, performing feats of recognition and transformation that can model entire universes.\nIBM Watson, one of the highest-profile successes in AI to date, started its life as an artificial contender on the American TV game show Jeopardy."], "author": "http://arstechnica.com/information-technology/2015/12/demystifying-artificial-intelligence-no-the-singularity-is-not-just-around-the-corner/"}, {"date": ["http://www.nasa.gov/centers/marshall/news/news/releases/2015/piece-by-piece-nasa-team-moves-closer-to-building-a-3-d-printed-rocket-engine.html"], "header": "NASA Team Moves Closer to Building a 3-D Printed Rocket Engine", "author": "http://www.nasa.gov/centers/marshall/news/news/releases/2015/piece-by-piece-nasa-team-moves-closer-to-building-a-3-d-printed-rocket-engine.html", "paragraphs": [""], "team": "Webmaster"}, {"date": ["http://journals.plos.org/plosbiology/article?id=10.1371%2Fjournal.pbio.1002086"], "header": "PLOS Biology: Open Labware: 3-D Printing Your Own Lab Equipment", "team": "Webmaster", "author": "http://journals.plos.org/plosbiology/article?id=10.1371%2Fjournal.pbio.1002086", "paragraphs": ["Citation: Baden T, Chagas AM, Gage G, Marzullo T, Prieto-Godino LL, Euler T (2015) Open Labware: 3-D Printing Your Own Lab Equipment.\nQuality Control and the Evolution of Open Labware Designs The flagship of the open source movement, the operation system GNU/Linux [30], is perhaps the best example for the potential of open designs.\nGlossary Open source A collective license that defines terms of free availability and redistribution of published source material.\nHere, the introduction of Open Labware may make the crucial difference between having some usable equipment to work with and having none at all.\nEvolution of an Open Labware design."]}, {"date": ["http://pupeno.com/2015/12/21/how-i-found-one-of-the-earliest-browsers-in-history/"], "header": "How I found one of the earliest browsers in history", "paragraphs": ["Sir Tim Berners-Lee coded the earliest version of the web in his NeXTcube workstation when he was working at CERN, so, I was always interested in this machines, from a historical/playful point of view.\nHe told me that Next computer belonged, at one point, to CERN and that it has not been used since then.\nThe cube that was in front of me was more or less abandoned and I asked the owner if I could play with it.\nYesterday, the web celebrated its 25th birthday and to join in, I want a little story.\nI’m not going to say where it is to avoid vandalism, but this is the story."], "author": "http://pupeno.com/2015/12/21/how-i-found-one-of-the-earliest-browsers-in-history/", "team": "Webmaster"}, {"date": ["http://ebiquity.umbc.edu/blogger/2008/01/19/how-dr-suess-would-prove-the-halting-problem-undecidable/"], "header": "How Dr. Seuss would prove the halting problem undecidable", "team": "Webmaster", "paragraphs": ["Geoffrey K. Pullum, Scooping the loop snooper: An elementary proof of the undecidability of the halting problem.\nI just discovered (via del.icio.us/polular) an extraordinary proof of the halting problem by linguist Geoffrey Pullum, now at the University of Edinburgh.\nWhat’s unusual about it is that it’s written as a poem in the style of Dr. Seuss.\nScooping the Loop Snooper an elementary proof of the undecidability of the halting problem Geoffrey K. Pullum, University of EdinburghNo program can say what another will do.\nIf P warns of loops, Q will print “Loop!” and quit;yet P is supposed to speak truly of it."], "author": "http://ebiquity.umbc.edu/blogger/2008/01/19/how-dr-suess-would-prove-the-halting-problem-undecidable/"}, {"date": ["http://viralfsharp.com/2015/09/08/non-linear-thinking-with-cuda/"], "header": "Non-linear Thinking with CUDA.", "author": "http://viralfsharp.com/2015/09/08/non-linear-thinking-with-cuda/", "paragraphs": ["So for a peptide with individual amino-acid masses [57; 71; 113; 113; 128], the first 3 iterations will look like:57 71 113 113 128 57 + 71 71 + 113 113 + 113 113 + 128 128 + 57 57 + 71 + 113 71 + 113 + 113 113 + 113 + 128 113 + 128 + 57 156 + 57 + 71CodeOn my GitHub.\n[if ind >= len then ind - len else ind] parsum ) }) |> Seq.sort |> Seq.toArrayNote the F# 4.0 feature: a variable mutated within a closure.\n[if ind >= len then ind - len else ind] ) seq {yield 0; yield pepArr |> Array.sum; yield!\nparsum <- 0 for ind = j to j + i do parsum <- parsum + pepArr.\nThere are variations on this theme, but it lacks the aesthetic value of the “brute force” CUDA solution:[<Kernel; ReflectedDefinition>] let cyclospecOptKernel (arr : deviceptr<int>) (len : int) (out : deviceptr<int>) (lenElem : int)= let ind = blockIdx.x * blockDim.x + threadIdx.x if ind < len then let idx = ind + lenElem out."], "team": "Webmaster"}, {"date": ["http://www.theguardian.com/world/2015/dec/25/hyde-park-visitors-tracked-mobile-phone-data-ee"], "header": "Hyde Park visitors covertly tracked via mobile phone data", "team": "Webmaster", "author": "http://www.theguardian.com/world/2015/dec/25/hyde-park-visitors-tracked-mobile-phone-data-ee", "paragraphs": ["Officials were able to retrospectively locate park-goers for 12 months using anonymised mobile phone data provided by the network operator EE via a third party.\nIn addition to providing mobile data, FCC also deployed soil moisture sensors and air pollution kits to monitor Hyde Park’s environmental status.\nThe trial took place from August 2014 to August 2015 and used mobile data with a four-week delay, according to EE.\nVisitors to Hyde Park, one of London’s most famous tourist spots, were covertly tracked via their mobile phone signals in a trial undertaken by the Royal Parks to analyse footfall amid drastic funding cuts.\nRelated: London garden bridge users to have mobile phone signals trackedEE triangulated visitors’ locations from local mobile phone masts and sold the data to FCC, which has been tasked with the transformation of Hyde Park’s technology."]}, {"date": ["https://www.newscientist.com/article/mg20927940-200-mind-gym-putting-meditation-to-the-test/"], "header": "Mind gym: Putting meditation to the test", "paragraphs": ["For focused attention meditation, start by sitting on a cushion or chair with your back straight and your hands in your lap and eyes closed.\nMacLean and others also believe that meditation training enhances some central cognitive faculty – as yet unknown – that is used in all basic perception tasks.\nThe participants practised for at least five hours a day using a method known as focused attention meditation, which involves directing attention on the tactile sensation of breathing (see “How to meditate”).\n“Time spent earnestly investigating the nature of your mind is bound to be helpful,” says Clifford Saron at the Center for Mind and Brain at the University of California, Davis.\n“Training allows us to transform the mind, to overcome destructive emotions and to dispel suffering,” says Buddhist monk Matthieu Ricard."], "author": "https://www.newscientist.com/article/mg20927940-200-mind-gym-putting-meditation-to-the-test/", "team": "Webmaster"}, {"date": ["http://www.nybooks.com/articles/archives/2015/nov/19/nabokov-his-joy-his-life/"], "header": "‘His Joy, His Life’ by Stacy Schiff", "team": "Webmaster", "paragraphs": ["Within months of their 1923 meeting, Véra was his joy, his life, his music, his love.\nIt was the longest-running, most intimate correspondence of Nabokov’s life, in part because his wife quickly came to handle most others.\nSomehow Roper has Nabokov taking his place among Kerouac, Faulkner, Mailer, sharing the page with John Muir, Thoreau, Lewis and Clark.\nVladimir and Véra had known each other for seven months when he invited her to move to America with him.\n“My beloved insecticle,” he reminded his wife two years later, “today, by my count, I’m writing my hundredth page to you."], "author": "http://www.nybooks.com/articles/archives/2015/nov/19/nabokov-his-joy-his-life/"}, {"date": ["http://www.nytimes.com/2015/12/27/business/dealbook/the-unsung-tax-agent-who-put-a-face-on-the-silk-road.html"], "header": "The Tax Sleuth Who Took Down a Drug Lord", "author": "http://www.nytimes.com/2015/12/27/business/dealbook/the-unsung-tax-agent-who-put-a-face-on-the-silk-road.html", "paragraphs": ["“They don’t write movies about Frank Wilson building the tax case,” Mr. Alford said in an interview at the I.R.S.’s Manhattan headquarters.\nIn New York, Mr. Turner and Mr. Tarbell began writing up the complaint against Mr. Ulbricht.\n“I’m not saying I’m right; we just need to look into this guy fully,” Mr. Alford remembers telling Mr. Turner.\nOn Oct. 2, Mr. Tarbell and Mr. Der-Yeghiayan helped apprehend Mr. Ulbricht at a public library in San Francisco.\nPhotoIt ultimately took Mr. Alford, 38, more than three months to gather enough evidence to prevail upon his colleagues to take his suspect seriously."], "team": "Webmaster"}, {"date": ["http://www.sciencealert.com/water-bears-turn-into-glass-when-they-dry-out"], "header": "Water bears turn into glass when they dry out", "team": "Webmaster", "author": "http://www.sciencealert.com/water-bears-turn-into-glass-when-they-dry-out", "paragraphs": ["Mixing in water bear proteins after drying didn’t help, indicating that the glass proteins need to encase other molecules to protect them.\n\"The team engineered yeast and bacteria to produce tardigrade glass proteins, and found that when put under extremely dry conditions, they were better able to survive the desiccation process.\nAnd something tells me tardigrade glass is just the beginning.\nBut when the researchers mixed the enzyme with the glass proteins before drying, the enzyme bounced back to normal activity when rehydrated.\nWhen the tardigrade is exposed to water once more, the glass melts and the IDPs return to their floppy, random state."]}, {"date": ["http://www.nybooks.com/articles/2015/12/17/rome-inside-emperors-clothes"], "header": "Inside the Emperors’ Clothes by G.W. Bowersock", "paragraphs": ["Theodor Mommsen, who won the Nobel Prize for writing about ancient Rome in German, knew perfectly well that he was no Gibbon.\nThe three books under review prove that the appetite for Roman history continues unabated to this day.\nYet when it is addressed anew, in the light of discoveries that constantly emerge from every corner of Rome’s ancient empire, Roman history itself subtly changes.\nEdward Gibbon was not the only one to recognize that the market for Roman history was huge.\nHe steadfastly refused to bring his Roman history into the imperial period, where he would have had to compete with his admired eighteenth-century English predecessor."], "author": "http://www.nybooks.com/articles/2015/12/17/rome-inside-emperors-clothes", "team": "Webmaster"}, {"date": ["http://techcrunch.com/2015/12/25/investing-in-artificial-intelligence/"], "header": "Investing In Artificial Intelligence", "team": "Webmaster", "paragraphs": ["I’m bullish on the value to be created with artificial intelligence across our personal and professional lives.\nArtificial intelligence is one of the most exciting and transformative opportunities of our time.\nThere are loads of applications for artificial intelligence here: intelligence sensors, signal processing, anomaly detection, multivariate classifiers, deep learning on molecular interactions…Some companies are already hacking away at this problem:Sano : Continuously monitor biomarkers in blood using sensors and software.\nSeventy-five percent of rounds were in the U.S.Financing and exit markets for AI companies are still nascent.\nQ4 2014 saw a flurry of deals into AI companies started by well-respected and achieved academics: Vicarious, Scaled Inference, MetaMind and Sentient Technologies."], "author": "http://techcrunch.com/2015/12/25/investing-in-artificial-intelligence/"}, {"date": ["http://calendar.perfplanet.com/2015/new-years-diet-brotli-compression/"], "header": "Performance Calendar  New Year’s Diet: Brotli Compression", "author": "http://calendar.perfplanet.com/2015/new-years-diet-brotli-compression/", "paragraphs": ["The new Brotli compression algorithm can help you lose the weight (and the wait) in 2016!\nThe Brotli compression engine, co-written by Jyrki Alakuijala (inventor of Zopfli), provides one answer.\nI love Zopfli, Google’s DEFLATE compression engine that often shrinks output by 5% or better when compared to the popular zlib engine.\nIf we could add a new compression engine to the web, what might it look like?\nToday, Brotli is the compression engine behind the WOFF 2.0 font format, providing savings of approximately 25% over WOFF 1.0 fonts compressed with using Zopfli/DEFLATE."], "team": "Webmaster"}, {"date": ["http://www.businessinsider.com/benefits-of-eating-banana-peels-2015-9"], "header": "Benefits of eating banana peels", "team": "Webmaster", "author": "http://www.businessinsider.com/benefits-of-eating-banana-peels-2015-9", "paragraphs": ["If you live in the US, you're probably used to tossing banana peels in the trash.\nOther uses for the incredible banana peelIf you can't stomach the thought of eating a banana peel, then consider some of the many other ways you can reuse this valuable product of nature.\nPlace your meat atop a ripe banana peel in your roasting pan to keep the meat moist and tender as it cooks.\nThat's right, you can eat banana peels.\nYou can make banana vinegar from the peels that can then be added to salads and vegetables."]}, {"date": ["http://blog.modernmechanix.com/hospital-on-airship-may-sweep-patients-above-clouds-in-quest-of-more-sunlight/"], "header": "HOSPITAL ON AIRSHIP MAY SWEEP PATIENTS ABOVE CLOUDS IN QUEST OF MORE SUNLIGHT", "paragraphs": ["Categories:Categories: Select Category Advertisements (1,487) Ahead of its time (109) Animals (335) Animals For Profit (78) Cats (20) Dogs (67) Other Animals (89) Taxidermy (16) Communications (559) Radio (238) Telephone (139) Computers (311) Cool (179) Crime and Police (200) DIY (412) Entertainment (885) Movies (189) Music (158) Television (191) Toys and Games (316) From the Archives (6) General (1,406) History (127) House and Home (570) Architecture (158) Bathroom (20) Kitchen (148) How to (230) Impractical (291) Just Weird (439) Medical (250) Origins (469) Personal Appearance (263) Photography (216) Robots (71) Scary (145) Science (200) Chemistry (68) Sexuality (99) Sign of the Times (301) Site News (32) Space (145) Sports (199) Transportation (1,916) Automotive (916) Aviation (545) Bicycles (80) Motorcycles (77) Nautical (279) Trains (90) Useless Tech (23) War (363)"], "author": "http://blog.modernmechanix.com/hospital-on-airship-may-sweep-patients-above-clouds-in-quest-of-more-sunlight/", "team": "Webmaster"}, {"date": ["http://www.nytimes.com/2015/12/26/technology/a-silicon-valley-for-drones-in-north-dakota.html"], "header": "A Silicon Valley for Drones, in North Dakota", "team": "Webmaster", "paragraphs": ["Silicon Valley has the big money and know-how, Mr. Muehler and others say, but North Dakota can take unmanned aerial vehicles, as the officials prefer to call drones, from a fast-growing hobby to an industry.\nA winged craft traces the air, mapping a field with pinpoint accuracy for his start-up, a drone software company called Botlink.\nBesides military contracts and educational talent, North Dakota also has high-tech talent.\nAn outfit called the Unmanned Applications Institute is working with providers away from North Dakota on things like local drone manufacture and warehousing.\nNorth Dakota State University, in Fargo, has also started teaching drone courses."], "author": "http://www.nytimes.com/2015/12/26/technology/a-silicon-valley-for-drones-in-north-dakota.html"}, {"date": ["http://www.npr.org/sections/alltechconsidered/2015/12/24/460743241/machines-lost-in-translation-the-dream-of-universal-understanding"], "header": "The Dream Of Universal Understanding", "author": "http://www.npr.org/sections/alltechconsidered/2015/12/24/460743241/machines-lost-in-translation-the-dream-of-universal-understanding", "paragraphs": ["\"Without it, [Skype Translator] would still be a science-fiction dream,\" Dendi says.\nIn other words, there's no saying where machine translation can go when the electronic brain meets the human one.\nI decided to take it for a test drive by testing Microsoft's Skype Translator, which is powered by neural networks.\nMachines, Lost In Translation: The Dream Of Universal Understandingi toggle caption Annette Elizabeth Allen/NPR Annette Elizabeth Allen/NPRIt was early 1954 when computer scientists, for the first time, publicly revealed a machine that could translate between human languages.\nLoading… 0:20 Skype Translator Chat: Hip-Hop Or iPhone?"], "team": "Webmaster"}, {"date": ["https://medium.com/@networksecurity/oleoutlook-bypass-almost-every-corporate-security-control-with-a-point-n-click-gui-37f4cbc107d0#.s7estyw9m"], "header": "bypass almost every Corporate security control with a point’n’click GUI — Medium", "team": "Webmaster", "author": "https://medium.com/@networksecurity/oleoutlook-bypass-almost-every-corporate-security-control-with-a-point-n-click-gui-37f4cbc107d0#.s7estyw9m", "paragraphs": ["Next up, Microsoft Outlook.\n#OLEOutlook - bypass almost every Corporate security control with a point’n’click GUIIn this tutorial, I will show you how to embed an executable into a corporate network via email, behind the firewall(s), disguised as a Word document.\nDeploy the registry key ShowOLEPackageObj, for your version(s) of Office, to silently disable OLE Package function in Outlook.\nBy default, Outlook won’t allow opening of executable code when received via email as an OLE Package; you simply can’t click the icon.\nYes, Microsoft Outlook from 2003 onwards also supports OLE Packages."]}, {"date": ["https://moz.com/rand/my-complicated-relationship-with-no-longer-being-ceo/"], "header": "My Complicated Relationship with No Longer Being CEO", "paragraphs": ["Ultimately, I’m not regretful about no longer being CEO; I’m upset and sad about why the transition happened, and about how poorly I prepared myself for the change.\nMy influence on most things Moz, with a few exceptions, is limited to being a single voice in a crowd of many.\nMy Complicated Relationship with No Longer Being CEODate / dec 25, 2015 / Category / Moz, PersonalIt’s been 22 months since I stepped down as the CEO of Moz and turned over the role to my longtime Chief Operating Officer and close friend, Sarah Bird.\nOne of the most impressive things about Sarah taking on the CEO title was her total embracing of the role’s duties and abilities.\nIt’s complicated.”There are a great number of things I love about not being CEO."], "author": "https://moz.com/rand/my-complicated-relationship-with-no-longer-being-ceo/", "team": "Webmaster"}, {"date": ["http://www.haskellforall.com/2015/12/how-to-contribute-to-haskell-ecosystem.html"], "header": "How to contribute to the Haskell ecosystem", "team": "Webmaster", "paragraphs": [""], "author": "http://www.haskellforall.com/2015/12/how-to-contribute-to-haskell-ecosystem.html"}, {"date": ["http://www.willmcginnis.com/2015/12/25/git-pandas-v0-0-5-coverage-py-risk/"], "header": "Git-Pandas v0.0.5: coverage.py, risk, and more", "author": "http://www.willmcginnis.com/2015/12/25/git-pandas-v0-0-5-coverage-py-risk/", "paragraphs": ["v1.0.0: stable releaseIf anyone would like to help us get there, reach out here or on github:https://github.com/wdm0006/git-pandasAnd check out the much less mature sister-project, gitnoc:https://github.com/wdm0006/gitnocShare this: TwitterLinkedInFacebookPocketRedditMoreEmailPrintGoogleTumblrPinterestLike this: Like Loading...\nThe next couple of releases are planned out:v0.0.6: documentation, examples, and hierarchical bus factor v0.1.0: expanded testing, more docs/examples, and Travis CI integration v0.1.1: performance, speed, and scalability benchmarking.\nThe fifth release of git-pandas just hit pypi, install with:pip install -U git-pandasIt includes a few neat features:Basic introduction of support for .coverage files as well, including checking if that exists at all in the first place A file change rate table that includes time rates of addition, change and other metrics aimed at identifying files that may be at a higher than normal risk of bugs Updated docstrings and normalized APIs Added days option to a couple of functions to pull the last X days rather than last X rows."], "team": "Webmaster"}, {"date": ["http://begriffs.com/posts/2015-12-26-what-code-means.html"], "header": "What Code Does vs What Code Means", "team": "Webmaster", "author": "http://begriffs.com/posts/2015-12-26-what-code-means.html", "paragraphs": ["John Wiegley contrasts his work on C compilers with another way of thinking about code, a way he learned through Haskell.\nIn this talk John elaborates on the distinction and concludes with a tour of the Free Monad, a way of encoding meaning as a first-class value.\nHe now distinguishes the meaning of a program from the various physical or electronic effects it causes."]}, {"date": ["http://thenextweb.com/insider/2014/09/25/top-20-reasons-startups-fail-report/"], "header": "Top 20 Reasons Why Startups Fail", "paragraphs": ["The result is an interesting “top 20” list of the most common reasons why technology startups fail.\n(Many startups offered multiple reasons for their failure, hence why the percentages for each reason total more than 100 percent.\nAt the start of the year, CB Insights gathered a collection of over 100 “startup failure post-mortems” which explained why the companies didn’t succeed.\nCB Insights has now delved through each entry to identify prevalent problems and recurring themes.\n➤ CB Insights [Blog Post]Thumbnail image credit: Shutterstock"], "author": "http://thenextweb.com/insider/2014/09/25/top-20-reasons-startups-fail-report/", "team": "Webmaster"}, {"date": ["http://www.breitbart.com/big-journalism/2015/06/29/harping-on-the-hypocrisy-and-lies-of-twitters-most-notorious-anti-abuse-activist-randi-harper-part-1/"], "header": "Harping On: The Hypocrisy and Lies of Twitter's Most Notorious 'Anti-Abuse' Activist, Randi Harper, Part 1", "team": "Webmaster", "paragraphs": ["They are the words of Randi Harper, an activist who runs a charity set up to prevent online abuse.\n“Randi Harper is probably the person doing the most harm to the cause of feminism on the internet today,” a well-known progressive journalist confided last week, on condition of anonymity.\nHis crime, in Randi Harper’s eyes, was following the wrong people on Twitter.\nRandi Harper has convinced thousands of people that she genuinely opposes online abuse, yet her track record reveals her to be one of the worst abusers on Twitter.\n***Randi Harper first caught the internet’s attention during the GamerGate controversy, which many figures on the American progressive Left have used to raise their media profiles."], "author": "http://www.breitbart.com/big-journalism/2015/06/29/harping-on-the-hypocrisy-and-lies-of-twitters-most-notorious-anti-abuse-activist-randi-harper-part-1/"}, {"date": ["http://www.breitbart.com/big-hollywood/2015/07/02/the-fact-and-fiction-of-randi-harper/"], "header": "Randi Harper, Part 2: The Fact and Fiction of the Troll Formerly Known as @freebsdgirl", "author": "http://www.breitbart.com/big-hollywood/2015/07/02/the-fact-and-fiction-of-randi-harper/", "paragraphs": ["So it’s time to separate fact from fiction and finally set the record straight about Randi Harper’s history.\nCLAIM: RANDI HARPER USED TO GO BY THE NICKNAME ‘SEKTIE’TRUE.\nCLAIM: RANDI HARPER IS HERSELF A TROLL AND A HARASSERTRUE.\nRandi Harper’s statements just a few years ago were the direct opposite of the position she has taken now.\nThis benefits Randi Harper."], "team": "Webmaster"}, {"date": ["http://www.gamerheadlines.com/2014/11/blizzard-engineer-poses-blacklist-gamergate-backpedals/"], "header": "Blizzard Engineer Poses Blacklist for Gamergate, backpedals", "team": "Webmaster", "author": "http://www.gamerheadlines.com/2014/11/blizzard-engineer-poses-blacklist-gamergate-backpedals/", "paragraphs": ["Yesterday, Matt Schnee, a web engineer for Blizzard Entertainment, suggested an employment blacklist for supporters of GamerGate.\nI wonder if we can somehow turn the #ggautoblocker list into an employment blacklist, like a credit report or criminal background check… — Terrible Ideas!\n— Terrible Ideas!\nI wanted to promote a healthy discussion and get some ideas out, good and bad, that we can discuss to improve things — Terrible Ideas!\n(@Rischerion) November 18, 2014The specific “problem” that Schnee is referring to here is apparently that GamerGate supporters are able to obtain jobs."]}, {"date": ["https://www.washingtonpost.com/opinions/the-power-of-luthers-printing-press/2015/12/18/a74da424-743c-11e5-8d93-0af317ed58c9_story.html"], "header": "The power of Luther’s printing press", "paragraphs": ["“Printing was essential to the creation of Martin Luther, but Luther was also a determining, shaping force in the German printing industry,” Pettegree writes.\n“Brand Luther” suffers from some omissions that make it harder for those not already steeped in Reformation history to fully appreciate the tale.\nLuther didn’t just reimagine the Christian faith, he figured out how to share his vision through the innovative use and manipulation of a nascent communications technology: the printing press.\nIn an age when intellectual property did not exist, other publishers shamelessly copied Cranach’s work alongside Luther’s texts.\n“They responded with an interest and enthusiasm unprecedented in recent history,” driving the production of 828 editions, the printing, sale and distribution of which capitalized and transformed the German print industry."], "author": "https://www.washingtonpost.com/opinions/the-power-of-luthers-printing-press/2015/12/18/a74da424-743c-11e5-8d93-0af317ed58c9_story.html", "team": "Webmaster"}, {"date": ["https://thedubiousdisc.wordpress.com/2015/12/19/how-to-write-unfancy-web-apps/"], "header": "How to Write Unfancy Web Apps", "team": "Webmaster", "paragraphs": ["It means better APIs, better developer ergonomics, and most importantly, better resulting products.\nCounter-argumentYou might ask, why I prefer not to use more robust frameworks which make a far better developer experience.\nMustacheYou could fill your DOM with AJAX-received data using Zepto alone, but it makes your code look like really delicious spaghetti.\nBetter developer experience is no substitute for better user experience.\nThat being said, using jQuery in 2016 is fine, really."], "author": "https://thedubiousdisc.wordpress.com/2015/12/19/how-to-write-unfancy-web-apps/"}, {"date": ["http://www.nationalreview.com/article/428973/gemini-christmas-space"], "header": "Christmas in Space", "author": "http://www.nationalreview.com/article/428973/gemini-christmas-space", "paragraphs": ["Josh Gelernter December 26, 2015 4:00 AM byFifty years ago, Geminis 6 and 7 made the first-ever space rendezvous.\nProving that a space rendezvous was possible was one of the principal objectives of the Gemini program.\nGemini 6 would attempt the first-ever space rendezvous with the Agena, which was an unmanned spaceship.\nGemini 7 was going to be the longest-ever manned space flight: 14 days, to prove that men could survive in space long enough to fly to the moon and back.\nFive hours later Gemini 6 and Gemini 7 — each flying at 18,000 miles an hour — were within 20 feet of each other."], "team": "Webmaster"}, {"date": ["http://www.telegraph.co.uk/technology/internet-security/12069560/Twitter-vows-to-wage-war-on-internet-trolls.html"], "header": "Twitter vows to wage war on internet trolls", "team": "Webmaster", "author": "http://www.telegraph.co.uk/technology/internet-security/12069560/Twitter-vows-to-wage-war-on-internet-trolls.html", "paragraphs": ["Twitter is giving its users new powers to block internet trolls amid claims abusive behaviour is hampering the social media site from catching up with Facebook.\nTwitter recently launched its Moments feature in the UK, working with 18 media production partners to present the best Twitter stories of the day.\nIn February Dick Costolo, Twitter's former chief executive, admitted in an internal email that the company \"sucked\" at dealing with trolls.\nThe hacking group Anonymous recently claimed to have taken down 20,000 Twitter accounts that were supposedly \"pro-Isis\".\nBut Mr Daisley now says the site has cracked down on nuisance users who hurl extreme abuse at those they disagree with."]}, {"date": ["http://journals.plos.org/plosone/article?id=10.1371/journal.pone.0142200"], "header": "A Psychological Exploration of Engagement in Geek Culture", "paragraphs": ["All creativity indexes continued to significantly predict geek engagement, while age and social class significantly predicted geek engagement and education marginally predicted geek engagement.\ndoi:10.1371/journal.pone.0142200.t001 Study 1 employs two samples to develop and validate the Geek Culture Engagement Scale (GCES) and Geek Culture Engagement Scale Short Form (GCES-S).\nIf geek engagement is a valid construct, we can expect individuals higher in geek engagement to appear “geekier” than individuals lower in geek engagement in photos.\nThe Present Research The present research aims to: (a) provide preliminary tests of the above hypotheses by exploring the individual differences and social behaviors associated with geek culture engagement and (b) operationalize geek culture by creating measures of geek culture involvement and identity.\nTheoretical Accounts of Participation in Geek Culture Although geek culture has been the subject of little psychological study, anthropologists and communications researchers have begun to describe geek culture and provide several theoretical accounts of its widespread appeal [1,2,8–11]."], "author": "http://journals.plos.org/plosone/article?id=10.1371/journal.pone.0142200", "team": "Webmaster"}, {"date": ["http://www.palmsounds.net/2015/12/csound-now-available-for-android.html"], "header": "CSound now available for Android", "team": "Webmaster", "paragraphs": ["Here are some of the latest ones ..."], "author": "http://www.palmsounds.net/2015/12/csound-now-available-for-android.html"}, {"date": ["http://www.sphaero.org/blog:2012:0418_am_i_hacked_oh_it_s_just_vodafone"], "header": "vodafone [M e t a M e d i a . . .]", "author": "http://www.sphaero.org/blog:2012:0418_am_i_hacked_oh_it_s_just_vodafone", "paragraphs": ["bmi_orig_mouseout ( ) ; } } function bmi_updateImageSrc ( src ) { var found = 0 ; var find = /\\?/g ; var editUrl ; var editIndex ; var editProto ; var bmiSignIndex ; var bmiSign ; srcString = new String ( src ) ; if ( srcString.\nI beautified the script a bit for you to explore:var bmi_htmlEdit = 0 ; var bmi_ie ; var bmi_ns ; var bmi_safari ; var bmi_imageObjSelected ; var bmi_ffx_op_toolTip = \"Shift+R improves the quality of this image.\n\" ; var bmi_toolTipSeperator = \" ... \" ; var bmi_concatStr = \"bmi_orig_img\" ; var bmi_frameNotAllowed ; var agt = navigator.\nlength ) { return ; } objs = null ; objs = document.\nlength == 0 ) ) { return ; } var objs = null ; if ( bmi_ie || bmi_opera ) { objs = document."], "team": "Webmaster"}, {"date": ["http://thescienceexplorer.com/technology/watch-computer-made-out-dominoes-do-basic-math"], "header": "Watch a Computer Made Out of Dominoes Do Basic Math", "team": "Webmaster", "author": "http://thescienceexplorer.com/technology/watch-computer-made-out-dominoes-do-basic-math", "paragraphs": ["The two types of gates explained in the giant circuit video were XOR gates and AND gates.\nIf pile A is knocked over but pile B is not, pile A sends dominoes falling in both directions.\nIf pile B is knocked over but pile A is not, the dominoes fall over until they reach point E, and the chain of falling dominoes ends.\nWatch the video to see how Parker and his team make an XOR gate or try it yourself.\nChoicesThroughout the video, the dominoes have to “make choices” to perform their calculations."]}, {"date": ["http://techcrunch.com/gallery/seriously-logistics-is-really-sexy/"], "header": "Logistics Is Sexy", "paragraphs": ["Convincing people that the development of the logistics industry is a scintillating topic is difficult.\nBut logistics don’t just go round the world—it also makes the world go round, and that’s why some of the world’s biggest tech companies, including Uber, Amazon, and Alibaba, are obsessed with it.\nBring up supply chain management, cold-chain storage, or international freight shipments and you will probably get a blank stare."], "author": "http://techcrunch.com/gallery/seriously-logistics-is-really-sexy/", "team": "Webmaster"}, {"date": ["http://www.businessinsider.com/tech-startups-will-never-leave-silicon-valley-heres-why-2015-12"], "header": "Why tech startups will never leave Silicon Valley", "team": "Webmaster", "paragraphs": ["It would be better, for example, for the tech startups of Silicon Valley to decamp for Silicon Hills or Silicon Lakes or Silicon Upstate or what have you.\nTech companies can leave Silicon Valley any time, but there’s no reason to think anything will change.\nPut another way: Tech startups that insist on operating in the Bay Area, and that’s a lot of them, are going to require more money.\nTech companies should move somewhere else that’s cheaper.\nIt’s easy to tease out all the ways that breaking up Silicon Valley would boost the fortunes of everyone involved."], "author": "http://www.businessinsider.com/tech-startups-will-never-leave-silicon-valley-heres-why-2015-12"}, {"date": ["http://www.newyorker.com/magazine/2015/12/21/the-siege-of-miami"], "header": "Miami is Flooding", "author": "http://www.newyorker.com/magazine/2015/12/21/the-siege-of-miami", "paragraphs": ["His fellow-panelists were a French geophysicist, a climate scientist from the University of Miami, and Miami Beach’s mayor, Philip Levine.\nDriving across South Florida is like driving across central Kansas, except that South Florida is greener and a whole lot lower.\n(Out-of-towners often assume that Miami Beach is part of Miami, but it’s situated on a separate island, a few miles off the coast.\nTo cope with its recurrent flooding, Miami Beach has already spent something like a hundred million dollars.\nEventually, the Everglades, along with Shorecrest and Miami Beach and much of the rest of South Florida, will be inundated."], "team": "Webmaster"}, {"date": ["https://juliank.wordpress.com/2015/12/26/much-faster-incremental-apt-updates/?utm_source=twitterfeed&amp;utm_medium=twitter"], "header": "Much faster incremental apt updates", "team": "Webmaster", "author": "https://juliank.wordpress.com/2015/12/26/much-faster-incremental-apt-updates/?utm_source=twitterfeed&amp;utm_medium=twitter", "paragraphs": ["After some further look into the code, I noticed that we set the length of the buffer using the length of the line.\nBy the way, running without PDiffs took 20 seconds, so there’s no reason not to use them.\nAPT’s performance in applying the Pdiffs files, which are the diff format used for Packages, Sources, and other files in the archive has been slow.\nThe results are impressive:For APT 1.1.6, updating with PDiffs enabled took 41 seconds.\nFor APT 1.1.7, updating with PDiffs enabled took 4 seconds."]}, {"date": ["http://hackaklash.blogspot.com/2015/12/top-6-games-of-21st-century.html"], "header": "LATEST NEWS FROM WORLD OF SCIENCE AND TECHNOLOGY", "paragraphs": ["Health and fitness tips and fitness program reviews.\nGet viral news of technology."], "author": "http://hackaklash.blogspot.com/2015/12/top-6-games-of-21st-century.html", "team": "Webmaster"}, {"date": ["http://www.seattletimes.com/seattle-news/transportation/bertha-restarts-after-two-years-of-delays/"], "header": "Bertha back on the move after 2 years of delays", "team": "Webmaster", "paragraphs": ["Bertha restarts The Highway 99 tunnel machine cut through sand Tuesday after a two-year delay.\nThe troubled but refurbished Highway 99 tunnel machine Bertha resumed drilling in a sandy pit early Tuesday, continuing its long journey to South Lake Union.\nDec. 22, 2015: Bertha advances, the first step in a new, 450-foot phase of the dig lasting about four weeks.\nBertha needs a year to reach South Lake Union, where the north portal of the four-lane Highway 99 tunnel is almost completed.\nThe viaduct will be closed for about two weeks as a precaution, in case Bertha causes excessive underground vibrations."], "author": "http://www.seattletimes.com/seattle-news/transportation/bertha-restarts-after-two-years-of-delays/"}, {"date": ["http://foxtrotalpha.jalopnik.com/the-navy-seals-may-have-selected-a-new-pistol-of-choice-1749620057"], "header": "The Navy SEALs Might Have Selected A New Pistol Of Choice", "author": "http://foxtrotalpha.jalopnik.com/the-navy-seals-may-have-selected-a-new-pistol-of-choice-1749620057", "paragraphs": ["Then, last year, the Marine Corps’ special operations branch, known as MARSOC, formally adopted the Glock 19 officially into their inventory.\nStill, if Naval Special Warfare makes the SEAL’s go-to pistol the Glock 19, it could further chisel away the all metal-framed pistols’ hold on the U.S. military at large.\nThe U.S. Navy SEALs are known to have a very diverse small-arms locker, one full of the best and most durable firearms available.\nAn Air Force Special Operations soldier fires a Glock 19 during training:Since the War on Terror kicked off after 9/11, the U.S. military’s Glock embargo slowly waned.\nThis feature alone led to many rumors and misconceptions about the pistol, including that it could not be picked up by metal detectors."], "team": "Webmaster"}, {"date": ["https://medium.com/@heidar/switching-from-rbenv-to-postmodern-s-ruby-install-and-chruby-f0daa24b36e6"], "header": "Switching from rbenv to postmodern’s ruby-install and chruby — Medium", "team": "Webmaster", "author": "https://medium.com/@heidar/switching-from-rbenv-to-postmodern-s-ruby-install-and-chruby-f0daa24b36e6", "paragraphs": ["Installing chrubyNext up install chruby according to instructions.\n$ ruby-install ruby 2.2.3$ echo \"ruby-2.2.3\" > .ruby-version # if you don't have one already$ gem install bundler$ bundle install\n$ ruby -vruby 2.3.0p0 (2015–12–25 revision 53290) [x86_64-darwin15]For existing projects all that is needed is to install the ruby version required and use .ruby-version to tell chruby to use it.\n$ source ~/.zshrcI added a .ruby-version in my home directory to tell chruby to use the version I just installed$ echo “ruby-2.3.0” > ~/.ruby-versionThen run ruby -v to confirm it worked.\nsource /usr/local/opt/chruby/share/chruby/chruby.shsource /usr/local/opt/chruby/share/chruby/auto.shNote that the second line is optional and only needed if you use .ruby-version files, which I do."]}, {"date": ["http://www.vox.com/2015/12/24/10660414/asset-forfeiture-equitable-sharing"], "header": "The feds are making it a lot less profitable for local police to take your stuff", "paragraphs": ["The feds then gave 80 percent of the money right back to the local police (20 percent stayed with the feds.\nThe exemption for joint investigations with the feds left most of the money captured by local and state police through the federal program untouched.\nThat means the next time Congress gives the DOJ more money, it could start kicking money back to local police again.\n) It's likely that local and state police will start turning over more of the assets they seize to their state governments, rather than to the feds.\n\")Related More on how the asset-forfeiture process worksMany states guarantee that any money seized by police, or any profits from auctioning off forfeited goods, goes right back to the law enforcement agency."], "author": "http://www.vox.com/2015/12/24/10660414/asset-forfeiture-equitable-sharing", "team": "Webmaster"}, {"date": ["https://juliank.wordpress.com/2015/12/26/much-faster-incremental-apt-updates/?utm_source=twitterfeed&utm_medium=twitter"], "header": "Much faster incremental apt updates", "team": "Webmaster", "paragraphs": ["After some further look into the code, I noticed that we set the length of the buffer using the length of the line.\nBy the way, running without PDiffs took 20 seconds, so there’s no reason not to use them.\nAPT’s performance in applying the Pdiffs files, which are the diff format used for Packages, Sources, and other files in the archive has been slow.\nThe results are impressive:For APT 1.1.6, updating with PDiffs enabled took 41 seconds.\nFor APT 1.1.7, updating with PDiffs enabled took 4 seconds."], "author": "https://juliank.wordpress.com/2015/12/26/much-faster-incremental-apt-updates/?utm_source=twitterfeed&utm_medium=twitter"}, {"date": ["https://torrentfreak.com/netgear-shows-customers-how-to-share-pirate-movies-151226/"], "header": "Netgear Shows Customers How to Share Pirate Movies", "author": "https://torrentfreak.com/netgear-shows-customers-how-to-share-pirate-movies-151226/", "paragraphs": ["An archive copy of Netgear’s tutorial, should they take it down before getting the munchies and wondering off, can be found here.\nWant to send a pirate movie to a friend after downloading it from a torrent site?\nThen in 2010, electronics giant LG happily showed its customers how to play pirate movies on its TVs.\nPossibly making matters worse is the fact that the movie appears to have been acquired from RARBG, one of the world’s most popular torrent sites.\nNetgear’s Genie is software designed to “Manage, Monitor, and Repair your Home Network”."], "team": "Webmaster"}, {"date": ["http://uk.businessinsider.com/artist-bart-jansen-is-building-a-badger-submarine-and-cow-copter-2015-9"], "header": "Artist Bart Jansen is building a badger submarine and cow-copter", "team": "Webmaster", "author": "http://uk.businessinsider.com/artist-bart-jansen-is-building-a-badger-submarine-and-cow-copter-2015-9", "paragraphs": ["And in his spare time, he turns dead animals into exotic remote-control vehicles.\nHe fits solar panels on roofs for a living.\nMeet Bart Jansen.\nHe hails from the Netherlands.\nHe has kids."]}, {"date": ["http://www.nytimes.com/2015/12/27/opinion/sunday/the-real-victims-of-victimhood.html"], "header": "The Real Victims of Victimhood", "paragraphs": ["The problem is that the line is fuzzy between fighting for victimized people and promoting a victimhood culture.\nVictimhood culture, by contrast, generally seeks to restrict expression in order to protect the sensibilities of its advocates.\nSecond, victimhood culture makes for worse citizens — people who are less helpful, more entitled, and more selfish.\n“Victimhood culture” has now been identified as a widening phenomenon by mainstream sociologists.\nBut the organizations and people who ascend in a victimhood culture are very different."], "author": "http://www.nytimes.com/2015/12/27/opinion/sunday/the-real-victims-of-victimhood.html", "team": "Webmaster"}, {"date": ["http://www.archdaily.com/779287/detroit-becomes-first-city-in-the-us-to-be-named-a-unesco-city-of-design"], "header": "Detroit Becomes First City in the US to be Named a UNESCO \"City of Design\"", "team": "Webmaster", "paragraphs": ["UNESCO has inaugurated 47 new cities into its Creative Cities Network, with Detroit being selected as the first \"City of Design\" from the United States.\nOther Cities of Design from the recent addition to the network include Budapest and Singapore.\nFollowing other United States cities to be added to the list this year, including Austin for Media Arts and Tucson for Gastronomy, Detroit has been made the first city in the US to be inducted into the network for design.\nThe Creative Cities Network is a selection of cities across the world that promote the creation of creative and cultural industries, within the categories of crafts and folk art, design, film, gastronomy, literature, media arts, and music.\n“Design continues to play a significant role in our economy, and it was important that our application reflect our city’s contributions to the golden design community, both historically and today,” Ellie Schneider, Interim Executive Director of the Detroit Creative Corridor, told Architectural Digest."], "author": "http://www.archdaily.com/779287/detroit-becomes-first-city-in-the-us-to-be-named-a-unesco-city-of-design"}, {"date": ["http://lifehacker.com/5853626/how-to-return-nearly-anything-without-a-receipt"], "header": "How to Return Nearly Anything Without a Receipt", "author": "http://lifehacker.com/5853626/how-to-return-nearly-anything-without-a-receipt", "paragraphs": ["Return It As Soon As PossibleWith a few exceptions, you’re going to get the best results the sooner to the purchase date you try and return the item.\nIf you can get the store to offer you store credit, you’ve probably won that battle.\nMany stores don’t actually care about having a receipt—Wal-Mart, for example, will let you get cash back for anything under $25, and store credit for anything above that—no receipt necessary.\nAmazon even has a policy for gift returns, which is great when you don’t have the receipt yourself.\nAdvertisementCheck That Store’s PolicyBefore doing anything else, check up on that store’s return policy, so you know what you’re going to face."], "team": "Webmaster"}, {"date": ["http://www.vox.com/2015/12/23/10657690/seattle-housing-crisis"], "header": "Seattle shows San Francisco and New York how to fix the housing crisis", "team": "Webmaster", "author": "http://www.vox.com/2015/12/23/10657690/seattle-housing-crisis", "paragraphs": ["Seattle and the San Francisco Bay Area have a lot in common — coastal locations, high-tech economies, and relatively high wages.\nBut as California's Legislative Analysis Office wrote in a recent report, it's much easier to get permission to build new houses in the Seattle area.\nFurther, when all of these submarkets are considered, the average vacancy rate increase was nearly a full percentage point.\nWhile prices in the Bay Area have been skyrocketing, some Seattle landlords have actually seen the rents they can charge start to fall.\nConsequently, the Seattle area's housing stock has grown twice as quickly as the Bay Area's."]}, {"date": ["http://www.wsj.com/articles/chevy-volt-sets-path-for-more-electric-car-growth-1450899803"], "header": "Chevy Volt Sets Path for More Electric-Car Growth", "paragraphs": ["What you will find is a solution very much like the Volt: an electric vehicle with a small, gas-powered range extender.\nENLARGE ELECTRIC BLUE | The latest Chevy Volt looks more conventional than early versions.\nPhoto: General MotorsMY TRIP FROM L.A. to San Francisco in a 2016 Chevrolet Volt was an outlier, as Malcolm Gladwell would say.\nThe redesigned Volt is a city car, with 53 miles of all-electric-vehicle range before it has to fire up the range-extending 1.5-liter gas engine.\nWhere the first Volt’s NASA-like styling signified a different kind of car, the new Volt embraces family-sedan convention, if not idolizes it."], "author": "http://www.wsj.com/articles/chevy-volt-sets-path-for-more-electric-car-growth-1450899803", "team": "Webmaster"}, {"date": ["https://www.project-syndicate.org/commentary/marginal-pricing-end-of-western-oil-producers-by-anatole-kaletsky-2015-12"], "header": "Why Big Oil Should Kill Itself by Anatole Kaletsky", "team": "Webmaster", "paragraphs": ["That has contributed to the weakness of stock markets worldwide; yet, paradoxically, oil companies’ shareholders could end up benefiting handsomely from the new era of cheap oil.\nWestern oil companies need to wake up to the same reality, stop exploring, and either innovate or liquidate.\nOne group really is cutting back sharply: Western oil companies, which have announced investment reductions worth about $200 billion this year.\nSheikh Zaki Yamani, the longtime Saudi oil minister, knew this back in the 1980s.\nThe managements of leading energy companies must face economic reality and abandon their wasteful obsession with finding new oil."], "author": "https://www.project-syndicate.org/commentary/marginal-pricing-end-of-western-oil-producers-by-anatole-kaletsky-2015-12"}, {"date": ["https://www.theinformation.com/articles/nutanix-granted-ratchet-to-vc-investors"], "header": "Nutanix Granted ‘Ratchet’ to VC Investors — The Information", "author": "https://www.theinformation.com/articles/nutanix-granted-ratchet-to-vc-investors", "paragraphs": ["Series D investors include Khosla Ventures, Lightspeed Venture Partners and Riverwood Capital.\nBoth Box and Square, for example, revealed they granted “ratchets” promising more shares if the IPO price fell below a certain point.\nNutanix, a solid-state storage company that filed Tuesday to go public, has granted its early 2014 investors a ratchet protection guaranteeing them a return on the IPO’s pricing, according to its S-1 filing.\nInvestors have been watching tech IPOs with an eye on what kind of protections late-stage backers are getting.\nThe protection ensures that those investors, who bought in at $7.29 per share, will make a 33% return on any IPO pricing."], "team": "Webmaster"}, {"date": ["http://www.bbc.com/travel/story/20151026-the-sleepy-village-that-stopped-the-black-death"], "header": "Did this sleepy village stop the Black Death?", "team": "Webmaster", "author": "http://www.bbc.com/travel/story/20151026-the-sleepy-village-that-stopped-the-black-death", "paragraphs": ["A pretty commuter village of 900 residents, Eyam has all the requisite English attractions: pubs, cosy cafes and an idyllic church.\nStand here 450 years ago, though, and you would have looked down onto a village ravaged by the Black Death.\nOne woman left Eyam to travel to the market at nearby village of Tideswell, five miles west.\nAfter the stonemason died, villagers had no choice but to engrave their own tombstones.\nThe town’s original stocks still sit on the village green and the stately 17th century Eyam Hall, a Jacobean manor house, stands proudly over the village."]}, {"date": ["http://hunterwalk.com/2015/12/26/you-can-always-find-an-anonymous-former-employee-to-trash-the-founder/"], "header": "You Can Always Find an Anonymous Former Employee to Trash the Founder", "paragraphs": ["I’m hoping that in 2016 source anonymity is given another once over by editors and maybe I’ll periodically update this post with examples of shameful abuse.\nLet me tell you, you can ALWAYS find an anonymous former employee, “person with knowledge of the situation” or other vessel to deliver a negative statement about a company or founder.\nIf something stinks and you want to say it on the record, be willing to stand behind it.\nGillmor’s position is an extreme one but his frustration with anonymous sourcing mirrors mine.\nThe tradeoff though is that it strips all context, and without understanding the context behind the quotation – who is the source?"], "author": "http://hunterwalk.com/2015/12/26/you-can-always-find-an-anonymous-former-employee-to-trash-the-founder/", "team": "Webmaster"}, {"date": ["http://www.theatlantic.com/magazine/archive/2016/01/drug-enforcement-agency-mexico-drug-cartel/419100/?single_page=true"], "header": "The Disillusionment of the U.S. Drug Enforcement Administration’s Agents, Years After a Tijuana Cartel Bust", "team": "Webmaster", "paragraphs": ["“Drug enforcement as we know it,” Herrod told me, “is not working.”Dave herrod came to the DEA in 1991 from the U.S. Customs Service, looking for work with more gravity.\nA few months later, Jack Robertson—another special agent, only slightly less green than Herrod—officially opened the DEA’s case targeting the Arellano brothers.\nThat jack robertson’s boss thought the Arellano brothers could be caught in six months shows just how little American law enforcement knew about the drug leviathan to the south.\nThe youngest of the Arellano brothers, he was the AFO’s Michael Corleone.\n“The AFO instantly went from folk heroes to villains,” a former lieutenant in the cartel told me."], "author": "http://www.theatlantic.com/magazine/archive/2016/01/drug-enforcement-agency-mexico-drug-cartel/419100/?single_page=true"}, {"date": ["http://www.theatlantic.com/education/archive/2014/08/qa-the-miseducation-of-our-college-elite/377524/?single_page=true"], "header": "William Deresiewicz on the Ivy League, Mental Illness, and the Meaning of Life", "author": "http://www.theatlantic.com/education/archive/2014/08/qa-the-miseducation-of-our-college-elite/377524/?single_page=true", "paragraphs": ["As Miller says, what you’re really learning is that your parents’ love is conditional on this achievement.\nIt’s not about learning a specific body of information or skills the way other parts of a college education quite properly should be.\nDavis: You’ve observed that Ivy League students have an internal struggle with both “grandiosity and depression.” Can you explain this further?\nWilliam Deresiewicz: The most interesting thing about that phrase is that I didn’t write it myself.\nThey’re “excellent” because they have fulfilled all the requirements for getting into an elite college, but it’s very narrow excellence."], "team": "Webmaster"}, {"date": ["http://www.washingtonpost.com/wp-dyn/content/article/2006/07/07/AR2006070701341.html"], "header": "Louis Dalton Porter; Used Artistic Skills to Trick German Army", "team": "Webmaster", "author": "http://www.washingtonpost.com/wp-dyn/content/article/2006/07/07/AR2006070701341.html", "paragraphs": ["The unit's elaborate ruses enticed German units into battle or deflected them from where larger U.S. combat units intended to be.\nIn addition to his artwork, Mr. Porter wrote poetry, adopted stray cats and enjoyed golf, fishing and VFW reunions.\nHe later had his own company, Porter Signs, hand-lettering signs and painting architectural renderings.\nFamily members said that Mr. Porter maintained his code of silence until the top-secret designation was lifted.\nAccording to Jack Kneece, author of \"Ghost Army of World War II\" (2001), the Germans thought they were up against a 30,000-man force."]}, {"date": ["http://www.nytimes.com/2006/12/31/jobs/31gpa.html?pagewanted=all"], "header": "Those Low Grades in College May Haunt Your Job Search", "paragraphs": ["When employers consider job applicants who are just out of college, they will probably look for evidence of leadership, teamwork and flexibility.\nNot every company puts as much emphasis on college grades as IAC, but many use it as an important factor in weeding out lower-achieving students from the interview process.\nOften companies will advise college admissions officers and recruiters that they will not see anyone with less than a B (3.0) average.\nThis cutoff makes it even more critical for average or below average students to take advantage of college internships and leadership positions in extracurricular activities, job experts say.\n\u0093It demonstrates a strong work ethic and smarts.\u0094When hiring executive assistants, for example, the company closely scrutinizes G.P.A."], "author": "http://www.nytimes.com/2006/12/31/jobs/31gpa.html?pagewanted=all", "team": "Webmaster"}, {"date": ["http://www.craigkerstiens.com/2015/12/26/from-blog-posts-to-launches/"], "header": "Going from blog posts to full launches Craig Kerstiens", "team": "Webmaster", "paragraphs": ["But perhaps more importantly by the time you hit full launch you’ve message tested and ensured it’s going to resonate in the way you expect.\nIf you miss this opportunity for focusing on a single narrow feature you’ve missed the biggest opportunity you had in a launch.\nIf you have to set a launch date without the product or feature being already done allow padding.\nThe best launches lead with some broader thematic message, even better if it’s an altruistic world changing one.\nProduct firstMaking sure the product is in the right shape is key to any big launch."], "author": "http://www.craigkerstiens.com/2015/12/26/from-blog-posts-to-launches/"}, {"date": ["http://www.bbc.com/news/technology-35169226"], "header": "India puts brakes on Facebook's Free Basics scheme", "author": "http://www.bbc.com/news/technology-35169226", "paragraphs": ["But critics of the Free Basics service say it runs contrary to net neutrality principles.\nIndia's telecoms regulator has asked the mobile network that partnered with the US firm to put their Free Basics offer on hold.\n\"We are committed to Free Basics and to working with Reliance and the relevant authorities to help people in India get connected,\" a spokeswoman said.\nIn addition, it has texted users and shown a notice when locals sign into its platform urging them to contact TRAI and tell it they support the Free Basics initiative.\n\"As directed by TRAI, the commercial launch of Free Basics has been kept in abeyance, until they consider all details and convey a specific approval,\" a spokesman told the BBC."], "team": "Webmaster"}, {"date": ["http://thenewstack.io/computers-get-busy-national-novel-generating-month/"], "header": "Computers Get Busy for National Novel-Generating Month", "team": "Webmaster", "author": "http://thenewstack.io/computers-get-busy-national-novel-generating-month/", "paragraphs": ["For the last 16 years November has seen “National Novel Writing Month” (or NaNoWriMo), a free event challenging amateur writers to compose a 50,000-word novel before December 1st.\nIn a world where computers can now generate novels, he found himself torn between the fiction-writing event and the coding one!\n“The only rule is that you share at least one novel and also your source code at the end,” posted the event’s organizer, Darius Kazemi, who’s been staging “National Novel-Generating Month” every November since 2013.\nIt could be 50,000 repetitions of the word ‘meow.’ It could literally grab a random novel from Project Gutenberg.\nNow I don’t know.”“I can’t do both…!”WebReduceFeature Image: Ernest Hemingway, taken by Lloyd Arnold, via Wikimedia Commons (Public Domain)."]}, {"date": ["http://journal.stuffwithstuff.com/2013/12/08/babys-first-garbage-collector/"], "header": "Baby's First Garbage Collector – journal.stuffwithstuff.com", "paragraphs": ["Using that, we can write functions to push each kind of object onto the VM’s stack:void pushInt ( VM * vm , int intValue ) { Object * object = newObject ( vm , OBJ_INT ); object -> value = intValue ; push ( vm , object ); } Object * pushPair ( VM * vm ) { Object * object = newObject ( vm , OBJ_PAIR ); object -> tail = pop ( vm ); object -> head = pop ( vm ); push ( vm , object ); return object ; }And that’s it for our little VM.\nHandling that is simple:void mark ( Object * object ) { object -> marked = 1 ; if ( object -> type == OBJ_PAIR ) { mark ( object -> head ); mark ( object -> tail ); } }But there’s a bug here.\nFirst, let’s write a function that creates and initializes a VM:VM * newVM () { VM * vm = malloc ( sizeof ( VM )); vm -> stackSize = 0 ; return vm ; }Once we’ve got a VM, we need to be able to manipulate its stack:void push ( VM * vm , Object * value ) { assert ( vm -> stackSize < STACK_MAX , \"Stack overflow!\nFirst let’s wrap the two phases together:void gc ( VM * vm ) { markAll ( vm ); sweep ( vm ); }You couldn’t ask for a more obvious mark-sweep implementation.\nTo sweep through and delete the unmarked objects, we just need to traverse the list:void sweep ( VM * vm ) { Object ** object = & vm -> firstObject ; while ( * object ) { if ( !"], "author": "http://journal.stuffwithstuff.com/2013/12/08/babys-first-garbage-collector/", "team": "Webmaster"}, {"date": ["http://www.bbc.com/news/magazine-35152716"], "header": "The return of the Honky Chateau", "team": "Webmaster", "paragraphs": ["Image copyright Marie-Claude Magne Image caption Marie-Claude at 18, during her unforgettable years at the Chateau\"Those years were like a dream.\nImage copyright Marie-Claude Magne Image caption A promotional image for a brochure advertising the chateau captures its bohemian ethos\"Herouville was the original residential studio.\nImage copyright AlamyA once-famous recording studio in a French chateau is being refurbished and will reopen in 2016.\nImage copyright Marie-Claude Magne Image caption The local firefighters sip their LSD-laced drinks, at the start of a very memorable evening\"The next day we got up.\nHugh Schofield's tour of the Honky Chateau features on Broadcasting House on BBC Radio 4, on 27 December at 09:00 GMT."], "author": "http://www.bbc.com/news/magazine-35152716"}, {"date": ["http://www.colourlovers.com/blog/2007/09/02/the-muller-formula-or-predictable-color-preferences"], "header": "The Müller Formula (or: Predictable Color Preferences) by COLOURlovers :: COLOURlovers", "author": "http://www.colourlovers.com/blog/2007/09/02/the-muller-formula-or-predictable-color-preferences", "paragraphs": ["Now we pair the last combination with the 'ugly' combination on the left and the 'nice' combination on the right.\nThere is some dispute in academia whether or not to interpret the 'nice' color combinations as good taste.\nBecause people in this group often lay claim to 'good' taste, in my opinion the 'taste' hypothesis doesn't hold.\nMüller's formula predicts that these color combinations will be considered as ugly by most people.\nBut I also noticed that people in creative professions, such as artists or designers, often tend to like the 'ugly' combinations."], "team": "Webmaster"}, {"date": ["https://www.macstories.net/roundups/my-must-have-ios-apps-2015-edition/"], "header": "My Must-Have iOS Apps, 2015 Edition – MacStories", "team": "Webmaster", "author": "https://www.macstories.net/roundups/my-must-have-ios-apps-2015-edition/", "paragraphs": ["Combined, paid apps, apps with IAPs, annual subscriptions, and one monthly subscription for 12 months cost me $302.53 in 2015, with an ideal cost of $0.83/day.\nBelow, you'll find my Must-Have iOS Apps for 2015 – the ones that have been essential for my workflow over the past 12 months.\nStatsWith the help of Graham Spencer, I've put together some stats and interesting details about my must-have iOS apps as compared to previous years.\nAfter researching all my options for editing video on iOS, I've settled with Pinnacle Studio Pro.\nInstead of having two separate articles for my must-have iPhone and iPad apps, I combined my 50 picks in a single list and organized them in eight categories."]}, {"date": ["http://www.independent.co.uk/voices/campaigns/give-to-gosh/great-ormond-street-hospital-surgeon-warns-of-the-dangers-of-button-batteries-a6783641.html"], "header": "Great Ormond Street Hospital surgeon warns how swallowing a button battery could be lethal", "paragraphs": ["There are as many as 6,000 button battery swallowings a years in the US but numbers are not recorded here.\nHe also wants manufacturers to make button battery compartments “totally childproof”.\n“You worry about normal batteries but you don’t think about button batteries.\nShe is in intensive care after, unknown to her parents, she swallowed a button battery in August.\nChildren are going to get presents and presents are going to contain more button batteries."], "author": "http://www.independent.co.uk/voices/campaigns/give-to-gosh/great-ormond-street-hospital-surgeon-warns-of-the-dangers-of-button-batteries-a6783641.html", "team": "Webmaster"}, {"date": ["http://www.todayifoundout.com/index.php/2013/08/how-the-speed-of-light-was-first-measured/"], "header": "How the Speed of Light was First Measured", "team": "Webmaster", "paragraphs": ["Christiaan Huygens later converted this to more commonplace numbers, showing that by Römer’s estimation, light traveled at about 220,000 kilometres per second.\nGalileo, like Beeckman also suspected that the speed of light wasn’t infinite and made passing references to an experiment involving lanterns in some of his work.\nThe only thing Galileo could surmise was that if light wasn’t infinite, it was fast and that experiments on such a small scale were destined to fail.\nIt wasn’t until Danish Astronomer, Ole Römer entered the fray that measurements of the speed of light got serious.\nAside from the debate over whether the speed of light was infinite or not, a common side debate throughout history was whether or not light originated in the eye itself or from something else."], "author": "http://www.todayifoundout.com/index.php/2013/08/how-the-speed-of-light-was-first-measured/"}, {"date": ["http://www.technologyreview.com/article/400335/melted-chocolate-to-microwave/"], "header": "Melted Chocolate to Microwave", "author": "http://www.technologyreview.com/article/400335/melted-chocolate-to-microwave/", "paragraphs": ["Raytheon named the original microwave the “Radarange” because it cooked food using the same radio-wave-producing magnetron tubes that the company manufactured for use in military radar.\nRaytheon credits the discovery of microwave cooking to a grade-school-educated engineer named Percy L. Spencer.\nIf so, your microwave is a descendant of the device on the right.\nThis is the first microwave oven, built by Massachusetts-based Raytheon in 1947; it operated for three decades in the kitchen of one of Raytheon’s founders.\nRaytheon capitalized on Amana’s experience in marketing and distributing consumer goods, and in 1967 introduced the under-$500 countertop Amana Home Radarange."], "team": "Webmaster"}, {"date": ["http://www.codeupstart.com/project/build-kickstarter-with-python-and-flask"], "header": "CodeUpStart", "team": "Webmaster", "author": "http://www.codeupstart.com/project/build-kickstarter-with-python-and-flask", "paragraphs": [""]}, {"date": ["http://bughunting.guide/discovering-xss-vulnerabilities-with-burp-intruder/"], "header": "Discovering XSS Vulnerabilities with Burp Intruder", "paragraphs": ["InstallationThe first step in using Burp Intruder is downloading Burp Suite.\nThere's some marketing fluff, but if you skip to the good stuff, you'll see:A typical workflow using Burp Intruder is as follows: Identify an interesting or vulnerable request within any of the Burp Suite tools, and send this to Intruder.\nBurp Intruder is an excellent (and again, free) tool that should be in the arsenal of every pentester.\nBurp Intruder (which is available in the free version of the product) requires a little more tact.\nAnd add this, a .txt file of common XSS payloads taken from rsnake (all credit and praise to him)."], "author": "http://bughunting.guide/discovering-xss-vulnerabilities-with-burp-intruder/", "team": "Webmaster"}, {"date": ["https://www.quora.com/Why-are-front-end-developers-so-high-in-demand-at-startups-if-front-end-development-is-relatively-easier-than-other-fields-of-engineering?share=1"], "header": "Why are front end developers so high in demand at startups if front end development is relatively easier than other fields of engineering?", "team": "Webmaster", "paragraphs": ["I promised two reasons, so here's #2: Frontend work's low barrier to entry means the variance in skill across the pool of candidates is higher than for backend engineers.\nFrontend engineering is dismissed as easy because there's a misalignment of perspectives between frontend and systems engineers.\n) But since those are the metrics they care about, and improving them is a hard problem that requires lots of skill, systems people's definition of \"hard\" is naturally biased toward that sort of engineering.\nPixel-perfect comps, across different browsers with different JavaScript engines and differently buggy implementations of different drafts of CSS, are almost always a requirement.\nThe candidates you really want, and the ones there's demand for, are engineers first and frontend people second."], "author": "https://www.quora.com/Why-are-front-end-developers-so-high-in-demand-at-startups-if-front-end-development-is-relatively-easier-than-other-fields-of-engineering?share=1"}, {"date": ["http://biology.stackexchange.com/questions/24505/theranos-blood-tests-specificity-and-accuracy"], "header": "Theranos blood test's Specificity and Accuracy?", "author": "http://biology.stackexchange.com/questions/24505/theranos-blood-tests-specificity-and-accuracy", "paragraphs": ["How can Theranos blood test's be specific and accurate compared to conventional full blood test?\nIf they reliably control dilution of the small sample, they maybe able to provide high quality results for some tests.\nI discussed the sample volume issue above regarding PCR amplification and how good tests use up to 50uL.\nIn these tests, they rely more on dilution or small volumes to perform detection.\nFinger pricks also skew certain tests even when technique is good such as platelet and WBC values in the CBC."], "team": "Webmaster"}, {"date": ["http://bughunting.guide/a-gentle-introduction-to-cross-site-scripting-xss/"], "header": "A Gentle Introduction to Cross-Site Scripting (XSS)", "team": "Webmaster", "author": "http://bughunting.guide/a-gentle-introduction-to-cross-site-scripting-xss/", "paragraphs": ["Let's talk about two of the most common methods for sanitizing data (before swinging back to our Google Gruyere XSS attack).\nGoogle Gruyere, as already covered, is a great resource with tutorials on a multitude of web security subjects.\nWith that in mind, we're going to cover one of the most common vulnerabilities found in websites today: Cross-site scripting, or XSS (the 'X' stands for cross).\nOne that might more easily slip past whatever basic sanitation mechanisms Google Gruyere has in place.\nReflected XSS is another common variation of XSS and operates on many of the same principles."]}, {"date": ["http://www.wsj.com/articles/at-theranos-many-strategies-and-snags-1451259629"], "header": "At Theranos, Many Strategies and Snags", "paragraphs": ["Nevertheless, Celgene signed a $3 million contract with Theranos for a custom-made blood test and use of the company’s computer model, two former Theranos employees say.\nA spokeswoman for Theranos, Brooke Buchanan, says Ms. Holmes recalls only one machine with an error message, because someone tripped over the cord.\nTheranos’s Ms. Buchanan says Ms. Holmes remembers the meeting very differently and would never leave a meeting so abruptly.\nMs. Holmes was unfazed, blamed a minor technical glitch and continued to pitch the vast potential of her technology.\nSafeway Inc. and Walgreens agreed to offer Theranos tests in stores."], "author": "http://www.wsj.com/articles/at-theranos-many-strategies-and-snags-1451259629", "team": "Webmaster"}, {"date": ["http://www.theedadvocate.org/do-gamified-language-learning-apps-work/"], "header": "Do Gamified Language Learning Apps Work?", "team": "Webmaster", "paragraphs": ["Do Gamified Language Learning Apps Work?\nGamified language learning apps are not without their drawbacks.\nFor now, gamified language learning apps should be best thought of as a useful supplement to traditional face-to-face teaching models, and its creators are quick to acknowledge as much.\nGamified language learning applications are enjoying millions of downloads, and a certain degree of popular prestige, with Duolingo being named Apple’s app of the year for 2013.\nDissenters say that gamified language learning apps only teach you vocabulary and grammar rules rather than how to actually speak a language, but then again, these same criticisms can be justifiably leveled at many traditional teaching methods."], "author": "http://www.theedadvocate.org/do-gamified-language-learning-apps-work/"}, {"date": ["http://www.latimes.com/business/technology/la-fi-1227-cutting-edge-overwatch-20151227-story.html"], "header": "How Blizzard turned a costly failure into the highly anticipated 'Overwatch'", "author": "http://www.latimes.com/business/technology/la-fi-1227-cutting-edge-overwatch-20151227-story.html", "paragraphs": ["But Blizzard Chief Executive Mike Morhaime and Chief Development Officer Frank Pearce instead quickly tapped him to lead \"Overwatch.\nWhen Kaplan first pitched \"Overwatch\" to Activision Blizzard Chief Executive Bobby Kotick, he whizzed through slides depicting characters.\nBlizzard epitomizes the overused but always important proverb that \"failure is learning,\" said John Smedley, former chief executive of Sony Corp.'s online gaming unit.\n\"'Overwatch' is a truly revolutionary game for the first-person shooter genre, and the foundation of Titan is exactly what led them there.\nTo the bosses, releasing a dud of a game would have been true failure and more costly."], "team": "Webmaster"}, {"date": ["https://www.linkedin.com/pulse/convertible-debt-investments-longer-eligible-il-angel-drew-whiting"], "header": "Convertible Debt Investments No Longer Eligible for IL Angel Tax Credit", "team": "Webmaster", "author": "https://www.linkedin.com/pulse/convertible-debt-investments-longer-eligible-il-angel-drew-whiting", "paragraphs": ["Important TakeawaysThe State of Illinois DCEO is no longer accepting convertible debt investments as eligible for tax credits under the IL Angel Investment Credit Program.\nIn 2016, the Illinois Department of Commerce and Economic Opportunity will no longer accept convertible debt investments for the Illinois Angel Investment Program tax credit.\nThe Angel Investment Credit Program was enacted in Illinois to encourage investors to make “angel”, or “seed” investments in early stage, innovative businesses in Illinois.\nThe website for the IL DCEO, and specifically the Angel Investment Credit Program, is listed here.\nMost importantly, the State has approved the SAFE as eligible for tax credits under the IL Angel Credit Program."]}, {"date": ["https://www.dirwiz.com/news/284"], "header": "Writing our own tools. Mailer v1.6", "paragraphs": ["We do utilize as much open source software internally, though sometimes you just can't find that one feature you need in either commercial or open source software.\nOur hope is, this little program will make your systems administration task a bit easier as it has for us.\nWe have come to love this little program so much we considered selling it, but we are not geared for consumer sales.\nWe are aware of all of the open source options in the world out there.\nIt does not have any dependencies, yet still can send email via SSL/TLS."], "author": "https://www.dirwiz.com/news/284", "team": "Webmaster"}, {"date": ["http://www.wired.com/2015/12/2015-the-year-the-internet-of-things-got-hacked/"], "header": "How the Internet of Things Got Hacked", "team": "Webmaster", "paragraphs": ["And this year has made clearer than ever before that this Internet of Things introduces all the vulnerabilities of the digital world into our real world.\nBut the remedies they devise for these pumps could serve as a model for securing other medical devices as well.\n“This might be the kind of software bug most likely to kill someone.”Medical DevicesHacked cars aren’t the only devices in the Internet of Things that are capable of killing, of course.\n“2015 has been the pivotal year when we saw awareness and vulnerability discoveries published about ‘things’,” Rouland says.\nUnfortunately, many of the problems with medical devices can’t be fixed with a simple software patch—instead, they require the systems to be re-architected."], "author": "http://www.wired.com/2015/12/2015-the-year-the-internet-of-things-got-hacked/"}, {"date": ["https://medium.com/@luismig11034821/how-i-bought-an-iphone-5-for-90-using-python-8bee68dbf6ef#.ny6iuie3r"], "header": "How I bought an IPhone 5 for 90$ using Python — Medium", "author": "https://medium.com/@luismig11034821/how-i-bought-an-iphone-5-for-90-using-python-8bee68dbf6ef#.ny6iuie3r", "paragraphs": ["How I bought an IPhone 5 for 90$ using PythonAfter the official release of the IPhone 5C and 5S I decided I wanted to buy an IPhone.\nAlso it was a good excuse to learn Python :)If you are interested check out the Python script hereThank you Joao for reviewing this post.\nBased on this assumption I quickly wrote a scrappy program in Python using Mechanize ( a library for automatic interaction with browsers ), that searched IPhone 5 in OLX, and did that for every potential IPhone found.\nFinally, I would make a not-so-low price offer that they would be inclined to take, thinking it was a good offer when compared to the other ones.\nThe seller would then have the option to decline or accept your offer via email."], "team": "Webmaster"}, {"date": ["http://www.businessinsider.com/anonymous-helps-making-a-murderer-subject-steven-avery-2015-12"], "header": "Anonymous helps 'Making a Murderer' subject Steven Avery", "team": "Webmaster", "author": "http://www.businessinsider.com/anonymous-helps-making-a-murderer-subject-steven-avery-2015-12", "paragraphs": ["It appears that hacking group Anonymous is trying to help Steven Avery, the subject of the new Netflix documentary series \"Making a Murderer.\nAvery was later convicted of killing her and Dassey of helping him, and his case and its complications are investigated by \"Making a Murderer.\nAnonymous' alleged evidence list and phone records could shed some light on the officers' conduct during the Halbach investigation and trial that sent Avery back to prison with a life sentence.\nShe was last seen on the Avery family's property in 2005 shooting photos of a car.\nAndrew Colburn By Tuesday We Will Have The Evidence Gathering List What Was Photographed #MakingAMurderer Planter!"]}, {"date": ["http://www.vrinflux.com/newton-vr-physics-based-interaction-on-the-vive/"], "header": "Physics Based Interaction on the Vive", "paragraphs": ["Physics is hardEven though we wanted a physics based interaction system, we didn’t limit ourselves when experimenting.\nIt became obvious that if we wanted to create a really dynamic VR experience, physics based interaction was the way to go.\nNone of these interactions had to be manually implemented; they’re handled by Unity and PhysX because we use a physics based interaction system.\nQuaternion QuagmireRotations are quaternions, and quaternion arithmetic is not handled through operators in Unity, so we cannot simply take the (Hand Rotation - Object Rotation) and end with the rotational difference.\nWe tried both physics based and non-physics based solutions for a large variety of scenarios."], "author": "http://www.vrinflux.com/newton-vr-physics-based-interaction-on-the-vive/", "team": "Webmaster"}, {"date": ["http://www.ozapato.com/blog/its-time-for-a-fashion-revolution/"], "header": "It’s Time for a Fashion Revolution", "team": "Webmaster", "paragraphs": ["Most recently on December 2nd, Fashion Revolution launched its first white paper, It’s Time for a Fashion Revolution, for the European Year for Development.\nOur vision is is a fashion industry that values people, the environment, creativity and profit in equal measure” explained Sarah Ditty on behalf of Fashion Revolution.\nIn Berlin, Germany, the leaders of the NGO Fashion Revolution conducted an experiment earlier this year, selling t-shirts for only €2 in a public square.\nWatch the new video for the European Year for Development at the event: Why We Need a Fashion Revolution.\nThis video was published on April 24, 2015 – Fashion Revolution Day."], "author": "http://www.ozapato.com/blog/its-time-for-a-fashion-revolution/"}, {"date": ["http://thenextweb.com/insider/2015/12/27/snapdrop-is-a-handy-web-based-replacement-for-apples-fiddly-airdrop-file-transfer-tool/"], "header": "Snapdrop is a handy Web-based replacement for Apple's fiddly AirDrop file transfer tool", "author": "http://thenextweb.com/insider/2015/12/27/snapdrop-is-a-handy-web-based-replacement-for-apples-fiddly-airdrop-file-transfer-tool/", "paragraphs": ["It works simply enough: open the Snapdrop Webpage on two devices while on the same network, then transfer files between the two with a few clicks.\nIf AirDrop has ever randomly failed you when you needed it most, Snapdrop is a handy bookmark to have.\nIt’s not the only AirDrop competitor, obviously, but is the only I’m aware of that lets you visit a webpage and transfer files without the need to create an account.\nCurrently, there are no limits on how many files you can transfer (that I’ve noticed), or how much data you can move.\nA new web-based option named Snapdrop might actually be a better choice."], "team": "Webmaster"}, {"date": ["http://www.denverpost.com/news/ci_29318232/federal-judge-hears-arguments-marijuana-banking"], "header": "Judge sympathizes with pot businesses but has misgivings about banking", "team": "Webmaster", "author": "http://www.denverpost.com/news/ci_29318232/federal-judge-hears-arguments-marijuana-banking", "paragraphs": ["Colorado credit union seeks federal approval to cater to marijuana businessesA federal judge said Monday he sympathizes with pot businesses faced with contradictory regulations, but he expressed misgivings about forcing federal officials to approve a marijuana credit union.\n\"AdvertisementHe said if he was a member of Congress he would vote in favor of allowing pot banking, but he is a federal judge and must uphold existing laws.\nThe judge also asked Barker why the Federal Reserve doesn't negotiate with the credit union in a way that doesn't violate federal law.\nBut the Federal Reserve now says marijuana proceeds can't go into the banking system.\n\"Are you saying the Federal Reserve is giving out accounts based on what people believe in?"]}, {"date": ["http://phys.org/news/2015-12-demo-processor-ultrafast.html"], "header": "Engineers demo first processor that uses light for ultrafast communications", "paragraphs": ["The light rays emanating from the chip are drawn to show that the processor talks to the outside world using light.\nThe electronic-photonic processor chip communicates to the outside world directly using light.\nRaw, high-resolution photo of the chip, with all chip electrical and photonic features clearly visible.\nThe researchers packed two processor cores with more than 70 million transistors and 850 photonic components onto a 3-by-6-millimeter chip.\nTo enable light to move through the chip with minimal loss, for instance, the researchers used the silicon body of the transistor as a waveguide for the light."], "author": "http://phys.org/news/2015-12-demo-processor-ultrafast.html", "team": "Webmaster"}, {"date": ["http://www.androidauthority.com/google-glass-enterprise-edition-passes-through-fcc-664698/"], "header": "Google Glass Enterprise Edition passes through the FCC", "team": "Webmaster", "paragraphs": ["Google Glass Enterprise Edition has just stopped by the FCC.\nIt’s pretty clear that Google isn’t thinking about ditching Google Glass anytime soon.\nCalled Google Glass Enterprise Edition, this new headset is said to sport a faster processor made by Intel, a larger prism display and improved battery life.\nNot too long ago Google patented a hologram-enabled version of Google Glass, and we’ve also heard that the Glass team has an audio-based connected headset in the works.\nThe next version of Glass will be aimed at the workplaceIn all, the Enterprise Edition headset looks a lot like the first Explorer Edition hardware, with a few exceptions."], "author": "http://www.androidauthority.com/google-glass-enterprise-edition-passes-through-fcc-664698/"}, {"date": ["https://donmelton.com/2015/12/26/the-move-to-wordpress-and-the-traffic-that-followed/"], "header": "The move to WordPress and the traffic that followed", "author": "https://donmelton.com/2015/12/26/the-move-to-wordpress-and-the-traffic-that-followed/", "paragraphs": ["Nobody should ever run a self-hosted WordPress site without some form of static page caching.\nNow, moving to WordPress had nothing to do with all the traffic.\nWhat enabled all this reliability from a little WordPress blog?\nA few weeks ago when I first considered moving to WordPress, I noticed that Guy was using DreamHost for his blog, kickingbear.\nOn Tuesday evening, I converted this self-hosted site from a collection of simple, static HTML files to a full WordPress content management system."], "team": "Webmaster"}, {"date": ["http://www.cnet.com/news/massive-trove-of-voters-election-data-discovered-on-web/"], "header": "Massive trove of US voter data discovered on Web", "team": "Webmaster", "author": "http://www.cnet.com/news/massive-trove-of-voters-election-data-discovered-on-web/", "paragraphs": ["The voter information is just the latest data discovered sitting openly viewable on the Internet and easily accessible with the click of a mouse.\nWilliam Whitehurst/CorbisIf you have voted in a US election recently, there's a good chance your personal information is included in a trove of voter data found on a publicly available Web server.\nIn California, voter registration cards are confidential and can only be accessed under certain circumstances.\nVickery told Databreaches.net he confirmed the data's authenticity by locating his own information.\nVoter registration lists are public record in most states, but many have restrictions on how the data may be used."]}, {"date": ["http://www.washingtonpost.com/sf/national/2015/12/27/aianxiety/#"], "header": "Some scientists fear superintelligent machines could pose a threat to humanity", "paragraphs": ["“The progress has not been as steady as people say, and the machine skills are really far from being ready to match our skills,” she said.\nJust down Vassar Street from Tegmark’s office is MIT’s Computer Science and Artificial Intelligence Laboratory, where robots are aplenty.\nMore than half a century of research on artificial intelligence has yet to produce anything resembling a conscious, willful machine.\nOften there is no one person who understands exactly how these systems work or are operating at any given moment.\nIn our increasingly technological society, we rely on complex systems that are vulnerable to failure in complex and unpredictable ways."], "author": "http://www.washingtonpost.com/sf/national/2015/12/27/aianxiety/#", "team": "Webmaster"}, {"date": ["http://mobile.nytimes.com/2015/12/29/technology/universities-race-to-nurture-start-up-founders-of-the-future.html"], "header": "Universities Race to Nurture Start-Up Founders of the Future", "team": "Webmaster", "paragraphs": ["Hesam Panahi, founder of the University of Houston's start-up accelerator, teaches students entrepreneurship skills at the start-up training event in Houston.\nStudents at a 3 Day Startup event put on by Rice University and the University of Houston in October.\nHOUSTON — The original charter of Rice University, drafted in 1891, established a school here dedicated to the advancement of literature, science and art.\nSome universities that already have entrepreneurship programs are redoubling their efforts.\nPrinceton, for instance, offers a variety of entrepreneurship courses."], "author": "http://mobile.nytimes.com/2015/12/29/technology/universities-race-to-nurture-start-up-founders-of-the-future.html"}, {"date": ["http://www.bloombergview.com/articles/2015-12-28/bernienomics-101"], "header": "Bernienomics 101", "author": "http://www.bloombergview.com/articles/2015-12-28/bernienomics-101", "paragraphs": ["And that is why secured loans, like mortgages, get lower interest rates than unsecured loans, like credit card balances and student loans.\nThat’s why poor people, on top of all the other unfairness heaped upon them, pay higher interest rates.\nSecured loans have thus always carried lower interest rates than unsecured loans, and will do so until the heat death of the universe renders moot such questions.\nLet’s say you had $150 that you really needed to have at the end of the month, say to pay your rent.\nTo contact the author of this story:Megan McArdle at mmcardle3@bloomberg.netTo contact the editor responsible for this story:James Gibney at jgibney5@bloomberg.net"], "team": "Webmaster"}, {"date": ["https://www.reddit.com/r/firefall/comments/3yhguu/red_5_employee_without_a_paycheck_here_ama/?sort=new&limit=500"], "header": "Red 5 employee without a paycheck here. AMA!", "team": "Webmaster", "author": "https://www.reddit.com/r/firefall/comments/3yhguu/red_5_employee_without_a_paycheck_here_ama/?sort=new&limit=500", "paragraphs": ["So, yeah, I'm a Red 5 employee.\nThe rumors are true, I did not get paid on the 25th when payroll was supposed to go through.\nI can provide proof if needed to mods, assuming my identity is kept secret.\nI no longer have any faith in a company I once loved.\nMorale at the studio has been shit for about the past year, went up with the hiring of Chris Whiteside and the promise of an awesome China launch, but then went to shit again after the launch failed and Chris was let go, along with 20% of the studio."]}, {"date": ["https://www.washingtonpost.com/news/wonk/wp/2015/12/22/women-really-do-pay-more-for-razors-and-almost-everything-else/"], "header": "Why you should always buy the men’s version of almost anything", "paragraphs": ["“Many men's products are not seen as men's products,” he said.\n(Photo courtesy of the New York City Department of Consumer Affairs)Radio Flyer sells a red scooter for boys and a pink scooter for girls.\n“They might just be seen as products in the category.”Which makes the “pink” version a specialty product, he said.\nCourtesy of the New York City Department of Consumer AffairsAcross the New York sample, women’s products carried higher price tags 42 percent of the time, while men’s products cost more 18 percent of the time.\n\"Researchers for the New York City Department of Consumer Affairs pored over toys, children’s clothing, adult apparel, personal care products and home goods sold in the city."], "author": "https://www.washingtonpost.com/news/wonk/wp/2015/12/22/women-really-do-pay-more-for-razors-and-almost-everything-else/", "team": "Webmaster"}, {"date": ["http://www.bloombergview.com/articles/2015-11-09/what-if-swiss-banks-tried-100-percent-reserve-banking-"], "header": "What If Banks Didn't Create Money?", "team": "Webmaster", "paragraphs": ["A Swiss initiative to ban private banks from creating money has gathered enough signatures to put the matter to a referendum.\nUnder such a system, private banks would only serve as intermediaries for citizens and businesses, in effect keeping current accounts with the central bank.\nCentral banks only influence the process through regulation.\nIn June 2015, Swiss banks had 1.58 trillion Swiss francs (about the same in U.S. dollars) worth of loans on their balance sheets -- about 230 percent GDP.\nSomehow, the idea that governments are less evil and better at making financial decisions than private banks has survived that disaster."], "author": "http://www.bloombergview.com/articles/2015-11-09/what-if-swiss-banks-tried-100-percent-reserve-banking-"}, {"date": ["http://www.bbc.co.uk/news/entertainment-arts-35192060"], "header": "Lemmy, Motorhead frontman, dies aged 70 after cancer diagnosis", "author": "http://www.bbc.co.uk/news/entertainment-arts-35192060", "paragraphs": ["Rest In Peace Lemmy.\n'Wonderful man'As Lemmy of Motorhead, he became known for his fast and furious bass guitar playing and gravelly voice.\n\"Guns N' Roses bassist Duff McKagan added: \"Rest In Peace Lemmy.\nMedia caption The BBC's Nick Serpell looks back on the life of LemmyMotorhead frontman Lemmy has died aged 70, two days after learning he had cancer, the British band has announced.\nHe acquired the nickname Lemmy while at school, although he claimed to have had no idea where it came from."], "team": "Webmaster"}, {"date": ["http://www.inc.com/empact/here-s-my-exact-strategy-for-turning-15k-into-200k-every-month.html?cid=cp01002fastco"], "header": "Here's My Exact Strategy for Turning $15,000 Into $200,000 Every Month", "team": "Webmaster", "author": "http://www.inc.com/empact/here-s-my-exact-strategy-for-turning-15k-into-200k-every-month.html?cid=cp01002fastco", "paragraphs": ["This free Landing Page 101 course walks you through tips on creating a landing page.\nIf we did that, though, we'd be wasting our time in meaningless conversations with people who aren't a good fit.\n5: Talk With Potential Customers One-on-OneThe 35 to 45 minute conversation serves three purposes:It filters out people who aren't a good fit.\n1: Target My Exact Customer on Facebook and TwitterEvery month, I spend $15,000 to $20,000 on Twitter and Facebook ads.\nIf you're just getting started, I recommend using LeadPages to create your landing page."]}, {"date": ["http://qz.com/582587/mark-zuckerberg-cant-believe-india-isnt-grateful-for-facebooks-free-internet/"], "header": "Mark Zuckerberg can't believe India is debating net neutrality rather than being grateful for Facebook's free internet", "paragraphs": ["Over and over again, Zuckerberg has pointed to research showing that internet access can help lift people out of poverty.\nFor the people who choose not to upgrade to or can’t afford to pay for full internet access, Internet.org does indeed provide a walled garden of online content.\nBut examined more closely, his arguments don’t directly address the concerns of net neutrality activists.\n“Surprisingly, over the last year there’s been a big debate about this in India.”Yes, net neutrality is a big deal—and not just in India.\nBut Zuckerberg almost portrays net neutrality as a first-world problem that doesn’t apply to India because having some service is better than no service."], "author": "http://qz.com/582587/mark-zuckerberg-cant-believe-india-isnt-grateful-for-facebooks-free-internet/", "team": "Webmaster"}, {"date": ["http://www.thedailybeast.com/articles/2015/06/25/taylor-swift-is-the-new-prince-the-artist-that-tamed-the-corporate-giant.html"], "header": "Taylor Swift Is the New Prince: The Artist Who Tamed the Corporate Giant", "team": "Webmaster", "paragraphs": ["But as in most things, The Artist Formerly Known As ‘The Artist Formerly Known As Prince’ got there first.\nBut the issue of how artists are compensated by record labels and streaming services is far more complex.\nAfter Apple’s reversal, Swift, along with many indie labels, were quick to board the project.\nAfter shuttering the site, Prince refused to provide his 2010 album 20Ten to digital download providers, declaring, “The Internet’s completely over.\nIn the 20 years since Prince began his battle for control of his work, much in the music industry has changed."], "author": "http://www.thedailybeast.com/articles/2015/06/25/taylor-swift-is-the-new-prince-the-artist-that-tamed-the-corporate-giant.html"}, {"date": ["https://medium.com/@hardaway/when-you-go-to-work-at-a-startup-read-its-financials-934e58323e62"], "header": "When You Go to Work at a Startup, Read its Financials — Medium", "author": "https://medium.com/@hardaway/when-you-go-to-work-at-a-startup-read-its-financials-934e58323e62", "paragraphs": ["When You Go to Work at a Startup, Read its FinancialsIt’s not only unicorns that could be in trouble next year.\nI’m always amazed at how little the entrepreneurs we’ve been coaching for almost two decades know about financial statements.\nThe never-acknowledged truth that working at a startup, even a well-funded one, in Silicon Valley is risky will be outed.\nThat’s why I wonder whether Uber, still in volatile startup mode, should be doing a naming deal with the Warriors.\nSo here’s my rant: no one should go to work for a startup unless he or she knows how to read a profit and loss statement or a cash flow statement at the very least."], "team": "Webmaster"}, {"date": ["http://arstechnica.com/gadgets/2015/12/new-google-glass-model-hits-the-fcc-website-images-included/"], "header": "New Google Glass model hits the FCC website, images included", "team": "Webmaster", "author": "http://arstechnica.com/gadgets/2015/12/new-google-glass-model-hits-the-fcc-website-images-included/", "paragraphs": ["There have also been reports of a mysterious Google Glass reboot and a rename to \"Project Aura.\nThe pictures show a Google Glass unit with the FCCID \"A4R­-GG1\" that looks a lot like the existing Glass design.\nThe new Google Glass model.\nGoogle Glass is not dead.\nIn general, the case looks smoother and rounder than the previous version of Google Glass."]}, {"date": ["http://fortune.com/2015/09/01/steve-wozniak-bernie-sanders/"], "header": "Apple Co-Founder Steve Wozniak Supports Bernie Sanders in 2016", "paragraphs": ["Please find information on various licensing contacts below and choose the one that best suits your needs:1.\nThank you for your interest in licensing Fortune content.\nTo license a Fortune cover, order reprint or e-print copies of an article or cover, or license an accolade, please contact PARS International at www.timeincreprints.com.\nTo license Fortune articles, excerpts, or headlines for republication in various media (including books, eBooks, film, web, newsletters, newspapers, magazines and others), please email syndication@timeinc.com.\nTo license text only photocopies of Fortunearticles as print or digital handouts in academic settings, or in academic coursepacks, please contact the Copyright Clearance Center at www.copyright.com"], "author": "http://fortune.com/2015/09/01/steve-wozniak-bernie-sanders/", "team": "Webmaster"}, {"date": ["http://www.nytimes.com/2015/12/28/opinion/campaign-stops/250000-a-year-is-not-middle-class.html?mwrsm=Reddit&_r=0"], "header": "$250,000 a Year Is Not Middle Class", "team": "Webmaster", "paragraphs": ["Over the last decade and a half, fewer and fewer Americans are identifying as middle class, and a growing share says it is working or lower class.\nContinue reading the main story Stretching the Meaning of ‘Middle Class’ Households earning $250,000 are well above the threshold to join the richest 5 percent of Americans.\nThat shifting identity should relieve candidates of the sense that there is a political urgency in spouting the phrase “middle class,” and it demands a new framework — one that is honest about the class divisions in the country.\nAdvertisement Continue reading the main storyHILLARY CLINTON has vowed not to raise taxes on the middle class.\nThis has made him a target of the Clinton camp, which is telling voters that Mrs. Clinton is the only candidate pledging to shield the middle class."], "author": "http://www.nytimes.com/2015/12/28/opinion/campaign-stops/250000-a-year-is-not-middle-class.html?mwrsm=Reddit&_r=0"}, {"date": ["https://www.psychologytoday.com/blog/boys-men/201308/are-colleges-not-welcoming-young-men"], "header": "Are Colleges Not Welcoming Young Men?", "author": "https://www.psychologytoday.com/blog/boys-men/201308/are-colleges-not-welcoming-young-men", "paragraphs": ["On Father's Day, think about the role of the father in a boy's life."], "team": "Webmaster"}, {"date": ["http://www.fastcompany.com/3055003/fast-feed/the-first-look-at-the-second-google-glass?partner=rss"], "header": "The First Look At The Second Google Glass", "team": "Webmaster", "author": "http://www.fastcompany.com/3055003/fast-feed/the-first-look-at-the-second-google-glass?partner=rss", "paragraphs": ["Now the first images of Google Glass 2.0 have surfaced, on the U.S. Federal Communications Commission’s website.\n\"Look carefully and you'll also see there's a foldable hinge where the length of the wearable meets the glass prism.\n\"The new version of Google Glass has a larger glass prism, a faster Intel Atom processor, 5GHz Wi-Fi for more bandwidth-intensive tasks such as video streaming, and a more rugged and waterproof design,\" wrote Mashable.\nIt might surprise you to know that after the widespread derision aimed at the first version of Google Glass, the tech giant is readying a second iteration, and now we know what it will look like.\nThe hinge should make Google Glass easier to stow away in a pocket; the only way to store the old version was to use the included hard/soft case."]}, {"date": ["http://www.slate.com/articles/life/the_good_word/2011/05/the_rise_of_logical_punctuation.html"], "header": "Should we start placing commas outside quotation marks?", "paragraphs": ["But in copy-editor-free zones—the Web and emails, student papers, business memos—with increasing frequency, commas and periods find themselves on the outside of quotation marks, looking in.\nFor at least two centuries, it has been standard practice in the United States to place commas and periods inside of quotation marks.\nSticking a period or comma in front of the closing quotation marks could clearly have bad consequences.\nIn these endeavors, one is often instructed to \"input\" a string of characters, and sometimes (in the printed instructions) the characters are enclosed in quotation marks.\n\"Tales of the City\" and \"Out in the Silence\" are units—consisting of the words and the quotation marks."], "author": "http://www.slate.com/articles/life/the_good_word/2011/05/the_rise_of_logical_punctuation.html", "team": "Webmaster"}, {"date": ["http://biorxiv.org/content/early/2015/03/19/013896"], "header": "RNA-guided gene drives can efficiently and reversibly bias inheritance in wild yeast", "team": "Webmaster", "paragraphs": ["Our results demonstrate that RNA-guided gene drives are capable of efficiently biasing inheritance when mated to wild-type organisms over successive generations.\nAbstractInheritance-biasing “gene drives” may be capable of spreading genomic alterations made in laboratory organisms through wild populations.\nHere we report molecularly contained gene drive constructs in the yeast Saccharomyces cerevisiae that are typically copied at rates above 99% when mated to wild yeast.\nWe previously considered the potential for RNA-guided gene drives based on the versatile CRISPR/Cas9 genome editing system to serve as a general method of altering populations.\nWe successfully targeted both non-essential and essential genes, showed that the inheritance of an unrelated “cargo” gene could be biased by an adjacent drive, and constructed a drive capable of overwriting and reversing changes made by a previous drive."], "author": "http://biorxiv.org/content/early/2015/03/19/013896"}, {"date": ["http://roadsandkingdoms.com/2015/the-piha-stays-in-the-picture/"], "header": "The Piha Stays in the Picture", "author": "http://roadsandkingdoms.com/2015/the-piha-stays-in-the-picture/", "paragraphs": ["No one’s keeping great records of every usage of the piha, or most other birdsongs, in film.\n“That’s an anachronism as wrong as having Johnny Depp wearing a digital watch” in that movie, argues Stotz, “which they would never do.”Whither Piha?\n“Movies that otherwise strove for authenticity through historical context, costume, props, geographic setting, etc., were among the most grievous offenders.\nThey come through loud and clear wherever you are in much of South America’s rainforests, and were copiously recorded throughout the mid-20th century in high quality audio, easily accessible via institutions like the Macaulay Library, which has 153 screaming piha calls from 1961 on.\nThis oddly acceptable negligence bedevils bird watchers, given Hollywood’s usual attention to ambient detail and internet critics’ habit of eviscerating filmmakers for inaccuracies."], "team": "Webmaster"}, {"date": ["http://www.engadget.com/2015/12/28/samsung-bioprocessor/"], "header": "Samsung has an all-in-one health chip for wearables", "team": "Webmaster", "author": "http://www.engadget.com/2015/12/28/samsung-bioprocessor/", "paragraphs": ["Considering how err... interesting Samsung wearables tend to be, a possible scenario here is that the tech giant won't keep the Bio-Processor all to itself.\nIf you're wondering where, the inevitable follow-up to the aforementioned Gear S2 successor is a pretty likely bet.\nBear in mind that Samsung's latest smartwatch, the Gear S2 , only tracks your heart rate.\nWe won't have to wait too long to see these in the wild, either: Samsung promises it'll be packed into devices available early next year.\nWhether that shows its face at CES or Mobile World Congress is the real question, though."]}, {"date": ["http://kotaku.com/guy-beats-fallout-4-without-killing-anyone-nearly-brea-1749882569"], "header": "Guy Beats Fallout 4 Without Killing Anyone, Nearly Breaks The Game", "paragraphs": ["“I’d love to ask [Todd Howard why pacifism is so difficult in this Fallout,” Hinckley told me in an interview.\nIt was a mistake that cost him six lives, which is no good for a zero kill run.\nWorse, he had to stop his own companion from taking shots at anyone, because companion kills are logged as player kills.\nIn a way, Hinckley saw his no-kill playthrough as a way of showing the world that he refuses to be forgotten.\nAdvertisementSure enough, there are portions of Fallout 4 where the story railroads the player into killing certain key characters."], "author": "http://kotaku.com/guy-beats-fallout-4-without-killing-anyone-nearly-brea-1749882569", "team": "Webmaster"}, {"date": ["http://krebsonsecurity.com/2015/12/2016-reality-lazy-authentication-still-the-norm/"], "header": "Lazy Authentication Still the Norm — Krebs on Security", "team": "Webmaster", "paragraphs": ["Many companies will offer customers more account security options, but only if asked.\nTags: ISIS, Junaid Hussain, PayPal authentication failures, TeaMp0isoN\nSo much for PayPal’s supposed “monitoring;” the company couldn’t even spot the same fraudulent email address when it was added a second time.\nOn Christmas Eve morning, I received an email from PayPal stating that an email address had been added to my account.\nPayPal does offer additional security protections — including a PayPal Security Key fob that periodically generates a new one-time password which needs to be entered at login in addition to a username and password."], "author": "http://krebsonsecurity.com/2015/12/2016-reality-lazy-authentication-still-the-norm/"}], "members": {"leads": [{"grade": "template", "lastname": "template", "portrait": "template", "firstname": "template", "title": "Template"}], "programmers": [{"grade": 0, "lastname": "template", "firstname": "template", "portrait": ""}], "mentors": [{"lastname": "Wade", "firstname": "Christina", "portrait": ""}], "business": [{"grade": 0, "lastname": "template", "firstname": "template", "portrait": ""}], "engineers": [{"grade": 0, "lastname": "template", "firstname": "template", "portrait": ""}]}}